pullead/esp32-hifi/src/main.cpp
#include "common.h"
#include "ui/lvgl_runtime.h"
#include "ui/player_service.h"
#include "mwr_src/function.hpp"
#include "mwr_src/graphical.hpp"
#include "mwr_src/index.h"
#include "mwr_src/index.js.h"
#include "mwr_src/layout.hpp"
#include "gbk_table.h"
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <algorithm>
#include <cstring>
#include <freertos/queue.h>
#include <esp_heap_caps.h>
#include <esp_system.h>
#include <esp_wifi.h>
#include <cctype>

#if SOC_USB_OTG_SUPPORTED && CONFIG_TINYUSB_ENABLED && CONFIG_TINYUSB_MSC_ENABLED && !ARDUINO_USB_MODE
#include <USB.h>
#include <USBMSC.h>
#define MWR_USB_MSC_SUPPORTED 1
#else
#define MWR_USB_MSC_SUPPORTED 0
#endif

// USB 声卡（UAC2）模式。和 U 盘模式并列的第三个独立模式，两者互斥——
// 一个 USB 口、一套 TinyUSB 配置，同时只能是一种用途。
#if MWR_USB_DAC && SOC_USB_OTG_SUPPORTED && CONFIG_TINYUSB_ENABLED && !ARDUINO_USB_MODE
#include "usb_dac.h"
// usb_persist_restart() / restart_type_t 在这里声明（<USB.h> 不转出来），
// 退出声卡模式时要用它把 USB PHY 干净地交还给 ROM 的 USB-Serial/JTAG。
#include "esp32-hal-tinyusb.h"
#define MWR_USB_DAC_SUPPORTED 1
#else
#define MWR_USB_DAC_SUPPORTED 0
#endif

// Unified memory snapshot for the LVGL-96KB-to-PSRAM A/B test (see
// src/lv_conf.h's LV_ATTRIBUTE_LARGE_RAM_ARRAY comment) -- ESP.getFreeHeap()
// alone can't distinguish internal vs PSRAM, and doesn't capture largest-
// free-block (fragmentation) or the low-water mark, all of which matter for
// judging whether this migration actually freed usable internal RAM rather
// than just moving the reported total around.
static void logMemoryState(const char* stage) {
    const size_t internalFree = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    const size_t internalLargest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    const size_t internalMinimum = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    const size_t dmaFree = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
    const size_t dmaLargest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
    const size_t psramFree = heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    const size_t psramLargest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    printf("[MEM][%s] internal_free=%u internal_largest=%u internal_min=%u dma_free=%u dma_largest=%u psram_free=%u psram_largest=%u\n", stage,
           (unsigned)internalFree, (unsigned)internalLargest, (unsigned)internalMinimum, (unsigned)dmaFree, (unsigned)dmaLargest,
           (unsigned)psramFree, (unsigned)psramLargest);
}
// clang-format off
/*****************************************************************************************************************************************************
    MiniWebRadio -- Webradio receiver for ESP32-S3

    first release on 03/2017                                                                                                      */char Version[] ="\
    Version 4.2.0k - Jul 06, 2026                                                                                                               ";

/*  display (320x240px) with controller ILI9341 or
    display (480x320px) with controller ILI9486, ILI9488 or ST7796 (SPI) or
    display (800x480px) (RGB-HMI) with TP controller GT911 (I2C)
    display (1024x600px) (DSI) with TP controller GT911 (I2C)

    SD_MMC is mandatory
    IR remote is optional
    BT Transmitter is optional
    BH1750 (lightsensor) is optional

*****************************************************************************************************************************************************/

// THE SOFTWARE IS PROVIDED "AS IS" FOR PRIVATE USE ONLY, IT IS NOT FOR COMMERCIAL USE IN WHOLE OR PART OR CONCEPT. FOR PERSONAL USE IT IS SUPPLIED
// WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHOR OR COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE

// clang-format on

SET_LOOP_TASK_STACK_SIZE(14 * 1024);

// global variables

char _hl_item[18][40]{"",                    // none
                      "Internet Radio",      // "* интернет-радио *"  "ραδιόφωνο Internet"
                      "Audio Player",        // "** цифрово́й плеер **
                      "DLNA",                // Digital Living Network Alliance
                      "Clock",               // Clock "** часы́ **"  "** ρολόι **"
                      "Brightness",          // Brightness яркость λάμψη
                      "Alarm Clock (hh:mm)", // AlarmClock "будильник" "ξύπνημα"
                      "Off Timer (h:mm)",    // "Sleeptimer" "Χρονομετρητής" "Таймер сна"
                      "Stations List",
                      "Audio Files",
                      "DLNA List",
                      "Bluetooth",
                      "Equalizer",
                      "Settings",
                      "IR Settings",
                      "Alarm",
                      "WiFi Settings", //
                      ""};

constexpr uint16_t MAX_STATIONS = 1000;

dlnaHistory_s s_dlnaHistory[10];
timecounter_s s_timeCounter;
SD_content    s_SD_content;
Playlist      playlist;

IR_buttons     irb(&s_settings);
IR             ir(IR_PIN); // do not change the objectname, it must be "ir"
File           audioFile;
FtpServer      ftpSrv;
DLNA_Client    dlna;
KCX_BT_Emitter bt_emitter(BT_EMITTER_RX, BT_EMITTER_TX, BT_EMITTER_CONNECT, BT_EMITTER_MODE);
hp_BH1750      BH1750; // create the sensor
ES8311         es8311;

ps_ptr<char> s_time_s = "";
ps_ptr<char> s_myIP;
ps_ptr<char> s_icyDescription = "";
ps_ptr<char> s_streamTitle = "";
ps_ptr<char> s_cur_AudioFolder = "/audiofiles/";
ps_ptr<char> s_cur_AudioFileName = NULL;
ps_ptr<char> s_stationURL;
ps_ptr<char> s_playlistPath;
ps_ptr<char> s_stationName_air;
ps_ptr<char> s_homepage = "";
ps_ptr<char> s_TZName = "Europe/Berlin";
ps_ptr<char> s_TZString = "CET-1CEST,M3.5.0,M10.5.0/3";
ps_ptr<char> s_timeSpeechLang = "en";
ps_ptr<char> s_lyrics = "";

bool s_f_rtc = false; // true if time from ntp is received
bool s_f_100ms = false;
bool s_f_1sec = false;
bool s_f_10sec = false;
bool s_f_1min = false;
bool s_f_mute = false;
bool s_f_muteIsPressed = false;
bool s_f_recording = false;
bool s_f_sleeping = false;
bool s_f_isWebConnected = false;
bool s_f_WiFi_lost = false;
bool s_f_isFSConnected = false;
// Disambiguates PlayerSource::Radio vs ::CloudMusic when s_f_isWebConnected
// is true -- both play via the same connecttohost() stream connect (see
// playerCorePlayCloudUrl()), so playerCoreReadSnapshot() can't tell them
// apart from s_f_isWebConnected alone. Set true only by
// playerCorePlayCloudUrl(); every other connecttohost() call site
// (playerCorePlayRadioUrl, playerCorePlayStationNumber) resets it false.
bool s_cloudMusicPlaying = false;
bool s_f_eof = false;
bool s_f_reconnect = false;
bool s_f_eof_alarm = false;
bool s_f_alarm = false;
bool s_f_newIcyDescription = false;
bool s_f_newStreamTitle = false;
bool s_f_webFailed = false;
bool s_f_newBitRate = false;
bool s_f_newStationName = false;
bool s_f_newLyrics = false;
bool s_f_volBarVisible = false;
bool s_f_switchToClock = false;   // jump into CLOCK mode at the next opportunity
bool s_f_timeAnnouncement = true; // time announcement every full hour
bool s_f_playlistEnabled = false;
bool s_f_playlistNextFile = false;
bool s_f_logoUnknown = false;
bool s_f_pauseResume = false;
bool s_f_FFatFound = false;
bool s_f_clearLogo = false;
bool s_f_clearStationName = false;
bool s_f_dlnaBrowseServer = false;
bool s_f_dlnaWaitForResponse = false;
bool s_f_dlnaSeekServer = false;
bool s_f_dlnaMakePlaylistOTF = false; // notify callback that this browsing was to build a On-The_fly playlist
bool s_f_dlna_browseReady = false;
bool s_f_brightnessIsChangeable = false;
bool s_f_connectToLastStation = false;
bool s_f_msg_box = false;
bool s_f_esp_restart = false;
bool s_f_timeSpeech = false;
bool s_f_stationsChanged = false;
bool s_f_sd_card_found = false;
bool s_f_isWiFiConnected = false;
bool s_f_ok_from_ir = false;
// WiFi setup hotspot: broadcast when no saved network is reachable (see
// startWifiApFallback()), so a phone can join it and add real credentials
// via the WiFi setup page instead of the device being unreachable forever.
static volatile bool s_wifiApFallbackActive = false;
static const char* kWifiSetupApSsid = "MiniWebRadio-Setup";
static uint32_t s_eofCount = 0; // see PlayerSnapshot::eofCount

