pullead/esp32-hifi/src/main.cpp
int8_t   s_state = UNDEFINED; // statemaschine
int8_t   s_subState = UNDEFINED;
int8_t   s_subState_radio = UNDEFINED;
int8_t   s_subState_player = UNDEFINED;
int8_t   s_subState_clock = UNDEFINED;
int8_t   s_ir_btn_select = UNDEFINED; // IR menue item
int8_t   s_currDLNAsrvNr = -1;
uint8_t  s_alarmdays = 0;
uint8_t  s_cur_Codec = 0;
uint8_t  s_numServers = 0; //
uint8_t  s_level = 0;
uint8_t  s_sleepMode = 1; // 0 display off, 1 show the clock
AudioOutputPolicy s_audioOutputPolicy = AudioOutputPolicy::Source;
uint8_t  s_staListPos = 0;
uint8_t  s_cthFailCounter = 0; // connecttohost fail
uint8_t  s_itemListPos = 0;    // DLNA items
uint8_t  s_fileListPos = 0;
int8_t   s_alarmSubMenue = -1;
int8_t   s_sleepTimerSubMenue = -1;
uint8_t  s_ambientValue = 50;
uint8_t  s_dlnaLevel = 0;
uint8_t  s_resetReason = (esp_reset_reason_t)ESP_RST_UNKNOWN;
int16_t  s_totalNumberReturned = -1;
int16_t  s_dlnaMaxItems = -1;
int16_t  s_dlnaMaXServers = -1;
int16_t  s_alarmtime[7] = {0};  // in minutes (23:59 = 23 *60 + 59) [0] Sun, [1] Mon
int16_t  s_cur_AudioFileNr = 0; // this is the position of the file within the (alpha ordered) folder starting with 0
uint8_t  s_brightness = UINT8_MAX;
uint8_t  s_bh1750Value = UINT8_MAX;
uint16_t s_staListNr = 0;
uint16_t s_fileListNr = 0;
uint16_t s_cur_station = 0; // current station(nr), will be set later
uint16_t s_sleeptime = 0;   // time in min until MiniWebRadio goes to sleep
uint16_t s_plsCurPos = 0;
uint16_t s_dlnaItemNr = 0;
uint16_t s_h_resolution = 320;
uint16_t s_v_resolution = 240;
uint32_t s_icyBitRate = 0;     // from http response header via event
uint32_t s_decoderBitRate = 0; // from decoder via getBitRate(false)
uint32_t s_playlistTime = 0;   // playlist start time millis() for timeout
uint32_t s_settingsHash = 0;
uint32_t s_audioFileSize = 0;
uint32_t s_media_downloadPort = 0;
uint32_t s_audioCurrentTime = 0;
uint32_t s_timestamp = 0;
uint32_t s_audioFileDuration = 0;
uint64_t s_totalRuntime = 0; // total runtime in seconds since start

// One-shot "stable playback" memory snapshots for the LVGL-96KB-to-PSRAM A/B
// test (see src/lv_conf.h): 0 = no snapshot pending, else the s_totalRuntime
// value at which to fire one (checked in loopLvglRuntime()'s s_f_1sec
// block). Set a few seconds out from playback actually starting so the
// snapshot reflects steady-state, not the transient connect/decode-startup
// allocations.
uint64_t s_memLogRadioAtSec = 0;
uint64_t s_memLogLocalAtSec = 0;

std::deque<ps_ptr<char>> s_PLS_content;
std::deque<ps_ptr<char>> s_logBuffer;

const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "OPUS", "VORBIS", "OGG"};

#ifdef TFT_MODE_SPI // ⏹⏹⏹⏹
TFT_SPI  tft(spiBus, TFT_CS);
TFT_SPI& getTFT() {
    return tft;
}
#elif defined TFT_MODE_RGB
TFT_RGB  tft;
TFT_RGB& getTFT() {
    return tft;
}
#elif defined TFT_MODE_DSI
TFT_DSI  tft;
TFT_DSI& getTFT() {
    return tft;
}
#else
    #error "wrong TFT_CONTROLLER"
#endif

#ifdef TP_MODE_XPT2046 // ⏹⏹⏹⏹
TP_XPT2046  tp(spiBus, TP_CS);
TP_XPT2046& getTP() {
    return tp;
}
#elif defined TP_MODE_GT911
TP_GT911  tp;
TP_GT911& getTP() {
    return tp;
}
#elif defined TP_MODE_FT6X63
FT6x36  tp;
FT6x36& getTP() {
    return tp;
}
#elif defined TP_MODE_CST816
CST816  tp;
CST816& getTP() {
    return tp;
}
#else
    #error "wrong TP_CONTROLLER"
#endif

stationManagement staMgnt(&s_cur_station);

SemaphoreHandle_t mutex_rtc;
SemaphoreHandle_t mutex_display;
static SemaphoreHandle_t s_prefMutex = nullptr;
static SemaphoreHandle_t s_wifiOpMutex = nullptr;

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

bool SD_MMC_exists(const char* path) {
    return SD_MMC.exists(path);
}

// clang-format off
/*🟢🟡🔴*/
boolean defaultsettings() {

    if (!SD_MMC.exists("/ir_buttons.json")) { // if not found ir_buttons.json create a default file
        File file = SD_MMC.open("/ir_buttons.json", "w", true);
        file.write((uint8_t*)ir_buttons_json, sizeof(ir_buttons_json));
        file.close();
    }
    irb.loadButtonsFromJSON("/ir_buttons.json");
    for (uint i = 0; i < s_settings.numOfIrButtons; i++) {
        MWR_LOG_DEBUG("0x{:04X},  {}", s_settings.irbuttons[i].val, s_settings.irbuttons[i].label);
        ir.set_irButtons(i, s_settings.irbuttons[i].val);
    }
    ir.set_irAddress(s_settings.irbuttons[42].val);
    MWR_LOG_DEBUG("0x{:04X},  {}", s_settings.irbuttons[42].val, s_settings.irbuttons[42].label);

    if (!SD_MMC.exists("/settings.json")) { // if not found create one
        updateSettings();
    }

    File         file2 = SD_MMC.open("/settings.json", "r", false);
    ps_ptr<char> jO;
    jO.calloc(2048);
    ps_ptr<char> tmp;
    tmp.calloc(1024);
    file2.readBytes(jO.get(), 2048);
    s_settingsHash = simpleHash(jO.get());
    file2.close();

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = jO.index_of(s, 0);
        if (pos1 < 0) {
            MWR_LOG_ERROR("index {} not found", s);
            return "0";
        }
        pos2 = jO.index_of(":", pos1) + 1;
        if (jO[pos2] == '\"')
            pos3 = jO.index_of("\"", pos2 + 1) + 1;
        else
            pos3 = jO.index_of(",", pos2);
        if (pos3 < 0) pos3 = find_first_of(jO.get(), "}\n", pos2);
        if (jO[pos2] == '\"') {
            pos2++;
            pos3--;
        } // remove \" embraced strings
        tmp = jO.substr(pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp.c_get();
    };

    auto computeMinuteOfTheDay = [&](const char* s) {
        if (!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    s_settings.lastconnectedhost.reset();
    s_settings.lastconnectedfile.reset();
    s_settings.lastconnectedfilepos = 0;

