pullead/esp32-hifi/src/main.cpp
    s_volume.cur_volume = atoi(parseJson("\"volume\":"));
    s_volume.volumeSteps = atoi(parseJson("\"volumeSteps\":"));
    s_volume.ringVolume = atoi(parseJson("\"ringVolume\":"));
    s_volume.volumeAfterAlarm = atoi(parseJson("\"volumeAfterAlarm\":"));
    s_bt_emitter.volume = atoi(parseJson("\"BTvolume\":"));
    s_bt_emitter.enabled  = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    s_bt_emitter.mode = ((strcmp(parseJson("\"BTmode\":"), "TX") == 0) ? "TX" : "RX");
    s_alarmtime[0] = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    s_alarmtime[1] = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    s_alarmtime[2] = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    s_alarmtime[3] = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    s_alarmtime[4] = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    s_alarmtime[5] = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    s_alarmtime[6] = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    s_alarmdays = atoi(parseJson("\"alarm_weekdays\":"));
    s_f_timeAnnouncement = (strcmp(parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    s_timeSpeechLang = parseJson("\"timeSpeechLang\":");
    s_f_mute = (strcmp(parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    s_brightness = max(5, atoi(parseJson("\"brightness\":")));
    s_sleeptime = atoi(parseJson("\"sleeptime\":"));
    s_cur_station = atoi(parseJson("\"station\":"));
    s_tone.LP = atoi(parseJson("\"toneLP\":"));
    s_tone.BP = atoi(parseJson("\"toneBP\":"));
    s_tone.HP = atoi(parseJson("\"toneHP\":"));
    s_tone.BAL = atoi(parseJson("\"balance\":"));
    {
        const int outputSampleRate = atoi(parseJson("\"outputSampleRate\":"));
        if (outputSampleRate == 44100) s_audioOutputPolicy = AudioOutputPolicy::Fixed44100;
        else if (outputSampleRate == 48000) s_audioOutputPolicy = AudioOutputPolicy::Fixed48000;
        else s_audioOutputPolicy = AudioOutputPolicy::Source;
    }
    s_TZName = parseJson("\"Timezone_Name\":");
    s_TZString = parseJson("\"Timezone_String\":");
    s_settings.lastconnectedhost.copy_from(parseJson("\"lastconnectedhost\":"));
    s_settings.lastconnectedfile.copy_from(parseJson("\"lastconnectedfile\":"));
    s_settings.lastconnectedfilepos = atoi(parseJson("\"lastconnectedfilepos\":"));
    s_sleepMode = atoi(parseJson("\"sleepMode\":"));
    s_state = atoi(parseJson("\"state\":"));

    // set some items ---------------------------------------------------------------------------------------------
    if (!s_settings.lastconnectedfile.starts_with("/")) { s_settings.lastconnectedfile.assign("/audiofiles/"); } // guard
    s_SD_content.setLastConnectedFile(s_settings.lastconnectedfile.get());
    s_cur_AudioFolder = s_SD_content.getLastConnectedFolder();
    s_cur_AudioFileName = s_SD_content.getLastConnectedFileName();
    s_cur_AudioFileNr = s_SD_content.getPosByFileName(s_cur_AudioFileName.c_get());
    if (s_cur_AudioFileNr == -1) s_cur_AudioFileNr = 0; // not found
    // ------------------------------------------------------------------------------------------------------------

    if (!SD_MMC.exists("/stations.json")) { // if not found create one
        File file1 = SD_MMC.open("/stations.json", "w", true);
        file1.write((uint8_t*)stations_json, sizeof(stations_json) - 1); // without termination
        file1.close();
    }
    staMgnt.updateStationsList();
    if (staMgnt.getSumStations() && strstr(staMgnt.getStationUrl(1), "0n-70s.radionetz.de")) {
        File file1 = SD_MMC.open("/stations.json", "w", true);
        file1.write((uint8_t*)stations_json, sizeof(stations_json) - 1);
        file1.close();
        staMgnt.updateStationsList();
        printfln(s_tag.sd_card, "legacy default stations.json replaced with LVGL radio starter list");
    }
    return true;
}
// clang-format on
/*🟢🟡🔴*/

void updateSettings() {
    if (!s_settings.lastconnectedhost.valid()) s_settings.lastconnectedhost.assign("");
    if (!s_settings.lastconnectedfile.valid()) s_settings.lastconnectedfile.assign("/audiofiles/");
    ps_ptr<char> jO;
    ; // JSON Object
    jO.assign("{\n");
    jO.appendf("  \"volume\":{}", s_volume.cur_volume);
    jO.appendf(",\n  \"volumeSteps\":{}", s_volume.volumeSteps);
    jO.appendf(",\n  \"ringVolume\":{}", s_volume.ringVolume);
    jO.appendf(",\n  \"volumeAfterAlarm\":{}", s_volume.volumeAfterAlarm);
    jO.appendf(",\n  \"BTvolume\":{}", s_bt_emitter.volume);
    jO.appendf(",\n  \"BTpower\":\"{}\"", s_bt_emitter.enabled);
    jO.appendf(",\n  \"BTmode\":\"{}\"", bt_emitter.getMode().c_get());
    jO.appendf(",\n  \"alarmtime_sun\":\"{:02}:{:02}\"", s_alarmtime[0] / 60, s_alarmtime[0] % 60);
    jO.appendf(",\n  \"alarmtime_mon\":\"{:02}:{:02}\"", s_alarmtime[1] / 60, s_alarmtime[1] % 60);
    jO.appendf(",\n  \"alarmtime_tue\":\"{:02}:{:02}\"", s_alarmtime[2] / 60, s_alarmtime[2] % 60);
    jO.appendf(",\n  \"alarmtime_wed\":\"{:02}:{:02}\"", s_alarmtime[3] / 60, s_alarmtime[3] % 60);
    jO.appendf(",\n  \"alarmtime_thu\":\"{:02}:{:02}\"", s_alarmtime[4] / 60, s_alarmtime[4] % 60);
    jO.appendf(",\n  \"alarmtime_fri\":\"{:02}:{:02}\"", s_alarmtime[5] / 60, s_alarmtime[5] % 60);
    jO.appendf(",\n  \"alarmtime_sat\":\"{:02}:{:02}\"", s_alarmtime[6] / 60, s_alarmtime[6] % 60);
    jO.appendf(",\n  \"alarm_weekdays\":{}", s_alarmdays);
    jO.appendf(",\n  \"timeAnnouncing\":\"{}\"", s_f_timeAnnouncement);
    jO.appendf(",\n  \"timeSpeechLang\":\"{}\"", s_timeSpeechLang.c_get());
    jO.appendf(",\n  \"mute\":\"{}\"", s_f_mute);
    jO.appendf(",\n  \"brightness\":{}", s_brightness);
    jO.appendf(",\n  \"sleeptime\":{}", s_sleeptime);
    jO.appendf(",\n  \"lastconnectedhost\":\"{}\"", s_settings.lastconnectedhost.c_get());
    jO.appendf(",\n  \"lastconnectedfile\":\"{}\"", s_settings.lastconnectedfile.c_get());
    jO.appendf(",\n  \"lastconnectedfilepos\":{}", s_settings.lastconnectedfilepos);
    jO.appendf(",\n  \"station\":{}", s_cur_station);
    jO.appendf(",\n  \"Timezone_Name\":\"{}\"", s_TZName.c_get());
    jO.appendf(",\n  \"Timezone_String\":\"{}\"", s_TZString.c_get());
    jO.appendf(",\n  \"toneLP\":{}", s_tone.LP);
    jO.appendf(",\n  \"toneBP\":{}", s_tone.BP);
    jO.appendf(",\n  \"toneHP\":{}", s_tone.HP);
    jO.appendf(",\n  \"balance\":{}", s_tone.BAL);
    const uint32_t outputSampleRate = s_audioOutputPolicy == AudioOutputPolicy::Fixed44100 ? 44100 :
                                      s_audioOutputPolicy == AudioOutputPolicy::Fixed48000 ? 48000 : 0;
    jO.appendf(",\n  \"outputSampleRate\":{}", outputSampleRate);
    jO.appendf(",\n  \"state\":{}", s_state);
    jO.appendf(",\n  \"sleepMode\":{}\n}", s_sleepMode);

    if (s_settingsHash != simpleHash(jO.get())) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if (!file) {
            MWR_LOG_ERROR("file \"settings.json\" not found");
            return;
        }
        file.print(jO.get());
        s_settingsHash = simpleHash(jO.c_get());

        MWR_LOG_DEBUG("{}", jO.c_get());
    }
}
/*****************************************************************************************************************************************************
 *                                                      U R L d e c o d e                                                                            *
 *****************************************************************************************************************************************************/
// In m3u playlists, file names can be URL encoded.
// Since UTF-8 is always shorter than URI, the same memory is used for decoding
// e.g. Born%20On%20The%20B.mp3 --> Born On The B.mp3
// e.g. %D0%B8%D1%81%D0%BF%D1%8B%D1%82%D0%B0%D0%BD%D0%B8%D0%B5.mp3 --> испытание.mp3
void urldecode(char* str) {
    uint16_t p1 = 0, p2 = 0;
    char     a, b;
    while (str[p1]) {
        if ((str[p1] == '%') && ((a = str[p1 + 1]) && (b = str[p1 + 2])) && (isxdigit(a) && isxdigit(b))) {
            if (a >= 'a') a -= 'a' - 'A';
            if (a >= 'A')
                a -= ('A' - 10);
            else
                a -= '0';
            if (b >= 'a') b -= 'a' - 'A';
            if (b >= 'A')
                b -= ('A' - 10);
            else
                b -= '0';
            str[p2++] = 16 * a + b;
            p1 += 3;
        } else if (str[p1] == '+') {
            str[p2++] = ' ';
            p1++;
        } else {
            str[p2++] = str[p1++];
        }
    }
    str[p2++] = '\0';
}

