pullead/esp32-hifi/src/main.cpp
/*****************************************************************************************************************************************************
 *                                                               T I M E R                                                                           *
 *****************************************************************************************************************************************************/

void timer100ms() {
    static uint16_t ms100 = 0;
    s_f_100ms = true;
    ms100++;
    if (!(ms100 % 10)) {
        s_f_1sec = true;
        s_time_s = rtc.gettime_s();
        if (s_time_s.ends_with("59:53")) s_f_timeSpeech = true;
    }
    if (!(ms100 % 100)) s_f_10sec = true;
    if (!(ms100 % 600)) {
        s_f_1min = true;
        ms100 = 0;
    }
}

/*****************************************************************************************************************************************************
 *                                                               D I S P L A Y                                                                       *
 *****************************************************************************************************************************************************/

inline void clearLogo() {
    getTFT().copyFramebuffer(FB_BACKGROUND, FB_VISIBLE, layout.winLogo.x, layout.winLogo.y, layout.winLogo.w, layout.winLogo.h);
}
inline void clearStationName() {
    getTFT().copyFramebuffer(FB_BACKGROUND, FB_VISIBLE, layout.winName.x, layout.winName.y, layout.winName.w, layout.winName.h);
}
inline void clearStreamTitle() { // without VUmeter
    getTFT().copyFramebuffer(FB_BACKGROUND, FB_VISIBLE, layout.winSTitle.x, layout.winSTitle.y, layout.winSTitle.w, layout.winSTitle.h);
}
inline void clearWithOutHeaderFooter(int32_t bgColor) {
    if (bgColor == TFT_TRANSPARENT) {
        getTFT().copyFramebuffer(FB_BACKGROUND, FB_VISIBLE, layout.winWoHF.x, layout.winWoHF.y, layout.winWoHF.w, layout.winWoHF.h);
    } else {
        getTFT().fillRect(layout.winWoHF.x, layout.winWoHF.y, layout.winWoHF.w, layout.winWoHF.h, TFT_BLACK);
    }
}
inline void clearAll(int32_t bgColor) {
    if (bgColor == TFT_TRANSPARENT) {
        getTFT().copyFramebuffer(FB_BACKGROUND, FB_VISIBLE, 0, 0, displayConfig.dispWidth, displayConfig.dispHeight); // copy wallpaper
    } else {
        getTFT().fillRect(0, 0, displayConfig.dispWidth, displayConfig.dispHeight, TFT_BLACK);
    }
}

void showStationName() {
    if (s_f_sleeping) return;
    txt_RA_staName.setTextColor(TFT_CYAN);
    txt_RA_staName.setText(getStationName());
    txt_RA_staName.show();
}

void showStreamTitle(ps_ptr<char> streamtitle) {
    if (s_f_sleeping) return;

    streamtitle.trim();
    // replacestr(st, " | ", "\n"); // some stations use pipe as \n or
    // replacestr(st, "| ", "\n");
    // replacestr(st, "|", "\n");

    txt_RA_sTitle.setTextColor(TFT_CORNSILK);
    txt_RA_sTitle.setText(streamtitle.c_get());
    txt_RA_sTitle.show();
}

void showLogoAndStationName() {
    showStationName();
    pic_RA_logo.setPicturePath(getLogoPath());
    pic_RA_logo.show();
    dispFooter.updateStation(s_cur_station);
    dispFooter.updateFlag(getFlagPath(s_cur_station));
    webSrv_send_station_items();
    return;
}

ps_ptr<char> getStationName() {
    ps_ptr<char> SN_utf8;
    ps_ptr<char> path;
    if (s_cur_station) {
        SN_utf8 = staMgnt.getStationName(s_cur_station);
    } else {
        SN_utf8 = s_stationName_air;
    }
    SN_utf8.trim();
    return SN_utf8;
}

ps_ptr<char> getLogoPath() {
    ps_ptr<char> path;
    ps_ptr<char> staName = getStationName();
    path = "/logo/" + staName + ".jpg";
    if (!SD_MMC.exists(scaleImage(path).c_get())) path = "/common/unknown.png";
    return path;
}

const char* getFlagPath(uint16_t station) {
    if (station == 0) return "/flags/unknown.jpg";
    static char flagPath[40];
    flagPath[0] = '\0';
    strcpy(flagPath, "/flags/");
    strcat(flagPath, staMgnt.getStationCountry(station));
    for (int i = 0; i < strlen(flagPath); i++) flagPath[i] = tolower(flagPath[i]);
    strcat(flagPath, ".jpg");
    return flagPath;
}

void webSrv_send_station_items() {
    ps_ptr<char> staNr;
    staNr.assignf("{}", s_cur_station);
    webSrv.send("stationLogo=", getLogoPath());
    webSrv.send("stationNr=", staNr);
    webSrv.send("stationURL=", s_settings.lastconnectedhost.get());
}

void showFileLogo(int8_t state, int8_t subState) {
    String logo;
    if (state == DLNA) {
        logo = "/common/DLNA.jpg";
        pic_DL_logo.setPicturePath(logo.c_str());
        pic_DL_logo.setAlternativPicturePath("/common/unknown.png");
        pic_DL_logo.show();
        webSrv.send("stationLogo=", logo.c_str());
        return;
    }
    if (state == PLAYER) { // s_state PLAYER
        if (s_cur_Codec == 0)
            logo = "/common/AudioPlayer.png";
        else if (s_subState_player == 0)
            logo = "/common/AudioPlayer.png";
        else
            logo = "/common/" + (String)codecname[s_cur_Codec] + ".png";
        pic_PL_logo.setPicturePath(logo.c_str());
        pic_PL_logo.setAlternativPicturePath("/common/unknown.png");
        pic_PL_logo.show();
        return;
    }
    if (state == SETTINGS) {
        logo = "/common/Settings.png";
        pic_SE_logo.setPicturePath(logo.c_str());
        pic_SE_logo.setAlternativPicturePath("/common/unknown.png");
        pic_SE_logo.show();
        return;
    }
    if (state == RINGING) {
        logo = "/common/Alarm.png";
        pic_RI_logo.setPicturePath(logo.c_str());
        pic_RI_logo.setAlternativPicturePath("/common/unknown.png");
        pic_RI_logo.show();
        return;
    }
}

void showPlayerFileName(const char* fname) {
    if (!fname) return;
    txt_PL_fName.setTextColor(TFT_CYAN);
    txt_PL_fName.setText(fname);
    txt_PL_fName.show();
}

void show_DLNA_FileName(const char* fname) {
    if (!fname) return;
    txt_DL_fName.setTextColor(TFT_CYAN);
    txt_DL_fName.setText(fname);
    txt_DL_fName.show();
}

void showPlsFileNumber() {
    char buf[15];
    sprintf(buf, "%03u/%03u", s_plsCurPos, s_PLS_content.size());
    dispFooter.updateFileNr(buf);
}

void showAudioFileNumber() {
    char buf[15];
    sprintf(buf, "%03u/%03u", s_cur_AudioFileNr + 1, s_SD_content.getSize());
    dispFooter.updateFileNr(buf);
}

