pullead/esp32-hifi/src/main.cpp
void display_sleeptime(int8_t ud) { // set sleeptimer
    if (ud == 1) {                  // up
        switch (s_sleeptime) {
            case 0 ... 14: s_sleeptime = (s_sleeptime / 5) * 5 + 5; break;
            case 15 ... 59: s_sleeptime = (s_sleeptime / 15) * 15 + 15; break;
            case 60 ... 359: s_sleeptime = (s_sleeptime / 60) * 60 + 60; break;
            default: s_sleeptime = 360; break; // max 6 hours
        }
    }
    if (ud == -1) { // down
        switch (s_sleeptime) {
            case 1 ... 15: s_sleeptime = ((s_sleeptime - 1) / 5) * 5; break;
            case 16 ... 60: s_sleeptime = ((s_sleeptime - 1) / 15) * 15; break;
            case 61 ... 360: s_sleeptime = ((s_sleeptime - 1) / 60) * 60; break;
            default: s_sleeptime = 0; break; // min
        }
    }
    otb_SL_stime.show(s_sleeptime);
}

boolean drawImage(ps_ptr<char> path, uint16_t posX, uint16_t posY, uint16_t maxWidth, uint16_t maxHeigth) {
    auto scImg = scaleImage(path);
    if (!SD_MMC.exists(scImg.c_get())) {
        if (scImg.index_of("/.", 0) > 0) return false; // empty filename
        printfln(s_tag.sd_card, ANSI_ESC_RED "file \"{}\" not found", scImg.c_get());
        return false;
    }
    if (scImg.ends_with("bmp")) { return getTFT().drawBmpFile(SD_MMC, scImg.c_get(), posX, posY, maxWidth, maxHeigth, 1.0); }
    if (scImg.ends_with("jpg")) { return getTFT().drawJpgFile(SD_MMC, scImg.c_get(), posX, posY, maxWidth, maxHeigth); }
    if (scImg.ends_with("gif")) { return getTFT().drawGifFile(SD_MMC, scImg.c_get(), posX, posY, 0); }
    if (scImg.ends_with("png")) { return getTFT().drawPngFile(SD_MMC, scImg.c_get(), posX, posY); }

    printfln(s_tag.action, ANSI_ESC_RED "the file \"{}\" contains neither a bmp, a gif, a png nor a jpg graphic", scImg);
    return false; // neither jpg nor bmp
}
/*****************************************************************************************************************************************************
 *                                                   H A N D L E  A U D I O F I L E                                                                  *
 *****************************************************************************************************************************************************/

boolean isAudio(File file) {
    if (endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") || endsWith(file.name(), ".flac") || endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")) { return true; }
    return false;
}

boolean isAudio(const char* path) {
    if (endsWith(path, ".mp3") || endsWith(path, ".aac") || endsWith(path, ".m4a") || endsWith(path, ".wav") || endsWith(path, ".flac") || endsWith(path, ".opus") || endsWith(path, ".ogg")) { return true; }
    return false;
}

boolean isPlaylist(File file) {
    if (endsWith(file.name(), ".m3u")) { return true; }
    return false;
}

/*****************************************************************************************************************************************************
 *                                                                     P L A Y L I S T                                                               *
 *****************************************************************************************************************************************************/

void processPlaylist() {
    bool f_isURL, f_isFile;
start:
    f_isURL = false;
    f_isFile = false;
    if (playlist.get_size() == 0) { // guard
        MWR_LOG_ERROR("playlist is empty");
        s_f_playlistEnabled = false;
        return;
    }

    int idx = playlist.next_index();
    if (idx == -1) {
        printfln(s_tag.playlist, ANSI_ESC_YELLOW "end of playlist");
        webSrv.send("SD_playFile=", "end of playlist");
        s_f_playlistEnabled = false;
        changeState(PLAYER, 0);
        return;
    }

    if (idx == 0) { // first
        changeState(PLAYER, 1);
        txt_PL_fName.setText("");
        txt_PL_fName.show();
    }

    printfln(s_tag.playlist, ANSI_ESC_YELLOW "next playlist file");
    s_f_playlistEnabled = true;

    ps_ptr<char> path = playlist.get_file(); // path or url

    if (path.starts_with_icase("http;//") or path.starts_with_icase("https://")) {
        f_isURL = true; // is web file
    }

    if (path.starts_with("/") && SD_MMC.exists(path.c_get())) { f_isFile = true; }

    if (f_isFile == false && f_isURL == false) goto start;

    if (f_isURL) { connecttohost(path); }                  // is web file
    if (f_isFile) { connecttoFS("SD_MMC", path.c_get()); } // is file

    if (s_f_isFSConnected || s_f_isWebConnected) {
        printfln(s_tag.playlist, ANSI_ESC_YELLOW, path.c_get());
        webSrv.send("SD_playFile=", path);
        if (s_state == PLAYER) dispFooter.updateFileNr(playlist.get_coloured_index().c_get());
        txt_PL_fName.setText(playlist.get_items().c_get());
        txt_PL_fName.show();
    } else {
        printfln(s_tag.playlist, ANSI_ESC_YELLOW "can't connect to {}", path.c_get());
        goto start;
    }

    MWR_LOG_WARN("path {}, items {}", playlist.get_file().c_get(), playlist.get_items().c_get());

    return;
}

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  C O N N E C T   TO   W I F I   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// Slot 0 is the compile-time default (_SSID/_PW), rewritten every boot and
// never user-editable (see setWiFiCredentials()'s state==0 case). Slots
// 1-7 are the up-to-7 user-added networks from the Settings > WiFi screen
// (8 total saved networks, per "最多保存8个"). wifiPrefKey() replaces what
// used to be four near-identical 6-case switch statements across this file
// -- extending those by hand for the 6->8 slot change would have meant
// copy-pasting 2 more cases into each of the 4 call sites.
constexpr uint8_t kWifiSlotCount = 8;
const char* wifiPrefKey(uint8_t i) {
    static const char* const keys[kWifiSlotCount] = {"wifiStr0", "wifiStr1", "wifiStr2", "wifiStr3", "wifiStr4", "wifiStr5", "wifiStr6", "wifiStr7"};
    return keys[i < kWifiSlotCount ? i : kWifiSlotCount - 1];
}

static bool lockPreferences(TickType_t timeout = pdMS_TO_TICKS(250)) {
    return !s_prefMutex || xSemaphoreTake(s_prefMutex, timeout) == pdTRUE;
}

