pullead/esp32-hifi/src/main.cpp
static void unlockPreferences() {
    if (s_prefMutex) xSemaphoreGive(s_prefMutex);
}

// USB storage mode is entered by writing a temporary NVS flag and
// rebooting. Runtime USB.begin() is unsafe on this board (ESP_RST_USB --
// see DEV_LOG 2026-07-31), so TinyUSB is only ever started at boot:
// never in normal mode, and with media exposed immediately in storage
// mode. The flag is cleared (and the board rebooted) on host eject or on
// the unmount button, so normal boots never initialize TinyUSB and the
// USB-Serial/JTAG console stays alive.
static constexpr const char* kUsbMscModePrefKey = "usb_msc_mode";

static bool usbMscModeFlag() {
    bool value = false;
    if (lockPreferences()) {
        value = pref.getBool(kUsbMscModePrefKey, false);
        unlockPreferences();
    }
    return value;
}

static void usbMscSetModeFlag(bool on) {
    if (lockPreferences(pdMS_TO_TICKS(1000))) {
        pref.putBool(kUsbMscModePrefKey, on);
        unlockPreferences();
    }
}

// USB 声卡模式标志。和 MSC 那个是同一套机制、同样的理由：这块板运行时调
// USB.begin() 会触发 ESP_RST_USB 复位（见本文件上面那段注释），TinyUSB 只能
// 在开机时启动，所以切换模式必须写标志 + 重启，绕不过去。
//
// 两个标志互斥由 usbDacSetModeFlag()/usbMscSetModeFlag() 的调用方保证：
// UI 上是三选一的单选，选中任意一个就会把另一个清掉。
static constexpr const char* kUsbDacModePrefKey = "usb_dac_mode";

static bool usbDacModeFlag() {
    bool value = false;
    if (lockPreferences()) {
        value = pref.getBool(kUsbDacModePrefKey, false);
        unlockPreferences();
    }
    return value;
}

static void usbDacSetModeFlag(bool on) {
    if (lockPreferences(pdMS_TO_TICKS(1000))) {
        pref.putBool(kUsbDacModePrefKey, on);
        if (on) pref.putBool(kUsbMscModePrefKey, false); // 互斥
        unlockPreferences();
    }
}

static ps_ptr<char> wifiPrefGet(uint8_t i) {
    ps_ptr<char> line;
    if (!lockPreferences()) {
        MWR_LOG_WARN("Preferences busy while reading {}", wifiPrefKey(i));
        line = "";
        return line;
    }
    line = pref.getString(wifiPrefKey(i)).c_str();
    unlockPreferences();
    return line;
}

static bool lockWifiOps(TickType_t timeout = pdMS_TO_TICKS(100)) {
    return !s_wifiOpMutex || xSemaphoreTake(s_wifiOpMutex, timeout) == pdTRUE;
}

static void unlockWifiOps() {
    if (s_wifiOpMutex) xSemaphoreGive(s_wifiOpMutex);
}

// _SSID/_PW get seeded into slot 0 by connectToWiFi() whenever it's empty.
// Only the literal, unconfigured PlatformIO defaults ("SSID"/"PASSWORD") are
// placeholders. If platformio_override.ini supplies real build-time
// credentials, slot 0 is a real saved network and must be shown in the WiFi
// list; otherwise the device can connect successfully while Settings > WiFi
// still appears empty.
bool playerCoreWifiIsPlaceholder(const char* line) {
    if (!line) return false;
    if (strcmp(_SSID, "SSID") != 0 || strcmp(_PW, "PASSWORD") != 0) return false;
    ps_ptr<char> placeholder(64);
    placeholder = _SSID;
    placeholder += "\t";
    placeholder += _PW;
    return strcmp(line, placeholder.c_get()) == 0;
}

bool playerCoreWifiLineIsSavedNetwork(const char* line) {
    if (!line || line[0] == '\0') return false;
    if (playerCoreWifiIsPlaceholder(line)) return false;
    const char* tab = strchr(line, '\t');
    return tab && tab != line;
}

bool connectToWiFi() {

    MWR_LOG_DEBUG("Connecting to WiFi...");
    ps_ptr<char> line(512);

    // create nvs entries if they do not exist
    if (lockPreferences(pdMS_TO_TICKS(1000))) {
        for (uint8_t i = 0; i < kWifiSlotCount; i++) {
            if (!pref.isKey(wifiPrefKey(i))) pref.putString(wifiPrefKey(i), ""); // SSID + \t + PW
        }

        // Seed slot 0 with the build-flag default credentials, but only the
        // first time (slot 0 still empty) -- this used to run unconditionally,
        // clobbering slot 0 on every boot even after the user saved a real
        // network there via the Settings UI.
        line = pref.getString(wifiPrefKey(0)).c_str();
        if (line.strlen() == 0) {
            const char* SSID = _SSID;
            const char* PW = _PW;
            line = SSID;
            line += "\t";
            line += PW;
            pref.putString(wifiPrefKey(0), line.c_get());
        }
        unlockPreferences();
    } else {
        MWR_LOG_WARN("Preferences busy while initializing WiFi slots");
    }
    printfln(s_tag.wifi_info, "free heap right before WiFi.mode(): " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET ", largest internal block: " ANSI_ESC_CYAN "{}",
             ESP.getFreeHeap(), (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL));
    WiFi.mode(WIFI_STA);
    // ESP-IDF defaults to the "01" world-safe regulatory domain, which only
    // scans/associates on channels 1-11 -- routers on channel 12/13 (common
    // outside the US, including China) are invisible to WiFi.scanNetworks()
    // even though a phone (using the phone OS's own region) connects to them
    // fine. CN permits 1-13 and matches this project's actual deployment.
    esp_wifi_set_country_code("CN", true);

    for (int i = 0; i < kWifiSlotCount; i++) {
        line.clear();
        line = wifiPrefGet(i).c_get();
        if (!playerCoreWifiLineIsSavedNetwork(line.c_get())) continue;
        int pos = line.index_of("\t", 0); // find first tab
        line[pos] = '\0';                 // terminate ssid
        char* ssid = line.get();          // ssid is the first part
        char* pw = line.get() + pos + 1;  // password is the second part
        MWR_LOG_DEBUG("ssid {}", ssid);
        MWR_LOG_DEBUG("pw {}", pw);
        wifiMulti.addAP(ssid, pw); // SSID and PW in code"
        size_t offset = 0;
        size_t pwlen = strlen(pw);
        size_t dot_len = strlen(emoji.blueCircle); // = 4
        size_t buf_size = pwlen * dot_len + 1;     // +1 für '\0'
        if (buf_size > 512) {
            MWR_LOG_ERROR("Password display buffer too large: {} bytes", buf_size);
            continue;
        }
        ps_ptr<char> pass;
        pass.alloc(buf_size);
        char* pass_dst = pass.get();
        if (!pass_dst) {
            MWR_LOG_ERROR("Password display buffer allocation failed");
            continue;
        }
        for (size_t j = 0; j < pwlen; j++) {
            if (offset + dot_len > buf_size - 1) {
                MWR_LOG_ERROR("Buffer overflow in password masking");
                break;
            }
            memcpy(pass_dst + offset, emoji.blueCircle, dot_len);
            offset += dot_len;
        }
        pass_dst[offset] = '\0'; // Zero-terminate the string
        printfln(s_tag.wifi_info, "add credentials: " ANSI_ESC_YELLOW "{} - {}" ANSI_ESC_RESET " [{}:{}]", ssid, pass_dst, __FILENAME__, __LINE__);
    }

    // These options can help when you need ANY kind of wifi connection to get a config file, report errors, etc.
    wifiMulti.setStrictMode(false); // Allow opportunistic connections while maintaining known APs in priority
    printfln(s_tag.wifi_info, ANSI_ESC_GREEN "Connecting WiFi...");

    if (lockWifiOps(pdMS_TO_TICKS(1000))) {
        wifiMulti.run();
        unlockWifiOps();
    } else {
        MWR_LOG_WARN("WiFi operation busy during initial connect");
    }
    int i = 0;
    while (WiFi.status() != WL_CONNECTED) {
        vTaskDelay(1000);
        i++;
        if (i > 10) break; // max 20s
    }
    if (WiFi.status() != WL_CONNECTED) {
        printfln(s_tag.wifi_info, ANSI_ESC_RED "WiFi credentials are not correct");
        return false;
    }
    printfln(s_tag.wifi_info, ANSI_ESC_GREEN "WiFi connected");
    vTaskDelay(1000);
    WiFi.setAutoReconnect(true);
    if (WIFI_TX_POWER >= 2 && WIFI_TX_POWER <= 21) WiFi.setTxPower((wifi_power_t)(WIFI_TX_POWER * 4));
    s_myIP = WiFi.localIP().toString().c_str();

    printfln(s_tag.wifi_info, "connected to " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET ", IP address is " ANSI_ESC_ORANGE "{}" ANSI_ESC_RESET ", Received Signal Strength " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " dB", WiFi.SSID().c_str(), s_myIP.c_get(), WiFi.RSSI());

    return true; // can't connect to any network
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void setWiFiCredentials(ps_ptr<char> ssid, ps_ptr<char> password) {
    // Real SSIDs can be as short as 1 char (e.g. the "s3" seen scanning
    // nearby networks earlier) -- this used to require >=5, which silently
    // dropped any such network with no feedback to the caller (web page or
    // on-device UI alike just saw the request go nowhere).
    if (ssid.strlen() == 0) return;

