pullead/esp32-hifi/src/main.cpp
    MWR_LOG_ERROR("ssid {}", ssid.c_get());

    ps_ptr<char> line = "";
    ps_ptr<char> credentials;
    int          i = 0, state = 0;

    if (!lockPreferences(pdMS_TO_TICKS(1000))) {
        printfln(s_tag.wifi_info, ANSI_ESC_RED "Preferences busy; could not save WiFi credentials for: {}", ssid.c_get());
        return;
    }

    for (i = 0; i < kWifiSlotCount; i++) {
        line = pref.getString(wifiPrefKey(i)).c_str();
        if (line.starts_with(ssid.c_get()) && line[ssid.strlen()] == '\t') { // ssid found
            if (i == 0) {
                MWR_LOG_ERROR("password can't changed, is hard coded");
                state = 0;
                goto exit;
            }
            if (password.strlen() == 0) {
                credentials = ""; // delete ssid and password
            } else {                // update password
                credentials = ssid;
                credentials += "\t";
                credentials += password;
            }
            pref.putString(wifiPrefKey(i), credentials.get());
            state = 1;
            goto exit;
        }
    }
    for (i = 1; i < kWifiSlotCount; i++) {
        line.clear();
        line = pref.getString(wifiPrefKey(i)).c_str();
        if (!playerCoreWifiLineIsSavedNetwork(line.c_get())) { // empty or stale-invalid slot
            credentials = ssid;
            credentials += "\t";
            credentials += password;
            pref.putString(wifiPrefKey(i), credentials.get());
            state = 2;
            goto exit;
        }
    }
    state = 3;

exit:
    unlockPreferences();
    if (state == 0) { printfln(s_tag.wifi_info, ANSI_ESC_RED "SSID: {} password can't changed, it is hard coded", ssid.c_get()); }
    if (state == 1) { printfln(s_tag.wifi_info, ANSI_ESC_GREEN "The passord \"{}\" for the SSID: {} has been changed", password.c_get(), ssid.c_get()); }
    if (state == 2) { printfln(s_tag.wifi_info, ANSI_ESC_GREEN "The SSID: {} has been added", ssid.c_get()); }
    if (state == 3) { printfln(s_tag.wifi_info, ANSI_ESC_RED "No more memory to save the credentials for: {}", ssid.c_get()); }
    return;
}

/*****************************************************************************************************************************************************
 *                                                                     A U D I O                                                                     *
 *****************************************************************************************************************************************************/
void connecttohost(ps_ptr<char> host) {
    // Guards against a real crash, not just a nicety: audio.connecttohost()
    // resolves the hostname via lwIP, which assumes the TCP/IP stack is
    // already up. If WiFi never actually connected (esp_wifi_init() failed,
    // or the background lvglNetworkTask never even started -- see
    // setupLvglRuntime()'s history), that stack was never brought up, and
    // the DNS lookup dereferences a null lwIP mailbox instead of failing
    // cleanly (LoadProhibited panic, reproduced by tapping next-station
    // while offline). Fail the same way a real connection failure would.
    if (!WiFi.isConnected()) {
        printfln(s_tag.wifi_info, ANSI_ESC_RED "Cannot connect to host, WiFi is not connected");
        s_f_isWebConnected = false;
        ++s_cthFailCounter;
        return;
    }
    int32_t      idx1, idx2;
    ps_ptr<char> url;
    ps_ptr<char> user;
    ps_ptr<char> pwd;

    dispFooter.updateBitRate(0);
    s_cur_Codec = 0;
    //    if(s_state == RADIO) clearStreamTitle();
    s_icyBitRate = 0;
    s_decoderBitRate = 0;
    s_f_webFailed = false;
    s_f_pauseResume = false;
    s_f_isFSConnected = false;

    idx1 = host.index_of("|", 0);
    if (idx1 == -1) { // no pipe found
        s_f_isWebConnected = audio.connecttohost(host.c_get());

        if (!s_f_isWebConnected) {
            s_cthFailCounter++;
        } else {
            (s_cthFailCounter = 0);
        }
    } else { // pipe found     e.g. http://xxx.com/ext|user|pw
        idx2 = host.index_of("|", idx1 + 1);
        // MWR_LOG_INFO("idx2 = {}", idx2);
        if (idx2 == -1) { // second pipe not found
            s_f_isWebConnected = audio.connecttohost(host.c_get());

            if (!s_f_isWebConnected) {
                s_cthFailCounter++;
            } else {
                (s_cthFailCounter = 0);
            }
        } else {                     // extract url, user, pwd
            url = host.substr(idx1); // extract url
            user = host.substr(idx1 + 1, idx2 - idx1 - 1);
            pwd = host.substr(idx2 + 1);
            printfln(s_tag.new_host, ANSI_ESC_YELLOW "\"{}\"" ANSI_ESC_RESET ", user: " ANSI_ESC_YELLOW "\"{}\"" ANSI_ESC_RESET ", pwd: " ANSI_ESC_YELLOW "\"{}\"", url.c_get(), user.c_get(), pwd.c_get());
            s_f_isWebConnected = audio.connecttohost(url.c_get(), user.c_get(), pwd.c_get());
        }
    }
    if (s_cthFailCounter >= 3) {
        audio.connecttospeech("The last hosts were not connected", "en");
        s_settings.lastconnectedhost.assign("");
    }
}
// Forward-declared (real definition is further down, alongside the rest of
// the USB-storage statics) so every SD-touching entry point can be guarded
// from one place instead of repeating the same check at each call site.
static bool usbStorageBlocksSdAppAccess();

static bool isUserLocalAudioPath(const char* filename) {
    if (!filename || !isAudio(filename)) return false;
    if (startsWith(filename, "/ring/")) return false;
    if (startsWith(filename, "/voice_time/")) return false;
    return true;
}

static void rememberCurrentLocalPlayback(bool persist) {
    if (!s_f_isFSConnected) return;
    if (s_settings.lastconnectedfile.valid()) {
        s_settings.lastconnectedfilepos = audio.getAudioCurrentTime();
        if (persist) updateSettings();
    }
}

void connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime) {
    if (!filename) return;
    // The SD card is exposed as a raw USB block device while mounted/
    // restoring -- letting this function also open it via the filesystem
    // layer at the same time (e.g. an alarm or time announcement firing
    // mid-transfer) is exactly the kind of concurrent access that can
    // corrupt the FAT filesystem. Every local playback path (SD_playFile,
    // the alarm clock, time announcements, playerCorePlaySdFile) funnels
    // through this one function, so guarding here covers all of them.
    if (usbStorageBlocksSdAppAccess()) return;
    s_cloudMusicPlaying = false; // s_f_isFSConnected takes ternary precedence anyway, but keep this honest for anything reading the raw flag
    dispFooter.updateBitRate(0);
    s_icyBitRate = 0;
    s_decoderBitRate = 0;
    s_cur_Codec = 0;
    s_f_webFailed = false;
    s_f_pauseResume = false;
    s_f_isFSConnected = audio.connecttoFS(SD_MMC, filename, fileStartTime);
    s_f_isWebConnected = false;
    if (s_f_isFSConnected && isUserLocalAudioPath(filename)) {
        s_settings.lastconnectedfile.copy_from(filename);
        s_settings.lastconnectedfilepos = fileStartTime;
        s_SD_content.setLastConnectedFile(filename);
        s_cur_AudioFolder = s_SD_content.getLastConnectedFolder();
        s_cur_AudioFileName = s_SD_content.getLastConnectedFileName();
        s_cur_AudioFileNr = s_SD_content.getPosByFileName(s_cur_AudioFileName.c_get());
        if (s_cur_AudioFileNr == -1) s_cur_AudioFileNr = 0;
        updateSettings();
    }
    MWR_LOG_DEBUG("Filesize {}", audio.getFileSize());
    MWR_LOG_DEBUG("FilePos {}", audio.getAudioFilePosition());
}
void stopSong() {
    audio.stopSong();
    s_f_isFSConnected = false;
    s_f_isWebConnected = false;
    if (s_f_playlistEnabled) {
        s_PLS_content.clear();
        s_f_playlistEnabled = false;
        printfln(s_tag.playlist, ANSI_ESC_YELLOW "playlist stopped");
        webSrv.send("SD_playFile=", "playlist stopped");
    }
    s_f_pauseResume = false;
    s_f_playlistNextFile = false;
    s_playlistPath.reset();
}

