pullead/esp32-hifi/src/main.cpp
// -----------------------------------------------------------------------------
// PlayerService core adapter
// -----------------------------------------------------------------------------
// These functions are the only MiniWebRadio globals the new LVGL application is
// allowed to touch.  Keep them here, beside the existing audio helpers, so the
// decoder task and its connection bookkeeping remain owned by upstream code.
bool playerCorePlayRadioUrl(const char* url) {
    if (!url || !url[0]) return false;
    s_cloudMusicPlaying = false;
    ps_ptr<char> host;
    host.assign(url);
    s_stationURL = host;
    s_stationName_air = host;
    s_cur_station = 0;
    connecttohost(host);
    return s_f_isWebConnected;
}

// Cloud Music phase 4: plays a resolved direct-CDN URL through the exact
// same connecttohost() path as internet radio -- no separate decoder (see
// docs spec's "不得为在线音乐再创建一套独立 I2S、DMA 或音频解码器").
// s_cloudMusicPlaying is what lets playerCoreReadSnapshot() report
// PlayerSource::CloudMusic instead of ::Radio afterwards. Unlike
// playerCorePlayRadioUrl(), s_stationName_air is deliberately left alone --
// the caller (PlayerService::playCloudUrl()) sets title/artist straight
// from the gateway's resolve response, no need to wait for ICY metadata
// text that a plain CDN file URL wouldn't send anyway.
bool playerCorePlayCloudUrl(const char* url) {
    if (!url || !url[0]) return false;
    s_cloudMusicPlaying = true;
    ps_ptr<char> host;
    host.assign(url);
    connecttohost(host);
    return s_f_isWebConnected;
}

static bool playerCorePlayStationNumber(uint16_t stationNumber) {
    if (stationNumber == 0 || stationNumber > staMgnt.getSumStations()) return false;
    const char* url = staMgnt.getStationUrl(stationNumber);
    if (!url || !url[0] || !strcmp(url, "unknown")) return false;
    const char* name = staMgnt.getStationName(stationNumber);
    s_cloudMusicPlaying = false;
    s_cur_station = stationNumber;
    s_stationURL = url;
    s_stationName_air = name && name[0] ? name : url;
    s_homepage = "";
    s_streamTitle = "";
    s_icyDescription = "";
    s_f_newStreamTitle = true;
    s_f_newIcyDescription = true;
    connecttohost(s_stationURL);
    printfln(s_tag.action, "LVGL switch to station " ANSI_ESC_CYAN "{}", stationNumber);
    if (s_f_isWebConnected) {
        s_memLogRadioAtSec = s_totalRuntime + 5; // see loopLvglRuntime()'s s_f_1sec block
        updateSettings();
    }
    return s_f_isWebConnected;
}

uint16_t playerCoreRadioStationCount() { return staMgnt.getSumStations(); }

bool playerCoreRadioStation(uint16_t index, RadioStationItem* item) {
    if (!item || index == 0 || index > staMgnt.getSumStations()) return false;
    item->index = index;
    item->favorite = staMgnt.getStationFav(index) == '*';
    strlcpy(item->country, staMgnt.getStationCountry(index), sizeof(item->country));
    strlcpy(item->name, staMgnt.getStationName(index), sizeof(item->name));
    strlcpy(item->url, staMgnt.getStationUrl(index), sizeof(item->url));
    return true;
}

uint16_t playerCoreCurrentRadioStationNumber() {
    const uint16_t count = staMgnt.getSumStations();
    if (!count) return 0;
    return (s_cur_station >= 1 && s_cur_station <= count) ? s_cur_station : 1;
}

const char* playerCoreLastLocalFilePath() {
    return s_settings.lastconnectedfile.valid() ? s_settings.lastconnectedfile.c_get() : "";
}

uint32_t playerCoreLastLocalFilePosition() { return s_settings.lastconnectedfilepos; }

bool playerCorePlayRadioStation(uint16_t index) { return playerCorePlayStationNumber(index); }

// Declared here (used by playerCorePlaySdFile() below) rather than only at
// its original spot further down near the rest of the USB-storage statics --
// that original position was after this function, which doesn't compile.
static volatile UsbStorageState s_usbStorageState = MWR_USB_MSC_SUPPORTED ? UsbStorageState::Idle : UsbStorageState::Unsupported;

bool playerCorePlaySdFile(const char* path, uint32_t positionSeconds) {
    if (s_usbStorageState != UsbStorageState::Idle) return false;
    if (!path || !path[0]) return false;
    connecttoFS("SD_MMC", path, positionSeconds);
    if (s_f_isFSConnected) s_memLogLocalAtSec = s_totalRuntime + 5; // see loopLvglRuntime()'s s_f_1sec block
    return s_f_isFSConnected;
}

void playerCoreStop() {
    rememberCurrentLocalPlayback(true);
    stopSong();
}

// 找到"暂停再播放后频谱卡住约一分钟"这个 bug 的真正原因了：
// Audio::pauseResume() 的返回值语义是"true=现在是暂停状态，false=现在是
// 播放状态"（库里那条注释自己写的），但下面这行原来是 `if (accepted)
// s_f_pauseResume = !audio.isRunning();`——只有在"刚暂停"（accepted为
// true）时才会更新 s_f_pauseResume，"刚恢复播放"（accepted为false）时这
// 个判断整个跳过，s_f_pauseResume 就一直卡在 true（暂停）不会被改回
// false，即使 audio.isRunning() 已经立刻正确变回了 true。playerCore
// ReadSnapshot() 判断 transport 时 `else if (s_f_pauseResume)
// PlayerTransport::Paused` 排在 `audio.isRunning()` 判断前面，于是即使音
// 频已经在正常解码、频谱数据也在正常更新，UI 这边读到的 transport 一直
// 还是 Paused，频谱动画因为"没有在播放"就不画——这才是"卡住"的真相，不
// 是频谱计算本身卡住，是这个状态标志位没跟着同步。之所以"大概一分钟后自
// 己恢复"，是因为别处某个跟这个 bug 无关的路径最终把 s_f_pauseResume 重
// 置了。改成每次切换后都用 audio.isRunning() 无条件同步，不再依赖这个歧
// 义返回值。
static bool audioPauseResumeAndUpdateState() {
    const bool accepted = audio.pauseResume();
    s_f_pauseResume = !audio.isRunning();
    return accepted;
}

bool playerCoreTogglePause() {
    audioPauseResumeAndUpdateState();
    return s_f_pauseResume;
}

void playerCoreSetVolume(uint8_t volume) {
    s_f_mute = false;
    setVolume(min(volume, s_volume.volumeSteps));
    muteChanged(false);
}

void playerCoreSetMuted(bool muted) {
    s_f_mute = muted;
    muteChanged(muted);
}

AudioToneSettings playerCoreToneSettings() {
    AudioToneSettings settings;
    settings.low = static_cast<int8_t>(std::clamp(static_cast<int>(s_tone.LP), -12, 12));
    settings.mid = static_cast<int8_t>(std::clamp(static_cast<int>(s_tone.BP), -12, 12));
    settings.high = static_cast<int8_t>(std::clamp(static_cast<int>(s_tone.HP), -12, 12));
    settings.balance = static_cast<int8_t>(std::clamp(static_cast<int>(s_tone.BAL), -16, 16));
    return settings;
}

void playerCoreSetToneSettings(const AudioToneSettings& settings, bool persist) {
    s_tone.LP = std::clamp(static_cast<int>(settings.low), -12, 12);
    s_tone.BP = std::clamp(static_cast<int>(settings.mid), -12, 12);
    s_tone.HP = std::clamp(static_cast<int>(settings.high), -12, 12);
    s_tone.BAL = std::clamp(static_cast<int>(settings.balance), -16, 16);
    setI2STone();
    if (persist) updateSettings();
}

void playerCoreSaveSettings() { updateSettings(); }

