pullead/esp32-hifi/src/main.cpp
AudioOutputPolicy playerCoreOutputPolicy() { return s_audioOutputPolicy; }

void playerCoreSetOutputPolicy(AudioOutputPolicy policy, bool persist) {
    s_audioOutputPolicy = policy;
    if (policy == AudioOutputPolicy::Fixed44100) audio.setOutputSampleRate(Audio::SR_44100);
    else if (policy == AudioOutputPolicy::Fixed48000) audio.setOutputSampleRate(Audio::SR_48000);
    else audio.setOutputSampleRate(Audio::SR_ORIGIN);
    if (persist) updateSettings();
}

// Legacy quick-EQ compatibility path; full audio settings keep balance too.
void playerCoreSetTone(int8_t low, int8_t mid, int8_t high) {
    AudioToneSettings settings = playerCoreToneSettings();
    settings.low = low;
    settings.mid = mid;
    settings.high = high;
    playerCoreSetToneSettings(settings, false);
}

void playerCoreNextStation() {
    if (!staMgnt.getSumStations()) return;
    uint16_t next = s_cur_station + 1;
    if (next > staMgnt.getSumStations()) next = 1;
    playerCorePlayStationNumber(next);
}

void playerCorePreviousStation() {
    if (!staMgnt.getSumStations()) return;
    uint16_t prev = s_cur_station > 1 ? s_cur_station - 1 : staMgnt.getSumStations();
    playerCorePlayStationNumber(prev);
}

// Local weather: no GPS on this board, so location comes from IP geolocation
// (ip-api.com, plain HTTP, no key) and the reading itself from Open-Meteo
// (HTTPS, no key). Fetched on a background task -- both are network calls
// that must never block the LVGL/audio loop -- and cached here behind a
// mutex since playerCoreReadSnapshot() (LVGL-tick thread) and weatherTask
// (its own thread) touch it from different cores.
void setRTC(ps_ptr<char> TZString); // defined below; weather fetch also derives+applies the real timezone

struct WeatherState {
    bool valid = false;
    int16_t tempC = 0;
    char desc[8] = "";
    int8_t iconCategory = -1; // 0 clear,1 partly cloudy,2 cloudy,3 fog,4 rain,5 snow,6 thunder
};
static WeatherState s_weather;
static SemaphoreHandle_t s_weatherMutex = nullptr;
static bool s_weatherTzApplied = false; // apply the IP-derived timezone once, not on every 30-min refetch

// Finds "<key>":<number> in a JSON blob and returns the number -- hand-
// counting prefix lengths (`pos + 18`, `pos + 16`, ...) was error-prone and
// silently produced wrong values (e.g. skipped the leading digit) instead of
// a parse failure, so this always measures the needle itself.
static bool jsonNumber(const String& body, const char* key, double* outValue, bool useLast = true) {
    const String needle = String("\"") + key + "\":";
    const int pos = useLast ? body.lastIndexOf(needle) : body.indexOf(needle);
    if (pos < 0) return false;
    *outValue = atof(body.c_str() + pos + needle.length());
    return true;
}

static const char* weatherCodeToLabel(int code) {
    // WMO weather codes, as returned by Open-Meteo's `weather_code` field.
    if (code == 0) return "晴";
    if (code <= 2) return "少云";
    if (code == 3) return "多云";
    if (code == 45 || code == 48) return "雾";
    if (code >= 51 && code <= 57) return "毛雨";
    if (code >= 61 && code <= 67) return "雨";
    if (code >= 71 && code <= 77) return "雪";
    if (code >= 80 && code <= 82) return "阵雨";
    if (code >= 85 && code <= 86) return "阵雪";
    if (code >= 95) return "雷雨";
    return "--";
}

static int8_t weatherCodeToIcon(int code) {
    if (code == 0) return 0;
    if (code <= 3) return code == 1 ? 1 : 2; // 1-2 partly cloudy, 3 overcast
    if (code == 45 || code == 48) return 3;
    if ((code >= 51 && code <= 67) || (code >= 80 && code <= 82)) return 4;
    if ((code >= 71 && code <= 77) || (code >= 85 && code <= 86)) return 5;
    if (code >= 95) return 6;
    return -1;
}

static bool fetchWeatherOnce() {
    if (!WiFi.isConnected()) return false;

    WiFiClient geoClient;
    HTTPClient geoHttp;
    double lat = 0.0, lon = 0.0;
    bool haveLocation = false;
    if (geoHttp.begin(geoClient, "http://ip-api.com/json/?fields=lat,lon,status")) {
        geoHttp.setTimeout(6000);
        if (geoHttp.GET() == HTTP_CODE_OK) {
            const String body = geoHttp.getString();
            haveLocation = jsonNumber(body, "lat", &lat, false) && jsonNumber(body, "lon", &lon, false);
        }
        geoHttp.end();
    }
    if (!haveLocation) return false;

    char url[176];
    snprintf(url, sizeof(url),
             "https://api.open-meteo.com/v1/forecast?latitude=%.4f&longitude=%.4f&current=temperature_2m,weather_code&timezone=auto",
             lat, lon);

    WiFiClientSecure weatherClient;
    weatherClient.setInsecure(); // no cert pinning for a public no-key weather API
    HTTPClient weatherHttp;
    bool ok = false;
    if (weatherHttp.begin(weatherClient, url)) {
        weatherHttp.setTimeout(8000);
        if (weatherHttp.GET() == HTTP_CODE_OK) {
            const String body = weatherHttp.getString();
            // Open-Meteo's response has a "current_units" block ahead of
            // "current" with the SAME key names but string unit values
            // ("°C") -- useLast=true (lastIndexOf) lands on the real
            // "current" block instead of the units block.
            double temp = 0.0, code = 0.0, utcOffsetSeconds = 0.0;
            if (jsonNumber(body, "temperature_2m", &temp)) {
                const bool haveCode = jsonNumber(body, "weather_code", &code);
                const int codeInt = haveCode ? static_cast<int>(code) : -1;
                if (s_weatherMutex && xSemaphoreTake(s_weatherMutex, pdMS_TO_TICKS(200)) == pdTRUE) {
                    s_weather.tempC = static_cast<int16_t>(lroundf(temp));
                    strlcpy(s_weather.desc, weatherCodeToLabel(codeInt), sizeof(s_weather.desc));
                    s_weather.iconCategory = weatherCodeToIcon(codeInt);
                    s_weather.valid = true;
                    xSemaphoreGive(s_weatherMutex);
                }
                ok = true;
            }
            // Same location lookup also fixes the clock: the board has no
            // way to know its own timezone otherwise, and defaulted to a
            // hardcoded Europe/Berlin rule (see s_TZString's initializer).
            // Fixed UTC offset, no DST rule -- good enough for most zones
            // and exactly right for ones (like Japan) that don't use DST.
            if (!s_weatherTzApplied && jsonNumber(body, "utc_offset_seconds", &utcOffsetSeconds, false)) {
                const long offsetHours = lroundf(static_cast<float>(utcOffsetSeconds) / 3600.0f);
                char tz[16];
                snprintf(tz, sizeof(tz), "UTC%+ld", -offsetHours);
                setRTC(tz);
                s_weatherTzApplied = true;
            }
        }
        weatherHttp.end();
    }
    return ok;
}

static void weatherTask(void*) {
    vTaskDelay(pdMS_TO_TICKS(4000)); // let WiFi settle before the first fetch
    for (;;) {
        const bool ok = fetchWeatherOnce();
        printf("[WEATHER] fetch %s temp=%d desc=%s icon=%d\n", ok ? "ok" : "failed", s_weather.tempC, s_weather.desc,
               s_weather.iconCategory);
        vTaskDelay(pdMS_TO_TICKS(30UL * 60UL * 1000UL)); // refresh every 30 min
    }
}

// ---- Local music library ---------------------------------------------
// Recursive SD scan + a minimal, self-contained ID3v2.2/2.3/2.4 reader.
// Deliberately independent of the Audio class's own ID3 parsing, which
// only runs while a file is actually being decoded -- not useful for
// batch-scanning hundreds of files on disk without playing each one.
constexpr uint16_t kMaxLocalTracks = 300;
static constexpr const char* kLocalMusicDir = "/Music";
static LocalTrackItem* s_localTracks = nullptr;
static uint16_t s_localTrackCount = 0;
static volatile bool s_localLibraryScanning = false;
// s_usbStorageState itself is declared earlier now (see playerCorePlaySdFile()'s comment) -- the rest of the USB-storage statics stay here.
static volatile bool s_usbStorageBusy = false;
static volatile bool s_usbStorageHostEjected = false;
static bool s_usbMscModeActive = false;
static bool s_usbDacModeActive = false;
static volatile uint32_t s_usbStorageLastAccessMs = 0;
static volatile uint32_t s_usbMscReadCount = 0;
static volatile uint32_t s_usbMscWriteCount = 0;
static volatile uint32_t s_usbMscReadFailCount = 0;
static volatile uint32_t s_usbMscWriteFailCount = 0;
static volatile uint32_t s_usbMscLastLba = 0;
static volatile uint32_t s_usbMscMinLba = 0;
static volatile uint32_t s_usbMscMaxLba = 0;
static volatile uint32_t s_usbMscLastOffset = 0;
static volatile uint32_t s_usbMscLastSize = 0;
static volatile uint32_t s_usbMscMaxSize = 0;
static volatile int32_t s_usbMscLastResult = 0;
static uint32_t s_usbMscLbaBase = 0;
static uint32_t s_usbMscBlockCount = 0;
static uint32_t s_usbStoragePartitionStartLba = 0;
static UsbStorageFormatInfo s_usbStorageFormatInfo{};

#if MWR_USB_MSC_SUPPORTED
static USBMSC s_usbMsc;
static bool s_usbMscConfigured = false;
static bool s_usbStarted = false;
static uint16_t s_usbMscSectorSize = 0;
static constexpr bool kUsbMscReadOnlyProbe = false;
static constexpr bool kUsbMscExposePartitionOnly = false;
static constexpr bool kUsbMscBootPresentProbe = false;

static int32_t usbMscRead(uint32_t lba, uint32_t offset, void* buffer, uint32_t bufsize);
static int32_t usbMscWrite(uint32_t lba, uint32_t offset, uint8_t* buffer, uint32_t bufsize);
static bool usbMscStartStop(uint8_t powerCondition, bool start, bool loadEject);

static uint32_t usbMscLe32(const uint8_t* p) {
    return static_cast<uint32_t>(p[0]) |
           (static_cast<uint32_t>(p[1]) << 8) |
           (static_cast<uint32_t>(p[2]) << 16) |
           (static_cast<uint32_t>(p[3]) << 24);
}

