pullead/esp32-hifi/src/main.cpp
static uint16_t usbMscLe16(const uint8_t* p) {
    return static_cast<uint16_t>(p[0]) |
           (static_cast<uint16_t>(p[1]) << 8);
}

static bool usbMscMbrFitsDevice(const uint8_t* lba0, uint32_t sectorCount) {
    if (!lba0) return true;
    if (lba0[510] != 0x55 || lba0[511] != 0xAA) {
        printf("[USBMSC] no MBR boot signature, skip partition-bound check\n");
        return true;
    }

    bool sawPartition = false;
    bool fits = true;
    for (uint8_t i = 0; i < 4; ++i) {
        const uint8_t* entry = lba0 + 446 + i * 16;
        const uint8_t type = entry[4];
        const uint32_t start = usbMscLe32(entry + 8);
        const uint32_t count = usbMscLe32(entry + 12);
        if (type == 0 || count == 0) continue;
        sawPartition = true;

        const uint64_t end = static_cast<uint64_t>(start) + static_cast<uint64_t>(count) - 1ULL;
        printf("[USBMSC] mbr part%u type=0x%02X start=%u sectors=%u end=%llu\n",
               static_cast<unsigned>(i + 1), type, static_cast<unsigned>(start), static_cast<unsigned>(count),
               static_cast<unsigned long long>(end));
        if (end >= sectorCount) {
            printf("[USBMSC] ERROR: partition end %llu exceeds exposed sectors %u\n",
                   static_cast<unsigned long long>(end), static_cast<unsigned>(sectorCount));
            fits = false;
        }
    }
    if (!sawPartition) printf("[USBMSC] MBR signature present, no usable partition entries\n");
    return fits;
}

static bool usbMscFindFirstPartition(const uint8_t* lba0, uint32_t sectorCount, uint32_t* outStart, uint32_t* outCount) {
    if (!lba0 || !outStart || !outCount || lba0[510] != 0x55 || lba0[511] != 0xAA) return false;
    for (uint8_t i = 0; i < 4; ++i) {
        const uint8_t* entry = lba0 + 446 + i * 16;
        const uint8_t type = entry[4];
        const uint32_t start = usbMscLe32(entry + 8);
        const uint32_t count = usbMscLe32(entry + 12);
        if (type == 0 || count == 0 || start == 0) continue;
        const uint64_t end = static_cast<uint64_t>(start) + static_cast<uint64_t>(count) - 1ULL;
        if (end >= sectorCount) continue;
        *outStart = start;
        *outCount = count;
        return true;
    }
    return false;
}

static void usbStorageUpdateFormatInfo(uint32_t partitionStartLba, uint64_t totalBytes, uint64_t usedBytes) {
    UsbStorageFormatInfo info{};
    info.totalBytes = totalBytes;
    info.usedBytes = usedBytes <= totalBytes ? usedBytes : 0;
    info.partitionStartLba = partitionStartLba;

    uint8_t boot[512];
    if (SD_MMC.readRAW(boot, partitionStartLba) && boot[510] == 0x55 && boot[511] == 0xAA) {
        const uint16_t bytesPerSector = usbMscLe16(boot + 11);
        const uint8_t sectorsPerCluster = boot[13];
        const uint16_t rootEntryCount = usbMscLe16(boot + 17);
        const uint16_t fat16Sectors = usbMscLe16(boot + 22);
        const uint32_t fat32Sectors = usbMscLe32(boot + 36);
        const bool plausibleSectorSize = bytesPerSector == 512 || bytesPerSector == 1024 || bytesPerSector == 2048 || bytesPerSector == 4096;
        const bool plausibleCluster = sectorsPerCluster > 0 && (sectorsPerCluster & (sectorsPerCluster - 1)) == 0;
        info.valid = plausibleSectorSize && plausibleCluster;
        info.fat32 = info.valid && rootEntryCount == 0 && fat16Sectors == 0 && fat32Sectors > 0;
        info.bytesPerSector = bytesPerSector;
        info.sectorsPerCluster = sectorsPerCluster;
        info.allocationUnitBytes = static_cast<uint32_t>(bytesPerSector) * sectorsPerCluster;
        info.recommendedAllocation = info.fat32 && info.allocationUnitBytes == 32768;
        printf("[USBMSC] fs bpb valid=%u fat32=%u bytesPerSector=%u sectorsPerCluster=%u allocation=%u recommended=%u partStart=%u\n",
               static_cast<unsigned>(info.valid), static_cast<unsigned>(info.fat32), static_cast<unsigned>(info.bytesPerSector),
               static_cast<unsigned>(info.sectorsPerCluster), static_cast<unsigned>(info.allocationUnitBytes),
               static_cast<unsigned>(info.recommendedAllocation), static_cast<unsigned>(info.partitionStartLba));
    } else {
        printf("[USBMSC] fs bpb read failed at lba=%u\n", static_cast<unsigned>(partitionStartLba));
    }

    s_usbStorageFormatInfo = info;
}

// Geometry/format probe only -- no USB side effects. Called at every normal
// boot so the USB storage page can show FAT type / allocation unit /
// capacity without ever starting TinyUSB (which would take over the single
// USB-C port away from the serial console).
static bool usbStorageProbeGeometry() {
    const int sectorSize = SD_MMC.sectorSize();
    if (sectorSize <= 0) {
        MWR_LOG_ERROR("USB MSC init failed: invalid SD sector size");
        return false;
    }
    s_usbMscSectorSize = static_cast<uint16_t>(sectorSize);

    const uint64_t cardBytes = SD_MMC.cardSize();
    const uint64_t sectorCount64 = cardBytes / static_cast<uint32_t>(sectorSize);
    if (cardBytes == 0 || sectorCount64 == 0 || sectorCount64 > 0xFFFFFFFFULL) {
        MWR_LOG_ERROR("USB MSC init failed: invalid SD sector geometry");
        return false;
    }
    const uint32_t sectorCount = static_cast<uint32_t>(sectorCount64);

    uint32_t exposedBase = 0;
    uint32_t exposedCount = sectorCount;
    uint32_t firstPartitionStart = 0;
    {
        uint8_t lba0[512];
        bool lba0Ok = false;
        printf("[USBMSC] init cardBytes=%llu sectorSize=%d sectorCount=%u mode=%s\n",
               static_cast<unsigned long long>(cardBytes), sectorSize, static_cast<unsigned>(sectorCount),
               kUsbMscReadOnlyProbe ? "read-only" : "read-write");
        if (sectorSize <= (int)sizeof(lba0) && SD_MMC.readRAW(lba0, 0)) {
            lba0Ok = true;
            printf("[USBMSC] lba0 bootsig[510..511]= %02X %02X\n", lba0[510], lba0[511]);
        } else {
            printf("[USBMSC] readRAW(lba0) FAILED\n");
        }
        fflush(stdout);
        if (lba0Ok && !usbMscMbrFitsDevice(lba0, sectorCount)) {
            MWR_LOG_ERROR("USB MSC init failed: SD partition exceeds exposed device size");
            return false;
        }
        if (lba0Ok && kUsbMscExposePartitionOnly) {
            uint32_t partStart = 0;
            uint32_t partCount = 0;
            if (usbMscFindFirstPartition(lba0, sectorCount, &partStart, &partCount)) {
                exposedBase = partStart;
                exposedCount = partCount;
                firstPartitionStart = partStart;
            }
        } else if (lba0Ok) {
            uint32_t partStart = 0;
            uint32_t partCount = 0;
            if (usbMscFindFirstPartition(lba0, sectorCount, &partStart, &partCount)) firstPartitionStart = partStart;
        }
    }
    s_usbMscLbaBase = exposedBase;
    s_usbMscBlockCount = exposedCount;
    s_usbStoragePartitionStartLba = firstPartitionStart;
    usbStorageUpdateFormatInfo(s_usbStoragePartitionStartLba, SD_MMC.cardSize(), SD_MMC.usedBytes());
    printf("[USBMSC] expose base=%u blocks=%u partitionOnly=%u\n",
           static_cast<unsigned>(s_usbMscLbaBase), static_cast<unsigned>(s_usbMscBlockCount),
           static_cast<unsigned>(kUsbMscExposePartitionOnly));
    return true;
}

