pullead/esp32-hifi/src/main.cpp
static bool usbStoragePrepareMsc(bool mediaPresent) {
    if (!usbStorageProbeGeometry()) return false;
    if (!s_usbMscConfigured) {
        s_usbMsc.vendorID("ESP32S3");
        s_usbMsc.productID("HiFi SD");
        s_usbMsc.productRevision("1.0");
        s_usbMsc.onRead(usbMscRead);
        s_usbMsc.onWrite(usbMscWrite);
        s_usbMsc.onStartStop(usbMscStartStop);
        s_usbMsc.isWritable(!kUsbMscReadOnlyProbe);
        s_usbMsc.mediaPresent(mediaPresent);
        if (!s_usbMsc.begin(static_cast<uint32_t>(s_usbMscBlockCount), s_usbMscSectorSize)) {
            MWR_LOG_ERROR("USB MSC begin failed");
            s_usbMsc.mediaPresent(false);
            return false;
        }
        s_usbMscConfigured = true;
    } else {
        s_usbMsc.isWritable(!kUsbMscReadOnlyProbe);
        s_usbMsc.mediaPresent(mediaPresent);
    }

    if (!s_usbStarted) {
        USB.manufacturerName("ESP32-S3 HiFi");
        USB.productName("HiFi SD Card");
        printf("[USBMSC] before boot USB.begin resetReason=%d\n", static_cast<int>(esp_reset_reason()));
        fflush(stdout);
        s_usbStarted = USB.begin();
        printf("[USBMSC] after boot USB.begin ok=%u resetReason=%d\n", static_cast<unsigned>(s_usbStarted), static_cast<int>(esp_reset_reason()));
        fflush(stdout);
        if (!s_usbStarted) {
            MWR_LOG_ERROR("USB begin failed");
            s_usbMsc.mediaPresent(false);
            return false;
        }
    }
    return true;
}
#endif

static bool usbStorageBlocksSdAppAccess() {
    return s_usbStorageState == UsbStorageState::Mounting ||
           s_usbStorageState == UsbStorageState::Mounted ||
           s_usbStorageState == UsbStorageState::Restoring;
}

static bool containsIcase(const char* haystack, const char* needle) {
    if (!haystack || !needle || !needle[0]) return false;
    const size_t needleLen = strlen(needle);
    for (const char* p = haystack; *p; ++p) {
        if (strncasecmp(p, needle, needleLen) == 0) return true;
    }
    return false;
}

// containsIcase() stops at the first NUL byte -- fine for genuine C-strings,
// but the APIC/PIC peek buffer starts with a 1-byte text-encoding field
// that's almost always 0x00, which made every scan-time cover check return
// false before it ever looked at the MIME string that follows. This variant
// is bounded by an explicit length instead of relying on NUL-termination.
static bool containsIcaseN(const uint8_t* haystack, size_t len, const char* needle) {
    const size_t needleLen = strlen(needle);
    if (!needleLen || needleLen > len) return false;
    for (size_t i = 0; i + needleLen <= len; ++i) {
        bool match = true;
        for (size_t j = 0; j < needleLen; ++j) {
            if (tolower(haystack[i + j]) != tolower(static_cast<unsigned char>(needle[j]))) {
                match = false;
                break;
            }
        }
        if (match) return true;
    }
    return false;
}

// SD_MMC/FAT filenames are commonly all-uppercase (e.g. "UTADA1.MP3") --
// endsWith() (common.h) is case-sensitive and silently skips those, so the
// scanner uses this instead.
static bool endsWithIcase(const char* name, const char* suffix) {
    if (!name || !suffix) return false;
    const size_t nameLen = strlen(name);
    const size_t suffixLen = strlen(suffix);
    if (suffixLen > nameLen) return false;
    return strncasecmp(name + (nameLen - suffixLen), suffix, suffixLen) == 0;
}

static void ensureLocalMusicDir() {
    if (usbStorageBlocksSdAppAccess()) return;
    File existing = SD_MMC.open(kLocalMusicDir);
    if (existing) {
        const bool isDir = existing.isDirectory();
        existing.close();
        if (isDir) return;
        MWR_LOG_ERROR("Local music path exists but is not a directory: {}", kLocalMusicDir);
        return;
    }
    if (SD_MMC.mkdir(kLocalMusicDir)) {
        printf("[MUSIC] created local music folder: %s\n", kLocalMusicDir);
    } else {
        MWR_LOG_ERROR("Failed to create local music folder: {}", kLocalMusicDir);
    }
}

// Reads a 4-byte synchsafe integer (each byte's high bit is always 0, 7
// significant bits) as used by ID3v2.4 header/frame sizes; v2.3 frame sizes
// are plain 32-bit big-endian instead (handled at each call site).
static uint32_t readSynchsafe32(const uint8_t* b) { return (uint32_t(b[0]) << 21) | (uint32_t(b[1]) << 14) | (uint32_t(b[2]) << 7) | uint32_t(b[3]); }
static uint32_t readBE32(const uint8_t* b) { return (uint32_t(b[0]) << 24) | (uint32_t(b[1]) << 16) | (uint32_t(b[2]) << 8) | uint32_t(b[3]); }

// A lot of real-world J-pop MP3 tags (older/non-compliant taggers, common on
// files ripped from Japanese sources) write UTF-8 bytes but leave the ID3
// encoding byte at 0 (ISO-8859-1) instead of 3 -- decoding those as Latin-1
// treats each UTF-8 continuation byte as its own Latin-1 character and
// mangles every multi-byte codepoint into unrelated garbage (renders as
// tofu, since the resulting "UTF-8" from the double-encode doesn't map to
// real glyphs). This checks whether the raw bytes already form valid UTF-8
// with real multi-byte content, so that case can be detected and decoded
// correctly instead of trusting a mislabeled encoding byte.
static bool looksLikeValidUtf8(const uint8_t* data, size_t len) {
    size_t i = 0;
    bool sawMultibyte = false;
    while (i < len && data[i] != 0) {
        const uint8_t c = data[i];
        if (c < 0x80) {
            ++i;
            continue;
        }
        uint8_t extra;
        if ((c & 0xE0) == 0xC0) extra = 1;
        else if ((c & 0xF0) == 0xE0) extra = 2;
        else if ((c & 0xF8) == 0xF0) extra = 3;
        else return false; // not a valid UTF-8 lead byte
        if (i + extra >= len) return false;
        for (uint8_t k = 1; k <= extra; ++k) {
            if ((data[i + k] & 0xC0) != 0x80) return false; // not a valid continuation byte
        }
        sawMultibyte = true;
        i += extra + 1;
    }
    return sawMultibyte;
}

// Best-effort decode of an ID3 text frame's payload into UTF-8. Encoding
// byte: 0=ISO-8859-1 (Latin-1 -> UTF-8), 1=UTF-16 with BOM, 2=UTF-16BE no
// BOM (v2.4 only), 3=UTF-8 already.
static void decodeId3Text(const uint8_t* data, size_t len, char* out, size_t outSize) {
    if (!outSize) return;
    if (len == 0) { out[0] = '\0'; return; }
    uint8_t encoding = data[0];
    const uint8_t* text = data + 1;
    const size_t textLen = len - 1;
    size_t outPos = 0;

