pullead/esp32-hifi/src/main.cpp
    if (encoding == 0 && looksLikeValidUtf8(text, textLen)) encoding = 3; // see looksLikeValidUtf8()

    if (encoding == 0 || encoding == 3) {
        // Character-aware (not byte-aware) truncation: the old version
        // capped the loop at "outPos + 2 < outSize" and copied one raw byte
        // per iteration regardless of whether that byte was the middle of a
        // multi-byte UTF-8 sequence -- running out of output space mid-title
        // could leave a lead byte with no (or only some of) its
        // continuation bytes, invalid UTF-8 that LVGL renders as a tofu box.
        // Now: figure out how many bytes the *whole* next character needs
        // (from the source, and from Latin-1's 2-byte UTF-8 expansion) and
        // stop before writing a partial one.
        for (size_t i = 0; i < textLen;) {
            const uint8_t c = text[i];
            if (c == 0) break;
            if (encoding == 3 && c >= 0x80) {
                size_t charLen = 1;
                if ((c & 0xE0) == 0xC0) charLen = 2;
                else if ((c & 0xF0) == 0xE0) charLen = 3;
                else if ((c & 0xF8) == 0xF0) charLen = 4;
                if (i + charLen > textLen) break;          // source truncated mid-character
                if (outPos + charLen + 1 > outSize) break;  // not enough room for the whole character + '\0'
                for (size_t k = 0; k < charLen; ++k) out[outPos++] = static_cast<char>(text[i + k]);
                i += charLen;
            } else if (c < 0x80) {
                if (outPos + 1 + 1 > outSize) break;
                out[outPos++] = static_cast<char>(c);
                ++i;
            } else { // Latin-1 high byte -> 2-byte UTF-8
                if (outPos + 2 + 1 > outSize) break;
                out[outPos++] = static_cast<char>(0xC0 | (c >> 6));
                out[outPos++] = static_cast<char>(0x80 | (c & 0x3F));
                ++i;
            }
        }
    } else {
        bool bigEndian = (encoding == 2);
        size_t i = 0;
        if (encoding == 1 && textLen >= 2) {
            if (text[0] == 0xFE && text[1] == 0xFF) { bigEndian = true; i = 2; }
            else if (text[0] == 0xFF && text[1] == 0xFE) { bigEndian = false; i = 2; }
        }
        for (; i + 1 < textLen && outPos + 3 < outSize; i += 2) {
            const uint16_t unit = bigEndian ? (uint16_t(text[i]) << 8 | text[i + 1]) : (uint16_t(text[i + 1]) << 8 | text[i]);
            if (unit == 0) break;
            if (unit < 0x80) {
                out[outPos++] = static_cast<char>(unit);
            } else if (unit < 0x800) {
                out[outPos++] = static_cast<char>(0xC0 | (unit >> 6));
                out[outPos++] = static_cast<char>(0x80 | (unit & 0x3F));
            } else {
                out[outPos++] = static_cast<char>(0xE0 | (unit >> 12));
                out[outPos++] = static_cast<char>(0x80 | ((unit >> 6) & 0x3F));
                out[outPos++] = static_cast<char>(0x80 | (unit & 0x3F));
            }
        }
    }
    out[outPos] = '\0';
}

// Scans an already-open file's ID3v2 tag for TIT2/TPE1/TALB (v2.2: TT2/
// TP1/TAL) and notes (via item->hasArt) whether an APIC/PIC frame with a
// JPEG payload is present -- the image bytes themselves are extracted
// lazily, only for whichever track is actually being displayed, by
// extractId3Picture() below (re-opens/re-parses; cheap, and avoids holding
// image data for a whole library scan).
static void parseId3Tags(File& file, LocalTrackItem* item) {
    uint8_t header[10];
    if (file.read(header, 10) != 10) return;
    if (memcmp(header, "ID3", 3) != 0) return;
    const uint8_t majorVersion = header[3];
    const uint32_t tagEnd = 10 + readSynchsafe32(&header[6]);
    const bool synchsafeFrameSize = majorVersion >= 4;
    const size_t idLen = majorVersion >= 3 ? 4 : 3;
    const size_t frameHeaderLen = majorVersion >= 3 ? 10 : 6;

    uint32_t pos = 10;
    uint8_t frameHeader[10];
    uint8_t textBuf[192];
    while (pos + frameHeaderLen <= tagEnd) {
        if (file.read(frameHeader, frameHeaderLen) != frameHeaderLen) break;
        char frameId[5] = {0, 0, 0, 0, 0};
        memcpy(frameId, frameHeader, idLen);
        if (frameId[0] == 0) break; // padding reached

        uint32_t frameSize;
        if (majorVersion >= 3) frameSize = synchsafeFrameSize ? readSynchsafe32(&frameHeader[4]) : readBE32(&frameHeader[4]);
        else frameSize = (uint32_t(frameHeader[3]) << 16) | (uint32_t(frameHeader[4]) << 8) | frameHeader[5];
        pos += frameHeaderLen;
        if (frameSize == 0 || pos + frameSize > tagEnd) break;

        const bool isTitle = strcmp(frameId, "TIT2") == 0 || strcmp(frameId, "TT2") == 0;
        const bool isArtist = strcmp(frameId, "TPE1") == 0 || strcmp(frameId, "TP1") == 0;
        const bool isAlbum = strcmp(frameId, "TALB") == 0 || strcmp(frameId, "TAL") == 0;
        const bool isPicture = strcmp(frameId, "APIC") == 0 || strcmp(frameId, "PIC") == 0;

        if (isPicture) {
            // Peek at the MIME/format field only, to avoid claiming
            // hasArt for a PNG cover (no PNG decoder in this build either).
            uint8_t peek[24] = {0};
            const uint32_t peekLen = std::min<uint32_t>(frameSize, sizeof(peek) - 1);
            file.read(peek, peekLen);
            if (containsIcaseN(peek, sizeof(peek), "jpeg") || containsIcaseN(peek, sizeof(peek), "jpg")) item->hasArt = true;
            file.seek(file.position() + (frameSize - peekLen));
        } else if ((isTitle || isArtist || isAlbum) && frameSize < sizeof(textBuf)) {
            if (file.read(textBuf, frameSize) != frameSize) break;
            char* dest = isTitle ? item->title : isArtist ? item->artist : item->album;
            const size_t destSize = isTitle ? sizeof(item->title) : isArtist ? sizeof(item->artist) : sizeof(item->album);
            decodeId3Text(textBuf, frameSize, dest, destSize);
        } else {
            file.seek(file.position() + frameSize);
        }
        pos += frameSize;
    }
}

