pullead/esp32-hifi/src/main.cpp
// Re-opens `path` and walks its ID3 tag again looking for the first usable
// (JPEG) picture frame, this time extracting the exact image bytes into a
// fresh malloc'd buffer (caller frees). Only called for the track actually
// being shown, not during the library scan.
static bool extractId3Picture(const char* path, uint8_t** outData, size_t* outLen) {
    *outData = nullptr;
    *outLen = 0;
    File file = SD_MMC.open(path, "r");
    if (!file) return false;

    uint8_t header[10];
    bool ok = false;
    if (file.read(header, 10) == 10 && memcmp(header, "ID3", 3) == 0) {
        const uint8_t majorVersion = header[3];
        const uint32_t tagEnd = 10 + readSynchsafe32(&header[6]);
        const bool synchsafeFrameSize = majorVersion >= 4;
        const size_t idLen = majorVersion >= 3 ? 4 : 3;
        const size_t frameHeaderLen = majorVersion >= 3 ? 10 : 6;

        uint32_t pos = 10;
        uint8_t frameHeader[10];
        while (!ok && pos + frameHeaderLen <= tagEnd) {
            if (file.read(frameHeader, frameHeaderLen) != frameHeaderLen) break;
            char frameId[5] = {0, 0, 0, 0, 0};
            memcpy(frameId, frameHeader, idLen);
            if (frameId[0] == 0) break;

            uint32_t frameSize;
            if (majorVersion >= 3) frameSize = synchsafeFrameSize ? readSynchsafe32(&frameHeader[4]) : readBE32(&frameHeader[4]);
            else frameSize = (uint32_t(frameHeader[3]) << 16) | (uint32_t(frameHeader[4]) << 8) | frameHeader[5];
            pos += frameHeaderLen;
            if (frameSize == 0 || pos + frameSize > tagEnd) break;

            const bool isPicture = strcmp(frameId, "APIC") == 0 || strcmp(frameId, "PIC") == 0;
            const uint32_t frameStart = file.position();
            if (isPicture) {
                uint8_t encoding = 0;
                file.read(&encoding, 1);
                char mime[16] = {0};
                if (idLen == 4) { // APIC: null-terminated MIME string
                    size_t i = 0;
                    uint8_t c = 1;
                    while (i < sizeof(mime) - 1 && file.read(&c, 1) == 1 && c != 0) mime[i++] = static_cast<char>(c);
                } else { // PIC (v2.2): fixed 3-char format, not null-terminated
                    uint8_t fmt[3] = {0};
                    file.read(fmt, 3);
                    memcpy(mime, fmt, 3);
                }
                uint8_t pictureType = 0;
                file.read(&pictureType, 1);
                if (encoding == 1 || encoding == 2) { // UTF-16 description: 2-byte terminator
                    uint8_t pair[2] = {1, 1};
                    while (file.read(pair, 2) == 2 && (pair[0] != 0 || pair[1] != 0)) {}
                } else { // single-byte terminator
                    uint8_t c = 1;
                    while (file.read(&c, 1) == 1 && c != 0) {}
                }
                const uint32_t imageStart = file.position();
                const uint32_t imageLen = (frameStart + frameSize > imageStart) ? (frameStart + frameSize - imageStart) : 0;
                if ((containsIcase(mime, "jpeg") || containsIcase(mime, "jpg")) && imageLen > 0 && imageLen < 2UL * 1024 * 1024) {
                    uint8_t* buf = static_cast<uint8_t*>(ps_malloc(imageLen));
                    if (buf && file.read(buf, imageLen) == imageLen) {
                        *outData = buf;
                        *outLen = imageLen;
                        ok = true;
                    } else if (buf) {
                        free(buf);
                    }
                }
            }
            if (!ok) file.seek(frameStart + frameSize);
            pos += frameSize;
        }
    }
    file.close();
    return ok;
}

static void scanMusicDir(const char* path, uint8_t depth) {
    if (usbStorageBlocksSdAppAccess()) return;
    if (!s_localTracks || s_localTrackCount >= kMaxLocalTracks || depth > 6) return;
    File dir = SD_MMC.open(path);
    if (!dir || !dir.isDirectory()) {
        if (dir) dir.close();
        return;
    }
    for (;;) {
        File entry = dir.openNextFile();
        if (!entry) break;
        if (s_localTrackCount >= kMaxLocalTracks) {
            entry.close();
            break;
        }
        if (entry.isDirectory()) {
            ps_ptr<char> subPath = entry.path();
            entry.close();
            scanMusicDir(subPath.c_get(), depth + 1);
            continue;
        }
        if (endsWithIcase(entry.name(), ".mp3")) {
            LocalTrackItem item{};
            strlcpy(item.path, entry.path(), sizeof(item.path));
            parseId3Tags(entry, &item);
            if (!item.title[0]) { // no TIT2 -- fall back to filename minus extension
                strlcpy(item.title, entry.name(), sizeof(item.title));
                char* dot = strrchr(item.title, '.');
                if (dot) *dot = '\0';
            }
            printf("[MUSIC] #%u title=\"%s\" artist=\"%s\" album=\"%s\" hasArt=%d\n", s_localTrackCount, item.title, item.artist, item.album, item.hasArt);
            s_localTracks[s_localTrackCount++] = item;
        }
        entry.close();
    }
    dir.close();
}

static void localMusicScanTask(void*) {
    ensureLocalMusicDir();
    if (s_localTracks) {
        free(s_localTracks);
        s_localTracks = nullptr;
    }
    s_localTrackCount = 0;
    s_localTracks = static_cast<LocalTrackItem*>(ps_calloc(kMaxLocalTracks, sizeof(LocalTrackItem)));
    if (s_localTracks) scanMusicDir("/", 0);
    printf("[MUSIC] scan done, %u tracks\n", s_localTrackCount);
    s_localLibraryScanning = false;
    vTaskDelete(nullptr);
}

static bool startLocalMusicScan() {
    if (s_localLibraryScanning || usbStorageBlocksSdAppAccess()) return false;
    s_localLibraryScanning = true;
    const BaseType_t created = xTaskCreatePinnedToCore(localMusicScanTask, "musicScan", 8192, nullptr, 1, nullptr, 0);
    if (created != pdPASS) {
        s_localLibraryScanning = false;
        MWR_LOG_ERROR("Failed to create local music scan task");
        return false;
    }
    return true;
}

bool playerCoreLocalLibraryScanning() { return s_localLibraryScanning; }
uint16_t playerCoreLocalLibraryCount() { return s_localTrackCount; }

bool playerCoreLocalTrack(uint16_t index, LocalTrackItem* item) {
    if (s_localLibraryScanning || usbStorageBlocksSdAppAccess()) return false;
    if (!s_localTracks || index >= s_localTrackCount || !item) return false;
    *item = s_localTracks[index];
    return true;
}

bool playerCoreDecodeLocalTrackCover(uint16_t index, uint8_t scaleFactor, uint16_t** outPixels, uint16_t* outWidth, uint16_t* outHeight) {
    *outPixels = nullptr;
    *outWidth = 0;
    *outHeight = 0;
    if (s_localLibraryScanning || usbStorageBlocksSdAppAccess()) return false;
    if (!s_localTracks || index >= s_localTrackCount) {
        printf("[COVER] idx=%u out of range (count=%u)\n", index, s_localTrackCount);
        return false;
    }
    if (!s_localTracks[index].hasArt) {
        printf("[COVER] idx=%u hasArt=false (scan-time MIME check found no jpeg/jpg)\n", index);
        return false;
    }
    uint8_t* jpegData = nullptr;
    size_t jpegLen = 0;
    if (!extractId3Picture(s_localTracks[index].path, &jpegData, &jpegLen)) {
        printf("[COVER] idx=%u extractId3Picture failed (path=%s)\n", index, s_localTracks[index].path);
        return false;
    }
    printf("[COVER] idx=%u extracted %u JPEG bytes, decoding...\n", index, static_cast<unsigned>(jpegLen));
    const bool ok = getTFT().decodeJpgFromMemory(jpegData, jpegLen, scaleFactor, outPixels, outWidth, outHeight);
    if (!ok) printf("[COVER] idx=%u decodeJpgFromMemory failed\n", index);
    free(jpegData);
    return ok;
}

#if MWR_USB_MSC_SUPPORTED
static bool usbStorageAllowsMscIo() {
    return s_usbStorageState == UsbStorageState::Mounting || s_usbStorageState == UsbStorageState::Mounted;
}

static bool usbMscRequestFits(uint32_t lba, uint32_t offset, uint32_t size, uint32_t sectorSize) {
    if (sectorSize == 0 || s_usbMscBlockCount == 0) return false;
    if (offset >= sectorSize) return false;
    if (size == 0) return lba < s_usbMscBlockCount;

