pullead/esp32-hifi/src/main.cpp
    const uint64_t begin = static_cast<uint64_t>(lba) * sectorSize + offset;
    const uint64_t end = begin + size;
    const uint64_t limit = static_cast<uint64_t>(s_usbMscBlockCount) * sectorSize;
    return end <= limit;
}

static int32_t usbMscRecordResult(bool write, uint32_t lba, uint32_t offset, uint32_t size, int32_t result) {
    s_usbMscLastLba = lba;
    const uint32_t accessCount = size ? ((offset + size + 511) / 512) : 1;
    const uint32_t endLba = lba + accessCount - 1;
    const uint32_t totalCount = s_usbMscReadCount + s_usbMscWriteCount;
    if (totalCount == 0 || lba < s_usbMscMinLba) s_usbMscMinLba = lba;
    if (endLba > s_usbMscMaxLba) s_usbMscMaxLba = endLba;
    s_usbMscLastOffset = offset;
    s_usbMscLastSize = size;
    if (size > s_usbMscMaxSize) s_usbMscMaxSize = size;
    s_usbMscLastResult = result;
    if (write) {
        ++s_usbMscWriteCount;
        if (result < 0 || static_cast<uint32_t>(result) != size) ++s_usbMscWriteFailCount;
    } else {
        ++s_usbMscReadCount;
        if (result < 0 || static_cast<uint32_t>(result) != size) ++s_usbMscReadFailCount;
    }
    return result;
}

static int32_t usbMscRead(uint32_t lba, uint32_t offset, void* buffer, uint32_t bufsize) {
    if (!usbStorageAllowsMscIo() || !buffer) return usbMscRecordResult(false, lba, offset, bufsize, -1);
    const uint32_t secSize = SD_MMC.sectorSize();
    if (!secSize) return usbMscRecordResult(false, lba, offset, bufsize, -1);
    if (!usbMscRequestFits(lba, offset, bufsize, secSize)) {
        return usbMscRecordResult(false, lba, offset, bufsize, -1);
    }
    s_usbStorageLastAccessMs = millis();

    if (offset == 0 && (bufsize % secSize) == 0) {
        for (uint32_t done = 0; done < bufsize; done += secSize) {
            const uint32_t hostLba = lba + done / secSize;
            const uint32_t physicalLba = s_usbMscLbaBase + hostLba;
            if (!SD_MMC.readRAW(static_cast<uint8_t*>(buffer) + done, physicalLba)) {
                return usbMscRecordResult(false, hostLba, offset, bufsize, -1);
            }
        }
        return usbMscRecordResult(false, lba, offset, bufsize, static_cast<int32_t>(bufsize));
    }

    uint8_t sector[512];
    if (secSize > sizeof(sector)) return usbMscRecordResult(false, lba, offset, bufsize, -1);
    uint32_t done = 0;
    while (done < bufsize) {
        const uint32_t absolute = offset + done;
        const uint32_t hostLba = lba + absolute / secSize;
        const uint32_t physicalLba = s_usbMscLbaBase + hostLba;
        const uint32_t inSector = absolute % secSize;
        const uint32_t chunk = std::min<uint32_t>(bufsize - done, secSize - inSector);
        if (!SD_MMC.readRAW(sector, physicalLba)) return usbMscRecordResult(false, hostLba, offset, bufsize, -1);
        memcpy(static_cast<uint8_t*>(buffer) + done, sector + inSector, chunk);
        done += chunk;
    }
    return usbMscRecordResult(false, lba, offset, bufsize, static_cast<int32_t>(bufsize));
}

static int32_t usbMscWrite(uint32_t lba, uint32_t offset, uint8_t* buffer, uint32_t bufsize) {
    if (kUsbMscReadOnlyProbe) {
        s_usbStorageLastAccessMs = millis();
        return usbMscRecordResult(true, lba, offset, bufsize, -1);
    }
    if (!usbStorageAllowsMscIo() || !buffer) return usbMscRecordResult(true, lba, offset, bufsize, -1);
    const uint32_t secSize = SD_MMC.sectorSize();
    if (!secSize) return usbMscRecordResult(true, lba, offset, bufsize, -1);
    if (!usbMscRequestFits(lba, offset, bufsize, secSize)) {
        return usbMscRecordResult(true, lba, offset, bufsize, -1);
    }
    s_usbStorageLastAccessMs = millis();

    if (offset == 0 && (bufsize % secSize) == 0) {
        for (uint32_t done = 0; done < bufsize; done += secSize) {
            const uint32_t hostLba = lba + done / secSize;
            const uint32_t physicalLba = s_usbMscLbaBase + hostLba;
            if (!SD_MMC.writeRAW(buffer + done, physicalLba)) {
                return usbMscRecordResult(true, hostLba, offset, bufsize, -1);
            }
        }
        return usbMscRecordResult(true, lba, offset, bufsize, static_cast<int32_t>(bufsize));
    }

    uint8_t sector[512];
    if (secSize > sizeof(sector)) return usbMscRecordResult(true, lba, offset, bufsize, -1);
    uint32_t done = 0;
    while (done < bufsize) {
        const uint32_t absolute = offset + done;
        const uint32_t hostLba = lba + absolute / secSize;
        const uint32_t physicalLba = s_usbMscLbaBase + hostLba;
        const uint32_t inSector = absolute % secSize;
        const uint32_t chunk = std::min<uint32_t>(bufsize - done, secSize - inSector);
        if (!SD_MMC.readRAW(sector, physicalLba)) return usbMscRecordResult(true, hostLba, offset, bufsize, -1);
        memcpy(sector + inSector, buffer + done, chunk);
        if (!SD_MMC.writeRAW(sector, physicalLba)) return usbMscRecordResult(true, hostLba, offset, bufsize, -1);
        done += chunk;
    }
    return usbMscRecordResult(true, lba, offset, bufsize, static_cast<int32_t>(bufsize));
}

static bool usbMscStartStop(uint8_t powerCondition, bool start, bool loadEject) {
    printf("[USBMSC] start_stop power=%u start=%u eject=%u\n", powerCondition, start, loadEject);
    if (loadEject && !start) s_usbStorageHostEjected = true;
    return true;
}

static void usbStorageRebootToMscTask(void*) {
    // Mounting now means "write the NVS flag and reboot into USB storage
    // mode" -- TinyUSB is only ever started at boot (runtime USB.begin()
    // is unsafe: ESP_RST_USB, see DEV_LOG 2026-07-31). The short delay
    // lets the UI paint the "正在重启进入U盘模式" state before the reboot.
    s_usbStorageState = UsbStorageState::Mounting;
    vTaskDelay(pdMS_TO_TICKS(400));
    ESP.restart();
    vTaskDelete(nullptr);
}

static void usbStorageRebootToNormalTask(void*) {
    // Leaving storage mode is the mirror image: clear the flag and reboot
    // back into the normal app, which remounts SD and rescans /Music.
    s_usbStorageState = UsbStorageState::Restoring;
    // Give any pending host writes a moment to settle before the reboot
    // (same quiesce window the old unmount task used).
    const uint32_t waitStart = millis();
    while (millis() - s_usbStorageLastAccessMs < 1000 && millis() - waitStart < 3000) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    usbMscSetModeFlag(false);
    vTaskDelay(pdMS_TO_TICKS(400));
    ESP.restart();
    vTaskDelete(nullptr);
}
#endif

UsbStorageState playerCoreUsbStorageState() { return s_usbStorageState; }

bool playerCoreUsbStorageStats(UsbStorageStats* out) {
    if (!out) return false;
    out->readCount = s_usbMscReadCount;
    out->writeCount = s_usbMscWriteCount;
    out->readFailCount = s_usbMscReadFailCount;
    out->writeFailCount = s_usbMscWriteFailCount;
    out->lastLba = s_usbMscLastLba;
    out->minLba = s_usbMscMinLba;
    out->maxLba = s_usbMscMaxLba;
    out->lastOffset = s_usbMscLastOffset;
    out->lastSize = s_usbMscLastSize;
    out->maxSize = s_usbMscMaxSize;
    out->lastResult = s_usbMscLastResult;
    return true;
}

