pullead/esp32-hifi/src/main.cpp
bool playerCoreUsbStorageFormatInfo(UsbStorageFormatInfo* out) {
    if (!out) return false;
    *out = s_usbStorageFormatInfo;
    return s_usbStorageFormatInfo.valid || s_usbStorageFormatInfo.totalBytes > 0;
}

// USB 声卡模式的进入/退出。和 U 盘模式共用同一套机制、同样的理由：这块板
// 运行时调 USB.begin() 会触发 ESP_RST_USB 复位，TinyUSB 只能在开机时启动，
// 所以切换模式必须"写 NVS 标志 + 重启"，没有别的办法。
//
// 短延时是留给 UI 把状态画出来，和 usbStorageRebootToMscTask 一个道理。
static void usbDacRebootTask(void*) {
    vTaskDelay(pdMS_TO_TICKS(400));
#if MWR_USB_DAC_SUPPORTED
    // ⚠️ 从声卡模式退出时**不能**用普通的 ESP.restart()。
    //
    // ESP32-S3 的 USB-OTG（TinyUSB）和 USB-Serial/JTAG 共用同一对 D+/D- 引脚，
    // 同时只能有一个生效。本次启动里调过 USB.begin() 之后 PHY 就被 OTG 控制器
    // 占住了，普通重启不保证把它干净地交还给 ROM 的 USB-Serial/JTAG——实测表现
    // 是重启后板子在 USB 上彻底消失：没有串口、没有音频设备、连 VID_303A 都
    // 查不到，必须按住 BOOT 拔插才能恢复。
    //
    // usb_persist_restart(RESTART_NO_PERSIST) 会先复位 USB 外设再重启，让 PHY
    // 回到干净状态。只在确实进过声卡模式时才用——正常模式下 TinyUSB 从没启动
    // 过，没必要动 USB 外设。
    if (s_usbDacModeActive) {
        usb_persist_restart(RESTART_NO_PERSIST);
        vTaskDelay(pdMS_TO_TICKS(200)); // 上面那个不返回；万一返回了就走下面兜底
    }
#endif
    ESP.restart();
    vTaskDelete(nullptr);
}

bool playerCoreUsbDacEnter() {
#if MWR_USB_DAC_SUPPORTED
    stopSong(); // 先停播放，I2S 要交给声卡模式独占
    usbDacSetModeFlag(true); // 内部会同时清掉 U 盘模式标志（两者互斥）
    if (xTaskCreatePinnedToCore(usbDacRebootTask, "usbDacOn", 4096, nullptr, 2, nullptr, 0) != pdPASS) {
        usbDacSetModeFlag(false);
        MWR_LOG_ERROR("Failed to create USB DAC reboot task");
        return false;
    }
    return true;
#else
    return false;
#endif
}

bool playerCoreUsbDacExit() {
#if MWR_USB_DAC_SUPPORTED
    usbDacSetModeFlag(false);
    if (xTaskCreatePinnedToCore(usbDacRebootTask, "usbDacOff", 4096, nullptr, 2, nullptr, 0) != pdPASS) {
        MWR_LOG_ERROR("Failed to create USB DAC exit reboot task");
        return false;
    }
    return true;
#else
    return false;
#endif
}

bool playerCoreUsbDacActive() {
    return s_usbDacModeActive;
}

bool playerCoreUsbStorageMount() {
#if MWR_USB_MSC_SUPPORTED
    if ((s_usbStorageState != UsbStorageState::Idle && s_usbStorageState != UsbStorageState::Error) || s_usbStorageBusy) return false;
    stopSong(); // stop playback before handing the SD card to the host
    s_usbStorageBusy = true;
    usbMscSetModeFlag(true);
    const BaseType_t created = xTaskCreatePinnedToCore(usbStorageRebootToMscTask, "usbMscOn", 4096, nullptr, 2, nullptr, 0);
    if (created != pdPASS) {
        s_usbStorageBusy = false;
        usbMscSetModeFlag(false);
        s_usbStorageState = UsbStorageState::Error;
        MWR_LOG_ERROR("Failed to create USB MSC reboot task");
        return false;
    }
    return true;
#else
    s_usbStorageState = UsbStorageState::Unsupported;
    return false;
#endif
}

bool playerCoreUsbStorageUnmount() {
#if MWR_USB_MSC_SUPPORTED
    if (s_usbStorageState != UsbStorageState::Mounted || s_usbStorageBusy) return false;
    s_usbStorageBusy = true;
    const BaseType_t created = xTaskCreatePinnedToCore(usbStorageRebootToNormalTask, "usbMscOff", 4096, nullptr, 2, nullptr, 0);
    if (created != pdPASS) {
        s_usbStorageBusy = false;
        MWR_LOG_ERROR("Failed to create USB MSC reboot task");
        return false;
    }
    return true;
#else
    s_usbStorageState = UsbStorageState::Unsupported;
    return false;
#endif
}

static void processUsbStorage() {
#if MWR_USB_MSC_SUPPORTED
    if (s_usbStorageState == UsbStorageState::Mounted && s_usbStorageHostEjected && !s_usbStorageBusy) {
        playerCoreUsbStorageUnmount();
    }
#endif
    if (s_usbStorageState == UsbStorageState::Scanning && !s_localLibraryScanning) {
        s_usbStorageState = UsbStorageState::Idle;
    }
}

// ---- Synchronized lyrics (ID3v2 SYLT frame) ------------------------------
// Only millisecond-timestamped SYLT (time_stamp_format=2) is supported --
// the MPEG-frame-count format exists but is rare in practice and would need
// the actual frame rate to convert, which isn't readily available here.
// Parsed lazily for whichever track is currently playing (like cover art),
// not cached for the whole library.
struct LyricLine {
    uint32_t ms = 0;
    char text[160]{}; // was 80 -- real .lrc/lrclib lines routinely exceed that once CJK (3 bytes/char in UTF-8)
                       // or UTF-16-encoded SYLT text is accounted for, and got silently truncated
};
constexpr uint16_t kMaxLyricLines = 300;
static LyricLine* s_lyricLines = nullptr;
static uint16_t s_lyricCount = 0;
static uint16_t s_lyricTrackIndex = 0xFFFF; // which track s_lyricLines holds, avoids re-parsing every call

// Tracks the online-fetch lifecycle for whichever track s_lyricTrackIndex is
// currently on, so the UI can show something more useful than a blanket
// "没有歌词信息" while a lookup is in flight or after one has failed (see
// HifiUi::refreshLocalNowPlaying()). Idle: no lookup needed/started yet
// (local lyrics found, or track just changed). Pending: queued or running
// on lyricsFetchTask. Found/NotFound: lyricsFetchTask finished.
// Type itself lives in player_service.h (already #included above) since the
// UI side needs it too -- this file just uses it, doesn't redefine it.
static LyricFetchState s_lyricFetchState = LyricFetchState::Idle;

// Guards s_lyricLines/s_lyricCount/s_lyricTrackIndex, which playerCoreLoadLyrics()
// (LVGL-tick thread) and lyricsFetchTask() (background network fetch) can now
// both touch -- without this, a track change freeing s_lyricLines while the
// fetch task is mid-read/adopt would be a use-after-free.
static SemaphoreHandle_t s_lyricsMutex = nullptr;
static QueueHandle_t s_lyricsFetchQueue = nullptr; // length 1, holds a pending track index (xQueueOverwrite)
static volatile uint16_t s_lyricsOnlineReadyIndex = 0xFFFF; // consume-once signal for the UI (see playerCoreLyricsOnlineReady)

// GBK is a superset of GB2312, common for Chinese/Japanese .lrc files
// downloaded from lyric sites -- decodes a 2-byte GBK sequence via
// gbk_table (see gbk_table.h) into its Unicode codepoint, then encodes that
// as UTF-8. Ascii passes through unchanged.
static size_t gbkToUtf8(const uint8_t* data, size_t len, char* out, size_t outSize) {
    size_t outPos = 0;
    size_t i = 0;
    while (i < len && outPos + 3 < outSize) {
        const uint8_t c = data[i];
        if (c < 0x80) {
            out[outPos++] = static_cast<char>(c);
            ++i;
            continue;
        }
        if (i + 1 >= len || c < 0x81 || c > 0xFE) { ++i; continue; } // stray/invalid lead byte, skip
        const uint8_t trail = data[i + 1];
        if (trail < 0x40 || trail == 0x7F || trail > 0xFE) { ++i; continue; }
        const uint32_t trailIdx = trail < 0x7F ? (trail - 0x40) : (trail - 0x41);
        const uint32_t idx = (static_cast<uint32_t>(c) - 0x81) * 190 + trailIdx;
        const uint16_t cp = idx < 23940 ? gbk_table[idx] : 0xFFFD;
        i += 2;
        if (cp == 0xFFFD) continue;
        if (cp < 0x80) {
            out[outPos++] = static_cast<char>(cp);
        } else if (cp < 0x800) {
            out[outPos++] = static_cast<char>(0xC0 | (cp >> 6));
            out[outPos++] = static_cast<char>(0x80 | (cp & 0x3F));
        } else {
            out[outPos++] = static_cast<char>(0xE0 | (cp >> 12));
            out[outPos++] = static_cast<char>(0x80 | ((cp >> 6) & 0x3F));
            out[outPos++] = static_cast<char>(0x80 | (cp & 0x3F));
        }
    }
    out[outPos] = '\0';
    return outPos;
}

