pullead/esp32-hifi/src/main.cpp
// Parses a "[mm:ss.xx]" timestamp starting right after '[' (p points at the
// first digit). Fractional-second digit count is interpreted as tenths(1)/
// hundredths(2)/milliseconds(3+), since real .lrc files in the wild mix
// digit counts even within one file. Returns the position right after ']',
// or nullptr if this bracket isn't a valid timestamp (a metadata tag like
// "[ti:...]" or malformed).
static const char* parseLrcTimestamp(const char* p, uint32_t* outMs) {
    if (!isdigit(static_cast<unsigned char>(*p))) return nullptr;
    uint32_t mm = 0;
    while (isdigit(static_cast<unsigned char>(*p))) { mm = mm * 10 + (*p - '0'); ++p; }
    if (*p != ':') return nullptr;
    ++p;
    if (!isdigit(static_cast<unsigned char>(*p))) return nullptr;
    uint32_t ss = 0;
    while (isdigit(static_cast<unsigned char>(*p))) { ss = ss * 10 + (*p - '0'); ++p; }
    uint32_t frac = 0, fracDigits = 0;
    if (*p == '.') {
        ++p;
        while (isdigit(static_cast<unsigned char>(*p))) {
            frac = frac * 10 + (*p - '0');
            ++fracDigits;
            ++p;
        }
    }
    if (*p != ']') return nullptr;
    ++p;
    uint32_t fracMs = 0;
    if (fracDigits == 1) fracMs = frac * 100;
    else if (fracDigits == 2) fracMs = frac * 10;
    else if (fracDigits >= 3) fracMs = frac;
    *outMs = mm * 60000 + ss * 1000 + fracMs;
    return p;
}

// External .lrc sidecar (same basename as the mp3, ".lrc" extension) --
// more common in practice than embedded ID3 SYLT, and what real lyric-site
// downloads use. Auto-detects GBK vs UTF-8 per file (looksLikeValidUtf8())
// since both show up in the wild and neither declares itself.
// Builds the .lrc sidecar path for a track (same basename, ".lrc" instead
// of the audio extension) -- shared by the on-disk loader and the online
// fetch's save-to-SD step, so both always agree on where a track's lyrics
// live.
static void deriveLrcPath(const char* mp3Path, char* outPath, size_t outSize) {
    strlcpy(outPath, mp3Path, outSize);
    char* dot = strrchr(outPath, '.');
    if (dot) *dot = '\0';
    strlcat(outPath, ".lrc", outSize);
}

// Parses raw LRC text (from either a file read or a downloaded lyrics
// string) into `lines` (caller-allocated, capacity maxLines), decoding
// GBK-or-UTF8 per line as auto-detected by the caller. Returns the count
// written; caller still needs to sort by timestamp (multi-timestamp lines
// and authoring quirks can leave raw output out of order).
// Copies up to outSize-1 bytes of a UTF-8 string, but if the byte-count cap
// would land in the middle of a multi-byte sequence, backs off to drop that
// whole (incomplete) character instead of cutting it in half. A plain
// memcpy+truncate (what this replaced) could leave a lead byte with no -- or
// only some of -- its continuation bytes, which isn't valid UTF-8 and is
// exactly what LVGL renders as a tofu box. This is what was actually behind
// "部分字方框乱码" in long lyric lines, not a missing font glyph.
static void utf8SafeCopy(const char* src, size_t srcLen, char* out, size_t outSize) {
    size_t n = std::min(srcLen, outSize - 1);
    // Walk back over continuation bytes (10xxxxxx) to find where the last
    // (possibly truncated) character starts.
    size_t leadPos = n;
    while (leadPos > 0 && (static_cast<uint8_t>(src[leadPos - 1]) & 0xC0) == 0x80) --leadPos;
    if (leadPos > 0) {
        const uint8_t lead = static_cast<uint8_t>(src[leadPos - 1]);
        size_t seqLen = 1;
        if ((lead & 0xE0) == 0xC0) seqLen = 2;
        else if ((lead & 0xF0) == 0xE0) seqLen = 3;
        else if ((lead & 0xF8) == 0xF0) seqLen = 4;
        // That lead byte's full sequence spans [leadPos-1, leadPos-1+seqLen).
        // If it doesn't fit within n, the cut landed inside it -- drop the
        // whole character rather than keep a partial one.
        if ((leadPos - 1) + seqLen > n) n = leadPos - 1;
    }
    memcpy(out, src, n);
    out[n] = '\0';
}

static uint16_t parseLrcBuffer(const uint8_t* raw, size_t readLen, bool isUtf8, LyricLine* lines, uint16_t maxLines) {
    uint16_t count = 0;
    size_t lineStart = 0;
    for (size_t i = 0; i <= readLen && count < maxLines; ++i) {
        if (i == readLen || raw[i] == '\n') {
            size_t lineEnd = i;
            while (lineEnd > lineStart && (raw[lineEnd - 1] == '\r' || raw[lineEnd - 1] == ' ')) --lineEnd;
            const char* p = reinterpret_cast<const char*>(raw + lineStart);
            const char* lineEndPtr = reinterpret_cast<const char*>(raw + lineEnd);

            uint32_t timestamps[8];
            uint8_t tsCount = 0;
            while (p < lineEndPtr && *p == '[' && tsCount < 8) {
                uint32_t ms;
                const char* next = parseLrcTimestamp(p + 1, &ms);
                if (!next) {
                    const char* close = static_cast<const char*>(memchr(p, ']', lineEndPtr - p));
                    if (!close) { p = lineEndPtr; break; } // malformed tag, bail this line
                    p = close + 1;
                    continue; // metadata tag ([ti:...] etc) -- keep scanning, don't count as a timestamp
                }
                timestamps[tsCount++] = ms;
                p = next;
            }
            if (tsCount > 0 && p < lineEndPtr) {
                // Sized to match LyricLine::text (160 bytes) -- was 80 and,
                // separately from the UTF-8 boundary bug above, silently
                // truncating any line longer than that regardless.
                char text[160];
                if (isUtf8) {
                    utf8SafeCopy(p, lineEndPtr - p, text, sizeof(text));
                } else {
                    gbkToUtf8(reinterpret_cast<const uint8_t*>(p), lineEndPtr - p, text, sizeof(text));
                }
                for (uint8_t t = 0; t < tsCount && count < maxLines; ++t) {
                    lines[count].ms = timestamps[t];
                    strlcpy(lines[count].text, text, sizeof(lines[count].text));
                    ++count;
                }
            }
            lineStart = i + 1;
        }
    }
    return count;
}

static bool loadLrcSidecar(const char* mp3Path) {
    char lrcPath[176];
    deriveLrcPath(mp3Path, lrcPath, sizeof(lrcPath));
    if (!SD_MMC.exists(lrcPath)) return false;

    File file = SD_MMC.open(lrcPath, "r");
    if (!file) return false;
    const size_t fileSize = file.size();
    if (fileSize == 0 || fileSize > 256UL * 1024) { // sanity cap, real lyric files are a few KB
        file.close();
        return false;
    }
    uint8_t* raw = static_cast<uint8_t*>(ps_malloc(fileSize + 1));
    if (!raw) {
        file.close();
        return false;
    }
    const size_t readLen = file.read(raw, fileSize);
    file.close();
    raw[readLen] = 0;

