pullead/esp32-hifi/src/main.cpp
    const bool isUtf8 = looksLikeValidUtf8(raw, readLen);
    LyricLine* lines = static_cast<LyricLine*>(ps_calloc(kMaxLyricLines, sizeof(LyricLine)));
    if (!lines) {
        free(raw);
        return false;
    }
    const uint16_t count = parseLrcBuffer(raw, readLen, isUtf8, lines, kMaxLyricLines);
    free(raw);

    if (count == 0) {
        free(lines);
        return false;
    }
    std::sort(lines, lines + count, [](const LyricLine& a, const LyricLine& b) { return a.ms < b.ms; });
    s_lyricLines = lines;
    s_lyricCount = count;
    return true;
}

// ---- Online lyrics fetch (lrclib.net) ------------------------------------
// Runs only when a track has neither a local .lrc sidecar nor embedded
// SYLT lyrics (see playerCoreLoadLyrics) and WiFi is up. lrclib.net is a
// free, keyless, open lyrics database purpose-built for synced LRC lookup.

static void urlEncodeAppend(String& url, const char* s) {
    static const char hex[] = "0123456789ABCDEF";
    for (const unsigned char* p = reinterpret_cast<const unsigned char*>(s); *p; ++p) {
        const unsigned char c = *p;
        if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') url += static_cast<char>(c);
        else {
            url += '%';
            url += hex[c >> 4];
            url += hex[c & 0xF];
        }
    }
}

// Extracts and unescapes a top-level JSON string field "key":"value" from
// body. Handles the escapes a typical JSON serializer emits (\", \\, \/,
// \n, \r, \t, \uXXXX -- BMP only, re-encoded to UTF-8); raw non-ASCII bytes
// pass through unescaped since lyric text is served as literal UTF-8, not
// \u-escaped. Returns false if the key is absent or its value isn't a
// string (e.g. JSON null for an instrumental track's syncedLyrics).
static bool jsonStringField(const String& body, const char* key, String& out) {
    const String needle = String("\"") + key + "\":";
    int pos = body.indexOf(needle);
    if (pos < 0) return false;
    pos += needle.length();
    while (pos < static_cast<int>(body.length()) && isspace(static_cast<unsigned char>(body[pos]))) ++pos;
    if (pos >= static_cast<int>(body.length()) || body[pos] != '"') return false;
    ++pos;
    out = "";
    while (pos < static_cast<int>(body.length()) && body[pos] != '"') {
        const char c = body[pos];
        if (c == '\\' && pos + 1 < static_cast<int>(body.length())) {
            const char e = body[pos + 1];
            if (e == 'n') { out += '\n'; pos += 2; continue; }
            if (e == 'r') { out += '\r'; pos += 2; continue; }
            if (e == 't') { out += '\t'; pos += 2; continue; }
            if (e == '"') { out += '"'; pos += 2; continue; }
            if (e == '\\') { out += '\\'; pos += 2; continue; }
            if (e == '/') { out += '/'; pos += 2; continue; }
            if (e == 'u' && pos + 5 < static_cast<int>(body.length())) {
                char hex[5] = {body[pos + 2], body[pos + 3], body[pos + 4], body[pos + 5], 0};
                const uint32_t cp = strtoul(hex, nullptr, 16);
                if (cp >= 0xD800 && cp <= 0xDBFF) {
                    // High surrogate of a non-BMP pair (emoji etc.): expect
                    // a following \uDC00-\uDFFF low surrogate and combine
                    // them into one code point encoded as 4-byte UTF-8.
                    // Without this, each surrogate half got encoded as a
                    // 3-byte sequence -> invalid UTF-8 -> garbled text.
                    if (pos + 11 < static_cast<int>(body.length()) && body[pos + 6] == '\\' && body[pos + 7] == 'u') {
                        char lowHex[5] = {body[pos + 8], body[pos + 9], body[pos + 10], body[pos + 11], 0};
                        const uint32_t low = strtoul(lowHex, nullptr, 16);
                        if (low >= 0xDC00 && low <= 0xDFFF) {
                            const uint32_t combined = 0x10000 + ((cp - 0xD800) << 10) + (low - 0xDC00);
                            out += static_cast<char>(0xF0 | (combined >> 18));
                            out += static_cast<char>(0x80 | ((combined >> 12) & 0x3F));
                            out += static_cast<char>(0x80 | ((combined >> 6) & 0x3F));
                            out += static_cast<char>(0x80 | (combined & 0x3F));
                            pos += 12;
                            continue;
                        }
                    }
                    // Lone/invalid surrogate: drop it rather than emit bad UTF-8.
                    pos += 6;
                    continue;
                }
                if (cp < 0x80) {
                    out += static_cast<char>(cp);
                } else if (cp < 0x800) {
                    out += static_cast<char>(0xC0 | (cp >> 6));
                    out += static_cast<char>(0x80 | (cp & 0x3F));
                } else {
                    out += static_cast<char>(0xE0 | (cp >> 12));
                    out += static_cast<char>(0x80 | ((cp >> 6) & 0x3F));
                    out += static_cast<char>(0x80 | (cp & 0x3F));
                }
                pos += 6;
                continue;
            }
        }
        out += c;
        ++pos;
    }
    return true;
}

// Issues one lrclib.net request and, on success, parses+saves+adopts the
// lyrics -- shared by both the exact /api/get lookup (single JSON object)
// and the fuzzy /api/search lookup (JSON array): jsonStringField() just
// finds the first top-level "syncedLyrics" field in the body either way,
// which for /search is whichever result the API ranked first/most
// relevant. Extracted from what used to be fetchLyricsOnline()'s entire
// body, now that it tries several URLs per track (see fetchLyricsOnline()).
static bool tryLyricsRequest(const String& url, const LocalTrackItem& item, uint16_t index) {
    printf("[LYRICS] GET %s\n", url.c_str());
    WiFiClientSecure client;
    client.setInsecure(); // no cert pinning, same tradeoff as the weather fetch
    HTTPClient http;
    if (!http.begin(client, url)) return false;
    http.setTimeout(8000);
    http.addHeader("User-Agent", "MiniWebRadio-HiFi/1.0 (github.com, ESP32-S3 device)");
    const int code = http.GET();
    bool ok = false;
    if (code == HTTP_CODE_OK) {
        const String body = http.getString();
        printf("[LYRICS] HTTP %d, body[0..200]=%s\n", code, body.substring(0, 200).c_str());
        String synced;
        if (jsonStringField(body, "syncedLyrics", synced) && synced.length() > 0) {
            const uint8_t* raw = reinterpret_cast<const uint8_t*>(synced.c_str());
            const size_t rawLen = synced.length();
            const bool isUtf8 = looksLikeValidUtf8(raw, rawLen); // API text is UTF-8; kept for consistency with the file path
            LyricLine* lines = static_cast<LyricLine*>(ps_calloc(kMaxLyricLines, sizeof(LyricLine)));
            if (lines) {
                uint16_t count = parseLrcBuffer(raw, rawLen, isUtf8, lines, kMaxLyricLines);
                if (count > 0) {
                    std::sort(lines, lines + count, [](const LyricLine& a, const LyricLine& b) { return a.ms < b.ms; });
                    char lrcPath[176];
                    deriveLrcPath(item.path, lrcPath, sizeof(lrcPath));
                    File out = SD_MMC.open(lrcPath, "w", true);
                    if (out) {
                        out.print(synced);
                        out.close();
                    }
                    if (s_lyricsMutex) xSemaphoreTake(s_lyricsMutex, portMAX_DELAY);
                    // Only adopt into the live cache if it's still tracking
                    // this same index -- if the user skipped to another
                    // track during the slow network round trip, a later
                    // playerCoreLoadLyrics() call already moved
                    // s_lyricTrackIndex on, and adopting here would clobber
                    // whatever that call loaded.
                    if (s_lyricTrackIndex == index) {
                        if (s_lyricLines) free(s_lyricLines);
                        s_lyricLines = lines;
                        s_lyricCount = count;
                        lines = nullptr; // ownership transferred
                    }
                    if (s_lyricsMutex) xSemaphoreGive(s_lyricsMutex);
                    ok = true;
                }
                if (lines) free(lines); // not adopted, or count==0
            }
        }
    } else {
        printf("[LYRICS] HTTP GET failed, code=%d\n", code);
    }
    http.end();
    return ok;
}

// ---- Radio station logos (radio-browser.info) -----------------------------
// One JPEG cache file per station on SD (/logo/radio_<index>.jpg) -- fetched
// on demand, never at boot. radio-browser's own favicon field is frequently
// PNG/ICO, which the on-device decoder (tftLib's JPEG-only decodeJpgFromMemory,
// same one local cover art uses) can't handle; those simply fail to decode
// later and the UI falls back to the generic RADIO glyph, same as "no logo
// found" -- there's no format sniffing/conversion here, just graceful failure.
static volatile bool s_radioIconSyncInProgress = false;

static void radioIconPath(uint16_t index, char* out, size_t outSize) { snprintf(out, outSize, "/logo/radio_%u.jpg", index); }

// Downloads url's response body straight into an SD file, capped at maxBytes
// so one absurdly large "favicon" can't fill the card. Returns false (and
// leaves no partial file behind) on any error.
static bool httpDownloadToFile(const String& url, const char* sdPath, size_t maxBytes) {
    WiFiClientSecure secureClient;
    WiFiClient plainClient;
    HTTPClient http;
    const bool isHttps = url.startsWith("https://");
    if (isHttps) secureClient.setInsecure();
    const bool began = isHttps ? http.begin(secureClient, url) : http.begin(plainClient, url);
    if (!began) {
        printf("[ICON] download begin() failed url=%s\n", url.c_str());
        return false;
    }
    http.setTimeout(8000);
    // Placeholder/theme-photo services (loremflickr.com in particular) hand
    // out the actual image via a 301/302 to their CDN -- HTTPClient doesn't
    // follow redirects by default (HTTPC_DISABLE_FOLLOW_REDIRECTS), which
    // read as plain download failures until this was traced via [ICON] logs.
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.addHeader("User-Agent", "MiniWebRadio-HiFi/1.0 (github.com, ESP32-S3 device)");
    const int code = http.GET();
    if (code != HTTP_CODE_OK) {
        printf("[ICON] download GET failed url=%s httpCode=%d free=%u\n", url.c_str(), code, (unsigned)ESP.getFreeHeap());
        http.end();
        return false;
    }
    WiFiClient* stream = http.getStreamPtr();
    File out = SD_MMC.open(sdPath, "w", true);
    if (!out) {
        printf("[ICON] download SD open failed path=%s\n", sdPath);
        http.end();
        return false;
    }
    uint8_t buf[512];
    size_t total = 0;
    bool ok = true;
    uint32_t lastDataMs = millis();
    while (http.connected() && total < maxBytes) {
        const size_t avail = stream->available();
        if (!avail) {
            if (millis() - lastDataMs > 8000) break; // stream stalled
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }
        const size_t want = std::min(avail, sizeof(buf));
        const size_t got = stream->readBytes(buf, std::min(want, maxBytes - total));
        if (!got) break;
        out.write(buf, got);
        total += got;
        lastDataMs = millis();
    }
    out.close();
    http.end();
    if (total == 0) {
        printf("[ICON] download got 0 bytes url=%s httpCode=%d\n", url.c_str(), code);
        SD_MMC.remove(sdPath);
        ok = false;
    } else {
        printf("[ICON] download ok url=%s bytes=%u%s\n", url.c_str(), (unsigned)total, total >= maxBytes ? " (capped)" : "");
    }
    return ok;
}

// Retries a download twice (one retry after a short backoff) -- covers the
// occasional transient TLS/network hiccup seen in testing (a station's real
// favicon failing once, then succeeding a moment later on an identical
// request). Doesn't help a genuinely-empty/dead URL (station.country field
// staying 0 bytes every time), only actual flakiness.
static bool httpDownloadToFileRetrying(const String& url, const char* sdPath, size_t maxBytes) {
    if (httpDownloadToFile(url, sdPath, maxBytes)) return true;
    vTaskDelay(pdMS_TO_TICKS(300));
    return httpDownloadToFile(url, sdPath, maxBytes);
}

