pullead/esp32-hifi/src/main.cpp
// Picks a single ASCII keyword to drive the Level-1 theme-photo fallback
// (see fetchOneStationIcon): radio-browser's own "tags" field first (its
// genre tags, e.g. "jazz,lounge", are exactly the kind of word a stock-photo
// keyword search wants), then the first ASCII word in the station name
// itself (works for "Jazz Sakura" -> "Jazz"; a Chinese/Japanese-only name
// has no ASCII run and falls through), and finally a generic "radio" so
// this always returns something.
static String pickThemeKeyword(const String& tags, const char* name) {
    // A single ASCII word only -- loremflickr's path segment is a bare
    // keyword (or comma-separated keywords), and a raw space in there (e.g.
    // radio-browser's own multi-word tags like "classic jazz") makes an
    // invalid URL and comes back 400. Taking just the first word of
    // whichever source we use sidesteps encoding it at all.
    const int comma = tags.indexOf(',');
    const String firstTag = comma >= 0 ? tags.substring(0, comma) : tags;
    String word;
    for (size_t i = 0; i < firstTag.length(); ++i) {
        const char c = firstTag[i];
        if (isalpha(static_cast<uint8_t>(c))) {
            word += c;
        } else if (word.length() >= 2) {
            break;
        } else {
            word = "";
        }
    }
    if (word.length() >= 2) return word;

    word = "";
    for (const char* p = name; *p; ++p) {
        if (isalpha(static_cast<uint8_t>(*p))) {
            word += *p;
        } else if (word.length() >= 3) {
            break;
        } else {
            word = ""; // false start (too short) -- keep scanning for a real word
        }
    }
    if (word.length() >= 2) return word;
    return "radio";
}

// One station: radio-browser's byname search, first result's "favicon"
// field, then download that image straight to this station's cache path.
// Falls back through two levels if the real favicon is missing or won't
// download: a themed stock photo keyed by genre/name (Level 1), then --
// entirely offline, no further network attempt -- the UI itself draws a
// colored monogram tile (Level 2, see HifiUi's station-icon fallback
// rendering). This function only ever handles Level 0/1; returning false
// here just means "nothing to cache", which the UI already treats as "draw
// the fallback".
static bool fetchOneStationIcon(uint16_t index) {
    RadioStationItem item{};
    if (!playerCoreRadioStation(index, &item) || !item.name[0]) return false;

    String encodedName;
    for (const char* p = item.name; *p; ++p) {
        const uint8_t c = static_cast<uint8_t>(*p);
        if (isalnum(c)) encodedName += static_cast<char>(c);
        else {
            char esc[4];
            snprintf(esc, sizeof(esc), "%%%02X", c);
            encodedName += esc;
        }
    }
    const String searchUrl = "https://de1.api.radio-browser.info/json/stations/byname/" + encodedName + "?limit=1";

    WiFiClientSecure client;
    client.setInsecure();
    HTTPClient http;
    if (!http.begin(client, searchUrl)) {
        printf("[ICON] #%u \"%s\" search begin() failed\n", index, item.name);
        return false;
    }
    http.setTimeout(8000);
    http.addHeader("User-Agent", "MiniWebRadio-HiFi/1.0 (github.com, ESP32-S3 device)");
    const int code = http.GET();
    String favicon, tags;
    if (code == HTTP_CODE_OK) {
        const String body = http.getString();
        jsonStringField(body, "favicon", favicon);
        jsonStringField(body, "tags", tags);
    }
    http.end();

    char sdPath[48];
    radioIconPath(index, sdPath, sizeof(sdPath));

    if (favicon.length() > 0) {
        printf("[ICON] #%u \"%s\" favicon=%s\n", index, item.name, favicon.c_str());
        if (httpDownloadToFileRetrying(favicon, sdPath, 96 * 1024)) return true;
        printf("[ICON] #%u real favicon failed (incl. retry), trying theme photo\n", index);
    } else {
        printf("[ICON] #%u \"%s\" no favicon (searchHttpCode=%d)\n", index, item.name, code);
    }

    // Level 1: no real logo -- try a themed stock photo instead of leaving
    // this station with nothing. loremflickr.com serves a real (Flickr,
    // public-domain-ish) photo for a given keyword, always as a JPEG, which
    // is exactly what the on-device decoder needs -- no format-sniffing
    // required, unlike radio-browser's favicon field.
    const String keyword = pickThemeKeyword(tags, item.name);
    const String themeUrl = "https://loremflickr.com/300/300/" + keyword;
    printf("[ICON] #%u theme fallback keyword=\"%s\" url=%s\n", index, keyword.c_str(), themeUrl.c_str());
    if (httpDownloadToFileRetrying(themeUrl, sdPath, 96 * 1024)) return true;

    printf("[ICON] #%u theme fallback also failed -- UI will draw an offline monogram\n", index);
    return false;
}

static void radioIconSyncTask(void*) {
    if (!SD_MMC.exists("/logo")) SD_MMC.mkdir("/logo");
    const uint16_t count = staMgnt.getSumStations();
    for (uint16_t i = 1; i <= count; ++i) {
        char sdPath[48];
        radioIconPath(i, sdPath, sizeof(sdPath));
        if (SD_MMC.exists(sdPath)) continue; // already cached (or a prior attempt already left a marker -- see below)
        if (!WiFi.isConnected()) break;       // no point continuing a sync that can't reach the network
        if (!fetchOneStationIcon(i)) {
            // Leave a zero-byte marker so a station with no findable/valid
            // logo isn't re-queried (and re-fails) every single time this
            // list is opened -- SD_MMC.exists() above treats it the same
            // as a real cached file, and the decode step below already
            // handles "exists but 0 bytes" as "no icon" gracefully.
            File marker = SD_MMC.open(sdPath, "w", true);
            if (marker) marker.close();
        }
        vTaskDelay(pdMS_TO_TICKS(50)); // don't hammer the API/network back to back
    }
    s_radioIconSyncInProgress = false;
    vTaskDelete(nullptr);
}

void playerCoreRadioIconSyncStart() {
    if (s_radioIconSyncInProgress) return;
    s_radioIconSyncInProgress = true;
    if (xTaskCreatePinnedToCore(radioIconSyncTask, "radioIcon", 8192, nullptr, 1, nullptr, 0) != pdPASS) {
        s_radioIconSyncInProgress = false;
        MWR_LOG_ERROR("Failed to create radio icon sync task");
    }
}

