pullead/esp32-hifi/src/main.cpp
bool playerCoreRadioIconSyncInProgress() { return s_radioIconSyncInProgress; }

bool playerCoreDecodeRadioIcon(uint16_t index, uint8_t scaleFactor, uint16_t** outPixels, uint16_t* outWidth, uint16_t* outHeight) {
    *outPixels = nullptr;
    *outWidth = 0;
    *outHeight = 0;
    char sdPath[48];
    radioIconPath(index, sdPath, sizeof(sdPath));
    File in = SD_MMC.open(sdPath, "r");
    if (!in) return false;
    const size_t len = in.size();
    if (len == 0) { // zero-byte marker -- "no icon available", not an error
        in.close();
        return false;
    }
    uint8_t* data = static_cast<uint8_t*>(ps_malloc(len));
    if (!data) {
        in.close();
        return false;
    }
    const size_t readLen = in.read(data, len);
    in.close();
    if (readLen != len) {
        free(data);
        return false;
    }
    const bool ok = getTFT().decodeJpgFromMemory(data, len, scaleFactor, outPixels, outWidth, outHeight);
    free(data);
    return ok;
}

// Strips a trailing " (...)" parenthetical -- e.g. a Chinese translation
// bolted onto a Japanese title by whoever tagged the file, "俺の彼女 (我的
// 女友)" -- to get a cleaner query. lrclib.net's database has the bare
// original title; an exact-match /api/get on the annotated version never
// hits since the annotation isn't part of the real track name. Returns
// false (leaving out untouched) if there's no parenthetical to strip.
static bool stripParentheticalSuffix(const char* title, char* out, size_t outSize) {
    const char* paren = strchr(title, '(');
    if (!paren || paren == title) return false;
    size_t len = paren - title;
    while (len > 0 && title[len - 1] == ' ') --len; // trim the space before '('
    if (len == 0 || len >= outSize) return false;
    memcpy(out, title, len);
    out[len] = '\0';
    return true;
}

// Fetches synced lyrics for s_localTracks[index] from lrclib.net, saves them
// as a .lrc sidecar on SD (so future plays don't need the network again),
// and adopts them into the live s_lyricLines cache if the user hasn't since
// moved on to a different track. Runs on lyricsFetchTask, never the UI
// thread -- this does a real multi-second HTTP round trip (up to 4, see
// below, in the worst case where nothing matches at all).
//
// Tries the original ID3 title first, then (if it has a "(...)" suffix) a
// cleaned-up short title -- each against both lrclib.net's exact-match
// /api/get and its fuzzy /api/search, in that order. This was added after
// real-world testing showed most "not found" results were locally-tagged
// titles that simply don't match lrclib's database character-for-character
// (a translation annotation, or -- for tracks with no real ID3 title at
// all, just the bare filename -- nothing usably close to the real title),
// not a bug in the request itself.
static bool fetchLyricsOnline(uint16_t index) {
    if (!s_localTracks || index >= s_localTrackCount) return false;
    if (!WiFi.isConnected()) return false;
    const LocalTrackItem& item = s_localTracks[index];
    if (!item.title[0]) return false;

    char shortTitle[64];
    const bool hasShortTitle = stripParentheticalSuffix(item.title, shortTitle, sizeof(shortTitle));
    const char* titles[2] = {item.title, hasShortTitle ? shortTitle : nullptr};

    for (uint8_t t = 0; t < 2; ++t) {
        const char* title = titles[t];
        if (!title) continue;

        String getUrl = "https://lrclib.net/api/get?track_name=";
        urlEncodeAppend(getUrl, title);
        if (item.artist[0]) {
            getUrl += "&artist_name=";
            urlEncodeAppend(getUrl, item.artist);
        }
        if (item.album[0]) {
            getUrl += "&album_name=";
            urlEncodeAppend(getUrl, item.album);
        }
        if (tryLyricsRequest(getUrl, item, index)) return true;

        String query = title;
        if (item.artist[0]) {
            query += " ";
            query += item.artist;
        }
        String searchUrl = "https://lrclib.net/api/search?q=";
        urlEncodeAppend(searchUrl, query.c_str());
        if (tryLyricsRequest(searchUrl, item, index)) return true;
    }
    return false;
}

static void lyricsFetchTask(void*) {
    uint16_t index;
    for (;;) {
        if (xQueueReceive(s_lyricsFetchQueue, &index, portMAX_DELAY) == pdTRUE) {
            const bool ok = fetchLyricsOnline(index);
            printf("[LYRICS] online fetch idx=%u %s\n", index, ok ? "found" : "not found");
            // Only updates the state the UI shows if the user is still on this
            // same track -- a later playerCoreLoadLyrics() for a different
            // track already reset s_lyricFetchState for that new track, and
            // this would otherwise stomp it right back to Found/NotFound.
            if (s_lyricTrackIndex == index) s_lyricFetchState = ok ? LyricFetchState::Found : LyricFetchState::NotFound;
            s_lyricsOnlineReadyIndex = index; // consumed once by playerCoreLyricsOnlineReady()
        }
    }
}

// Consume-once signal: true (and clears the pending flag) exactly once per
// completed background fetch, whether or not lyrics were actually found --
// the UI uses this to know when to re-check playerCoreLoadLyrics()'s cache
// for a track it's still displaying, rather than polling the network state
// directly.
bool playerCoreLyricsOnlineReady(uint16_t* outIndex) {
    if (s_lyricsOnlineReadyIndex == 0xFFFF) return false;
    *outIndex = s_lyricsOnlineReadyIndex;
    s_lyricsOnlineReadyIndex = 0xFFFF;
    return true;
}

bool playerCoreLoadLyrics(uint16_t index) {
    if (!s_localTracks || index >= s_localTrackCount) return false;
    if (s_lyricsMutex) xSemaphoreTake(s_lyricsMutex, portMAX_DELAY);
    if (s_lyricTrackIndex == index) {
        const bool cached = s_lyricCount > 0; // already parsed (or already known to have none)
        if (s_lyricsMutex) xSemaphoreGive(s_lyricsMutex);
        return cached;
    }
    if (s_lyricLines) {
        free(s_lyricLines);
        s_lyricLines = nullptr;
    }
    s_lyricCount = 0;
    s_lyricTrackIndex = index;
    s_lyricFetchState = LyricFetchState::Idle;
    if (s_lyricsMutex) xSemaphoreGive(s_lyricsMutex);

