pullead/esp32-hifi/src/main.cpp
    if (loadLrcSidecar(s_localTracks[index].path)) {
        printf("[LYRICS] idx=%u lines=%u (source=.lrc)\n", index, s_lyricCount);
        s_lyricFetchState = LyricFetchState::Found;
        return true;
    }

    File file = SD_MMC.open(s_localTracks[index].path, "r");
    if (!file) return false;

    uint8_t header[10];
    bool found = false;
    if (file.read(header, 10) == 10 && memcmp(header, "ID3", 3) == 0) {
        const uint8_t majorVersion = header[3];
        const uint32_t tagEnd = 10 + readSynchsafe32(&header[6]);
        const bool synchsafeFrameSize = majorVersion >= 4;
        const size_t idLen = majorVersion >= 3 ? 4 : 3;
        const size_t frameHeaderLen = majorVersion >= 3 ? 10 : 6;

        uint32_t pos = 10;
        uint8_t frameHeader[10];
        while (!found && pos + frameHeaderLen <= tagEnd) {
            if (file.read(frameHeader, frameHeaderLen) != frameHeaderLen) break;
            char frameId[5] = {0, 0, 0, 0, 0};
            memcpy(frameId, frameHeader, idLen);
            if (frameId[0] == 0) break;

            uint32_t frameSize;
            if (majorVersion >= 3) frameSize = synchsafeFrameSize ? readSynchsafe32(&frameHeader[4]) : readBE32(&frameHeader[4]);
            else frameSize = (uint32_t(frameHeader[3]) << 16) | (uint32_t(frameHeader[4]) << 8) | frameHeader[5];
            pos += frameHeaderLen;
            if (frameSize == 0 || pos + frameSize > tagEnd) break;

            const uint32_t frameStart = file.position();
            if (strcmp(frameId, "SYLT") == 0) {
                uint8_t encoding = 0, lang[3], tsFormat = 0, contentType = 0;
                file.read(&encoding, 1);
                file.read(lang, 3);
                file.read(&tsFormat, 1);
                file.read(&contentType, 1);
                // skip content descriptor (encoding-dependent null terminator)
                if (encoding == 1 || encoding == 2) {
                    uint8_t pair[2] = {1, 1};
                    while (file.read(pair, 2) == 2 && (pair[0] != 0 || pair[1] != 0)) {}
                } else {
                    uint8_t c = 1;
                    while (file.read(&c, 1) == 1 && c != 0) {}
                }
                if (tsFormat == 2) { // milliseconds; MPEG-frame-count format not supported
                    LyricLine* lines = static_cast<LyricLine*>(ps_calloc(kMaxLyricLines, sizeof(LyricLine)));
                    if (lines) {
                        uint16_t count = 0;
                        while (count < kMaxLyricLines && file.position() < frameStart + frameSize) {
                            // Sized for LyricLine::text's 160-byte output cap: UTF-16 encodings
                            // use 2 bytes/char, so 320 raw bytes covers every line that could
                            // possibly still fit after decodeId3Text's own truncation.
                            uint8_t textBuf[321];
                            size_t tlen = 0;
                            if (encoding == 1 || encoding == 2) {
                                uint8_t pair[2];
                                while (tlen + 2 < sizeof(textBuf) && file.read(pair, 2) == 2) {
                                    if (pair[0] == 0 && pair[1] == 0) break;
                                    textBuf[tlen++] = pair[0];
                                    textBuf[tlen++] = pair[1];
                                }
                            } else {
                                uint8_t c;
                                while (tlen < sizeof(textBuf) - 1 && file.read(&c, 1) == 1 && c != 0) textBuf[tlen++] = c;
                            }
                            uint8_t tsBytes[4];
                            if (file.read(tsBytes, 4) != 4) break;
                            // decodeId3Text expects [encoding][text...], reuse it for the
                            // per-line text same as any other ID3 text field.
                            uint8_t frameForDecode[322];
                            frameForDecode[0] = encoding;
                            memcpy(frameForDecode + 1, textBuf, tlen);
                            decodeId3Text(frameForDecode, tlen + 1, lines[count].text, sizeof(lines[count].text));
                            lines[count].ms = readBE32(tsBytes);
                            ++count;
                        }
                        if (count > 0) {
                            s_lyricLines = lines;
                            s_lyricCount = count;
                            found = true;
                        } else {
                            free(lines);
                        }
                    }
                } else {
                    // Real-world SYLT frames often use MPEG-frame-count
                    // timestamps (tsFormat=1) instead of milliseconds --
                    // this diagnostic exists because a track can show
                    // "audiofile contains synchronized lyrics" in the audio
                    // library's own log while still yielding 0 parsed lines
                    // here, which otherwise looks identical to "no lyrics".
                    printf("[LYRICS] SYLT found but tsFormat=%u unsupported (need 2=ms)\n", tsFormat);
                }
            }
            file.seek(frameStart + frameSize);
            pos += frameSize;
        }
    }
    file.close();
    printf("[LYRICS] idx=%u lines=%u\n", index, s_lyricCount);
    if (found) s_lyricFetchState = LyricFetchState::Found;

    // No lyrics found locally (neither .lrc sidecar nor embedded SYLT) --
    // ask lyricsFetchTask to try lrclib.net in the background. Enqueued,
    // not fetched inline, since this function runs on the LVGL/UI thread
    // and a multi-second HTTP round trip here would freeze the UI.
    if (!found) {
        if (WiFi.isConnected() && s_lyricsFetchQueue) {
            s_lyricFetchState = LyricFetchState::Pending;
            xQueueOverwrite(s_lyricsFetchQueue, &index);
        } else {
            s_lyricFetchState = LyricFetchState::NotFound; // no network to even try -- see playerCoreRetryLyricsFetch()
        }
    }
    return found;
}

// Re-queues an online lookup for the track currently on screen (see
// HifiUi::onLyricRetryAction) -- e.g. the first attempt had no WiFi yet, or
// lrclib.net simply doesn't have this track and the user wants to check
// again after correcting local tags. No-op if playback has since moved to
// a different track, or there's still nothing to fetch with.
void playerCoreRetryLyricsFetch(uint16_t index) {
    if (index != s_lyricTrackIndex || !WiFi.isConnected() || !s_lyricsFetchQueue) return;
    s_lyricFetchState = LyricFetchState::Pending;
    xQueueOverwrite(s_lyricsFetchQueue, &index);
}

