pullead/esp32-hifi/src/main.cpp
// Idle/Pending/Found/NotFound as a plain uint8_t for the UI (player_service.h
// declares its own identical enum rather than including this file's).
// Returns Idle for any index other than s_lyricTrackIndex -- the state only
// really describes "whichever track is currently loaded".
uint8_t playerCoreLyricsFetchState(uint16_t index) {
    if (index != s_lyricTrackIndex) return static_cast<uint8_t>(LyricFetchState::Idle);
    return static_cast<uint8_t>(s_lyricFetchState);
}

// Returns the text of whichever lyric line is current at positionMs, or an
// empty string before the first line / with no lyrics loaded. Lines are
// assumed chronologically ordered in the file (standard for SYLT). Copies
// the matched text into a static buffer while holding s_lyricsMutex, rather
// than returning a pointer straight into s_lyricLines, since the background
// lyricsFetchTask can free/replace that array between calls.
const char* playerCoreCurrentLyricLine(uint32_t positionMs) {
    static char lineBuf[80];
    lineBuf[0] = '\0';
    if (s_lyricsMutex) xSemaphoreTake(s_lyricsMutex, portMAX_DELAY);
    if (s_lyricLines && s_lyricCount) {
        int32_t idx = -1;
        for (uint16_t i = 0; i < s_lyricCount; ++i) {
            if (s_lyricLines[i].ms <= positionMs) idx = i;
            else break;
        }
        if (idx >= 0) strlcpy(lineBuf, s_lyricLines[idx].text, sizeof(lineBuf));
    }
    if (s_lyricsMutex) xSemaphoreGive(s_lyricsMutex);
    return lineBuf;
}

// ---- Cloud Music (在线音乐 / 网易云) -- Render Music Gateway -------------
// Phase 2 scope only: config storage + gateway health/wake check, per the
// project's own phased NCM spec. No search, resolve, or playback wiring yet
// (that's phases 3-4) -- see services/ncm-gateway/README.md for the backend
// this talks to, and PlayerSource::CloudMusic's own comment (added in a
// later phase) for how this eventually plugs into the existing
// Radio/Sd mutual-exclusion in PlayerService.

static constexpr const char* kCloudBaseUrlPrefKey = "cm_base_url";
static constexpr const char* kCloudDeviceKeyPrefKey = "cm_dev_key";

static volatile CloudServiceState s_cloudServiceState = CloudServiceState::Unknown;
static SemaphoreHandle_t s_cloudMusicMutex = nullptr; // guards s_cloudConfig across the LVGL thread and cloudMusicWakeTask
static CloudMusicConfig s_cloudConfig;
static volatile bool s_cloudWakeTaskRunning = false;
static volatile uint32_t s_cloudLastReadyMs = 0; // millis() when s_cloudServiceState last became Ready
// Gateway config history (up to 5, newest first). Every saved/used config
// is upserted here; only playerCoreCloudMusicHistoryDelete() removes one.
// Stored in NVS as cm_h<i>u/k/t so it survives app-only reflashes.
static constexpr uint8_t kCloudHistoryMax = 5;
static CloudMusicHistoryEntry s_cloudHistory[kCloudHistoryMax];
static uint8_t s_cloudHistoryCount = 0;

static bool cloudMusicLock(TickType_t timeout = pdMS_TO_TICKS(250)) {
    return !s_cloudMusicMutex || xSemaphoreTake(s_cloudMusicMutex, timeout) == pdTRUE;
}
static void cloudMusicUnlock() {
    if (s_cloudMusicMutex) xSemaphoreGive(s_cloudMusicMutex);
}

// Loads the saved gateway URL/key from NVS into s_cloudConfig. Called once
// at boot (see setup()) -- afterwards s_cloudConfig is the source of truth,
// updated in lockstep with NVS by playerCoreSetCloudMusicConfig().
static void cloudMusicLoadConfig() {
    if (!lockPreferences()) return;
    const String baseUrl = pref.getString(kCloudBaseUrlPrefKey, "");
    const String deviceKey = pref.getString(kCloudDeviceKeyPrefKey, "");
    unlockPreferences();
    if (cloudMusicLock()) {
        strlcpy(s_cloudConfig.baseUrl, baseUrl.c_str(), sizeof(s_cloudConfig.baseUrl));
        strlcpy(s_cloudConfig.deviceKey, deviceKey.c_str(), sizeof(s_cloudConfig.deviceKey));
        s_cloudConfig.configured = s_cloudConfig.baseUrl[0] != '\0' && s_cloudConfig.deviceKey[0] != '\0';
        cloudMusicUnlock();
    }
}

CloudMusicConfig playerCoreCloudMusicConfig() {
    CloudMusicConfig out;
    if (cloudMusicLock()) {
        out = s_cloudConfig;
        cloudMusicUnlock();
    }
    // Render only serves https (plain http is a 301 stub) and our HTTPS
    // clients cannot follow an http->https redirect, so hand every consumer
    // a normalized https URL -- this also covers configs saved before this
    // normalization existed.
    if (strncmp(out.baseUrl, "http://", 7) == 0) {
        String tmp(out.baseUrl);
        tmp.remove(0, 7); // drop "http://"
        tmp = "https://" + tmp;
        strlcpy(out.baseUrl, tmp.c_str(), sizeof(out.baseUrl));
    }
    return out;
}

static void cloudMusicHistoryKey(uint8_t index, char suffix, char* out, size_t outSize) {
    snprintf(out, outSize, "cm_h%u%c", static_cast<unsigned>(index), suffix);
}

static void cloudMusicLoadHistory() {
    if (!lockPreferences()) return;
    uint8_t count = 0;
    for (uint8_t i = 0; i < kCloudHistoryMax; ++i) {
        char kUrl[16], kKey[16], kTs[16];
        cloudMusicHistoryKey(i, 'u', kUrl, sizeof(kUrl));
        cloudMusicHistoryKey(i, 'k', kKey, sizeof(kKey));
        cloudMusicHistoryKey(i, 't', kTs, sizeof(kTs));
        const String url = pref.getString(kUrl, "");
        const String key = pref.getString(kKey, "");
        if (url.isEmpty() || key.isEmpty()) continue;
        CloudMusicHistoryEntry& e = s_cloudHistory[count];
        strlcpy(e.baseUrl, url.c_str(), sizeof(e.baseUrl));
        strlcpy(e.deviceKey, key.c_str(), sizeof(e.deviceKey));
        e.lastUsedEpoch = pref.getUInt(kTs, 0);
        ++count;
    }
    unlockPreferences();
    s_cloudHistoryCount = count;
}

static void cloudMusicSaveHistory() {
    if (!lockPreferences(pdMS_TO_TICKS(1000))) return;
    for (uint8_t i = 0; i < kCloudHistoryMax; ++i) {
        char kUrl[16], kKey[16], kTs[16];
        cloudMusicHistoryKey(i, 'u', kUrl, sizeof(kUrl));
        cloudMusicHistoryKey(i, 'k', kKey, sizeof(kKey));
        cloudMusicHistoryKey(i, 't', kTs, sizeof(kTs));
        if (i < s_cloudHistoryCount) {
            pref.putString(kUrl, s_cloudHistory[i].baseUrl);
            pref.putString(kKey, s_cloudHistory[i].deviceKey);
            pref.putUInt(kTs, s_cloudHistory[i].lastUsedEpoch);
        } else {
            pref.remove(kUrl);
            pref.remove(kKey);
            pref.remove(kTs);
        }
    }
    unlockPreferences();
}

// Insert/refresh a gateway config in the history: same baseUrl refreshes the
// key + timestamp and moves to the front; a new URL is prepended; keep at
// most kCloudHistoryMax entries.
static void cloudMusicHistoryUpsert(const char* baseUrl, const char* deviceKey) {
    const uint32_t now = static_cast<uint32_t>(time(nullptr));
    uint8_t existing = kCloudHistoryMax;
    for (uint8_t i = 0; i < s_cloudHistoryCount; ++i) {
        if (strcmp(s_cloudHistory[i].baseUrl, baseUrl) == 0) { existing = i; break; }
    }
    if (existing == kCloudHistoryMax) {
        // Shift slots down to make room at the front; when full, the oldest
        // (last) slot is dropped. Never write past kCloudHistoryMax-1.
        const uint8_t shiftFrom = (s_cloudHistoryCount < kCloudHistoryMax) ? s_cloudHistoryCount : kCloudHistoryMax - 1;
        for (uint8_t i = shiftFrom; i > 0; --i) s_cloudHistory[i] = s_cloudHistory[i - 1];
        if (s_cloudHistoryCount < kCloudHistoryMax) ++s_cloudHistoryCount;
    } else {
        const CloudMusicHistoryEntry tmp = s_cloudHistory[existing];
        for (uint8_t i = existing; i > 0; --i) s_cloudHistory[i] = s_cloudHistory[i - 1];
        s_cloudHistory[0] = tmp;
    }
    strlcpy(s_cloudHistory[0].baseUrl, baseUrl, sizeof(s_cloudHistory[0].baseUrl));
    strlcpy(s_cloudHistory[0].deviceKey, deviceKey, sizeof(s_cloudHistory[0].deviceKey));
    s_cloudHistory[0].lastUsedEpoch = now;
    cloudMusicSaveHistory();
}

