pullead/esp32-hifi/src/main.cpp
uint8_t playerCoreCloudMusicHistoryCount() { return s_cloudHistoryCount; }

bool playerCoreCloudMusicHistoryEntry(uint8_t index, CloudMusicHistoryEntry* out) {
    if (!out || index >= s_cloudHistoryCount) return false;
    *out = s_cloudHistory[index];
    return true;
}

bool playerCoreCloudMusicHistoryDelete(uint8_t index) {
    if (index >= s_cloudHistoryCount) return false;
    for (uint8_t i = index; i + 1 < s_cloudHistoryCount; ++i) s_cloudHistory[i] = s_cloudHistory[i + 1];
    --s_cloudHistoryCount;
    cloudMusicSaveHistory();
    return true;
}

// Trims whitespace and a trailing slash, requires an http(s) scheme and
// both fields non-empty -- rejecting an obviously-broken config here (rather
// than saving it and letting the first health check fail) means the
// settings UI can tell "you typed something wrong" apart from "the gateway
// is unreachable".
bool playerCoreSetCloudMusicConfig(const char* baseUrl, const char* deviceKey) {
    if (!baseUrl || !deviceKey) return false;
    String trimmedUrl(baseUrl);
    trimmedUrl.trim();
    while (trimmedUrl.endsWith("/")) trimmedUrl.remove(trimmedUrl.length() - 1);
    String trimmedKey(deviceKey);
    trimmedKey.trim();
    if (trimmedUrl.isEmpty() || trimmedKey.isEmpty()) return false;
    // Normalize to https://: Render only serves https (plain http is a 301
    // stub), and our HTTP clients (WiFiClientSecure) can't ride an
    // http->https redirect. Also covers typing the bare hostname.
    if (trimmedUrl.startsWith("http://")) {
        trimmedUrl.replace("http://", "https://");
    } else if (!trimmedUrl.startsWith("https://")) {
        trimmedUrl = "https://" + trimmedUrl;
    }
    if (trimmedUrl.length() >= sizeof(CloudMusicConfig::baseUrl)) return false;
    if (trimmedKey.length() >= sizeof(CloudMusicConfig::deviceKey)) return false;

    if (lockPreferences(pdMS_TO_TICKS(1000))) {
        pref.putString(kCloudBaseUrlPrefKey, trimmedUrl);
        pref.putString(kCloudDeviceKeyPrefKey, trimmedKey);
        unlockPreferences();
    }
    if (cloudMusicLock(pdMS_TO_TICKS(1000))) {
        strlcpy(s_cloudConfig.baseUrl, trimmedUrl.c_str(), sizeof(s_cloudConfig.baseUrl));
        strlcpy(s_cloudConfig.deviceKey, trimmedKey.c_str(), sizeof(s_cloudConfig.deviceKey));
        s_cloudConfig.configured = true;
        cloudMusicUnlock();
    }
    s_cloudServiceState = CloudServiceState::Unknown; // old Ready/Offline no longer describes this config
    cloudMusicHistoryUpsert(trimmedUrl.c_str(), trimmedKey.c_str()); // remember this gateway for the future
    return true;
}

uint8_t playerCoreCloudServiceState() { return static_cast<uint8_t>(s_cloudServiceState); }

// One health-check attempt: GET {baseUrl}/esp/v1/health with the device key
// header, 3s timeout (spec 8.2: "2~3秒超时"). Checks for a real
// {"ok":true,...} body, not just HTTP 200 -- a captive portal or a
// still-cold-starting Render placeholder response could return 200 with the
// wrong body. No JSON library in this project (see jsonNumber/
// jsonStringField's own comments) and "ok" is a bare JSON boolean, not a
// number or string, so this checks for the literal the gateway always emits
// rather than adding a one-off jsonBool() helper.
static bool cloudMusicHealthCheckOnce(const CloudMusicConfig& cfg) {
    if (!WiFi.isConnected() || !cfg.configured) return false;
    WiFiClientSecure client;
    client.setInsecure(); // matches this project's existing HTTPS convention (weather/radio-icon fetches)
    HTTPClient http;
    const String url = String(cfg.baseUrl) + "/esp/v1/health";
    if (!http.begin(client, url)) return false;
    http.setTimeout(10000); // Render cold start can take a while
    http.addHeader("X-Device-Key", cfg.deviceKey);
    const int code = http.GET();
    bool ok = false;
    if (code == HTTP_CODE_OK) {
        const String body = http.getString();
        ok = body.indexOf("\"ok\":true") >= 0 || body.indexOf("\"ok\": true") >= 0;
    }
    http.end();
    return ok;
}

// Second wake stage: the gateway being up doesn't mean the upstream
// api-enhanced is -- Render's free tier sleeps BOTH services, and a browse
// against a still-cold upstream returns HTTP 502 in <1s (Render's
// cold-start proxy answer), so the device's retry window can't wait it out.
// The gateway's /esp/v1/wake blocks until the upstream genuinely answers
// (up to ~90s), so this call is what actually turns "已连接" into "browse
// will work". HTTP timeout must exceed the gateway's own wake timeout.
static bool cloudMusicWakeUpstreamOnce(const CloudMusicConfig& cfg) {
    if (!WiFi.isConnected() || !cfg.configured) return false;
    WiFiClientSecure client;
    client.setInsecure();
    HTTPClient http;
    const String url = String(cfg.baseUrl) + "/esp/v1/wake";
    if (!http.begin(client, url)) return false;
    http.setTimeout(95000); // longer than the gateway's 90s upstream-wake budget
    http.addHeader("X-Device-Key", cfg.deviceKey);
    const int code = http.GET();
    bool ok = false;
    if (code == HTTP_CODE_OK) {
        const String body = http.getString();
        ok = body.indexOf("\"ok\":true") >= 0 || body.indexOf("\"ok\": true") >= 0;
    }
    http.end();
    return ok;
}

// Cold-start wake sequence (spec 8.2): stage 1 is the gateway's own health
// (retry every 7s, ~70s budget); stage 2 warms the cold-sleeping upstream
// api-enhanced via /esp/v1/wake (up to ~190s total) so the first browse
// doesn't 502. Runs on its own one-shot task (mirrors
// radioIconSyncTask/wifiScanTask's pattern) so the LVGL thread never blocks
// on network I/O -- the UI polls playerCoreCloudServiceState() the same way
// it already polls UsbStorageState for USB MSC mount progress.
static void cloudMusicWakeTask(void*) {
    const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
    if (!cfg.configured) {
        s_cloudServiceState = CloudServiceState::Offline;
        s_cloudWakeTaskRunning = false;
        vTaskDelete(nullptr);
        return;
    }
    s_cloudServiceState = CloudServiceState::Waking;
    // Two-stage wake: up to ~70s for the gateway's own health, then up to
    // ~180s total for the upstream api-enhanced to come back from Render's
    // cold sleep (the /esp/v1/wake call itself blocks on the gateway).
    const uint32_t deadlineMs = millis() + 190000;
    bool ready = false;
    bool upstreamReady = false;
    for (;;) {
        ready = cloudMusicHealthCheckOnce(cfg);
        printf("[CLOUDMUSIC] health check %s\n", ready ? "ok" : "failed");
        if (ready || millis() >= deadlineMs) break;
        vTaskDelay(pdMS_TO_TICKS(7000));
    }
    if (ready) {
        // Gateway is up -- now warm the sleeping upstream so the first
        // browse/resolve doesn't 502. Retry until it answers or the
        // deadline passes (the gateway itself retries upstream internally
        // for up to 90s per call, so a few attempts cover Render's worst
        // cold-start).
        while (!upstreamReady && millis() < deadlineMs) {
            upstreamReady = cloudMusicWakeUpstreamOnce(cfg);
            printf("[CLOUDMUSIC] upstream warm %s\n", upstreamReady ? "ok" : "failed");
            if (!upstreamReady) vTaskDelay(pdMS_TO_TICKS(5000));
        }
    }
    s_cloudServiceState = (ready && upstreamReady) ? CloudServiceState::Ready : CloudServiceState::Offline;
    if (ready && upstreamReady) s_cloudLastReadyMs = millis();
    s_cloudWakeTaskRunning = false;
    vTaskDelete(nullptr);
}

// Entry point: called when the user opens 在线音乐 settings/home (spec 8.2:
// "进入'在线音乐' -> 请求 /health"). No-op while a wake is already in
// flight; safe to call repeatedly (e.g. re-entering the page).
//
// 如果服务最近已经确认过 Ready，这里也直接跳过：buildCloudMusicHome() 每次
// 进页面都会无条件调这个函数（不只是第一次进），没有这个判断的话，每次进
// 页面都会重新做一次 WiFiClientSecure/mbedTLS 的健康检查握手——这个任务没
// 绑核，会跟 LVGL 渲染任务抢 CPU，正好对应"进在线音乐时UI有点卡"这个真实
// 反馈。5 分钟这个窗口比 Render 免费版约 15 分钟的休眠阈值短很多，所以不会
// 重新引入两段式唤醒机制本来要解决的"双重冷启动 502"问题——真正冷启动的
//情况还是会走完整的唤醒流程。
static constexpr uint32_t kCloudReadySkipWindowMs = 5UL * 60UL * 1000UL;

void playerCoreCloudMusicWakeStart() {
    if (s_cloudWakeTaskRunning) return;
    if (s_cloudServiceState == CloudServiceState::Ready && (millis() - s_cloudLastReadyMs) < kCloudReadySkipWindowMs) return;
    const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
    if (!cfg.configured) {
        s_cloudServiceState = CloudServiceState::Offline;
        return;
    }
    s_cloudWakeTaskRunning = true;
    // 8K was the value that worked before (health checks succeeded), and
    // every kilobyte of task stack is internal heap that mbedTLS needs for
    // its handshake buffers -- the "唤醒不了" bug was heap exhaustion, so
    // stack stays at the proven size rather than being bumped speculatively.
    if (xTaskCreatePinnedToCore(cloudMusicWakeTask, "cloudWake", 8192, nullptr, 1, nullptr, 0) != pdPASS) {
        s_cloudWakeTaskRunning = false;
        s_cloudServiceState = CloudServiceState::Offline;
        MWR_LOG_ERROR("Failed to create cloud music wake task");
    }
}

// Periodic keep-alive: Render's free tier spins BOTH services (the gateway
// and the upstream api-enhanced) down after ~15 min of inactivity, which is
// what made browsing 502 after idle. Every 9 min the board health-checks
// the gateway AND warms the upstream via /esp/v1/wake, so both stay awake
// while the device is powered on -- the first 在线音乐 visit after a long
// idle no longer waits through a double cold start. The wake call is fast
// (<1s) when services are already warm; the retries here only bite during
// a genuine cold start.
static void cloudKeepaliveTask(void*) {
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(9 * 60 * 1000));
        const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
        if (!cfg.configured || !WiFi.isConnected()) continue;
        for (uint8_t attempt = 0; attempt < 3; ++attempt) {
            if (!cloudMusicHealthCheckOnce(cfg)) {
                vTaskDelay(pdMS_TO_TICKS(20000));
                continue;
            }
            if (cloudMusicWakeUpstreamOnce(cfg)) break;
            vTaskDelay(pdMS_TO_TICKS(20000));
        }
    }
}

// ---- Cloud Music phase 3: search / hot playlists / playlist detail ------
// Browse-only, per the project's phased NCM spec -- no playback wiring
// (that's phase 4). One background controller task processes one command
// at a time (mirrors lyricsFetchTask's queue+task shape); each *Start()
// bumps s_cloudRequestGeneration and stamps its command with the new value,
// and a finishing command only writes its result into the shared arrays if
// that generation is still current -- otherwise a newer request has since
// superseded it and the stale result is silently dropped (same idea as
// lyricsFetchTask checking s_lyricTrackIndex before applying a result, one
// generation counter shared across all three lookup kinds since only one of
// them is ever visible on screen at a time in this UI).

static constexpr uint8_t kCloudSearchMaxResults = 10;
static constexpr uint8_t kCloudHotPlaylistMax = 8;
static constexpr uint8_t kCloudPlaylistTrackMax = 20;
// Sized to fit the 320x170 screen's scrollable list comfortably while
// keeping the static arrays' internal-RAM footprint as small as possible --
// TLS handshakes need ~40KB of contiguous heap, and every kilobyte of
// static array counts on this device.
static constexpr uint8_t kCloudRankingMax = 8;
static constexpr uint8_t kCloudNewSongMax = 12;

enum class CloudCommandType : uint8_t { Search, LoadHotPlaylists, LoadPlaylist, LoadRankings, LoadNewSongs, ResolveAndPlay };
struct CloudCommand {
    CloudCommandType type;
    uint32_t generation;
    char param[128]; // search query, or playlist id
};

static QueueHandle_t s_cloudCommandQueue = nullptr;
static SemaphoreHandle_t s_cloudResultMutex = nullptr;
static volatile uint32_t s_cloudRequestGeneration = 0;
static char s_cloudLastError[96] = "";

static CloudMusicRequestState s_cloudSearchState = CloudMusicRequestState::Idle;
// PSRAM-backed result arrays (allocated in setup()): internal RAM is the
// constraint for TLS handshakes (~40KB contiguous heap), so the bulk
// cloud-music lists live in PSRAM -- same reasoning as the audio library's
// big input buffer. All access goes through the result mutex, unchanged.
static CloudTrackItem* s_cloudSearchResults = nullptr;
static uint8_t s_cloudSearchResultCount = 0;
static bool s_cloudSearchHasMore = false;

static CloudMusicRequestState s_cloudHotState = CloudMusicRequestState::Idle;
static CloudPlaylistItem* s_cloudHotPlaylists = nullptr;
static uint8_t s_cloudHotPlaylistCount = 0;

static CloudMusicRequestState s_cloudPlaylistState = CloudMusicRequestState::Idle;
static CloudPlaylistItem s_cloudPlaylistInfo;
static CloudTrackItem* s_cloudPlaylistTracks = nullptr;
static uint8_t s_cloudPlaylistTrackCount = 0;

// Phase 5: ranking charts + new-song arrivals (see buildCloudRankings()/
// buildCloudNewSongs() in the UI). Separate arrays/states, same
// single-request-at-a-time discipline as the phase-3 lookups.
static CloudMusicRequestState s_cloudRankingState = CloudMusicRequestState::Idle;
static CloudRankingItem* s_cloudRankings = nullptr;
static uint8_t s_cloudRankingCount = 0;

