pullead/esp32-hifi/src/main.cpp
static CloudMusicRequestState s_cloudNewSongState = CloudMusicRequestState::Idle;
static CloudTrackItem* s_cloudNewSongs = nullptr;
static uint8_t s_cloudNewSongCount = 0;

// Phase 4: resolve + play. s_cloudResolveState is polled by the UI (a
// track row's tap feedback); the actual connecttohost() happens on
// cloudMusicControllerTask itself once resolve succeeds (background tasks
// already do this elsewhere in this codebase -- e.g. usbStorageMountTask
// calls stopSong() -- so this isn't a new pattern), not routed back through
// the LVGL thread first.
static CloudMusicRequestState s_cloudResolveState = CloudMusicRequestState::Idle;
// Title/artist/album/cover for whatever cloud track is currently playing --
// set once resolve succeeds, read by PlayerService::tick() to fill
// PlayerSnapshot's title/detail/durationSeconds fields for CloudMusic
// (there's no ICY metadata on a plain CDN file URL to wait for, unlike
// internet radio).
static CloudTrackItem s_cloudNowPlaying;
// One-shot "playback just started" latch consumed by the LVGL refresh loop:
// lets the UI jump to the Now Playing page the moment a resolved track
// actually starts, instead of leaving the user staring at the list with no
// visible feedback (which reads as "播放不了" even when audio is playing).
static volatile bool s_cloudPlaybackJustStarted = false;

static bool cloudResultLock(TickType_t timeout = pdMS_TO_TICKS(250)) {
    return !s_cloudResultMutex || xSemaphoreTake(s_cloudResultMutex, timeout) == pdTRUE;
}
static void cloudResultUnlock() {
    if (s_cloudResultMutex) xSemaphoreGive(s_cloudResultMutex);
}

// Finds "key":[ ... ] in body and returns up to maxItems top-level {...}
// object slices from inside it (raw JSON text per item, for
// jsonStringField()/jsonNumber() to run on directly). Same hand-scan
// approach as jsonStringField (no JSON library in this project), extended
// to walk balanced brace depth -- respecting quoted strings and \" escapes
// so a brace or comma inside a title/name string doesn't desync it.
static uint8_t jsonArrayItems(const String& body, const char* key, String* outItems, uint8_t maxItems) {
    const String needle = String("\"") + key + "\":[";
    const int start = body.indexOf(needle);
    if (start < 0) return 0;
    int pos = start + static_cast<int>(needle.length());
    const int len = static_cast<int>(body.length());
    uint8_t count = 0;
    while (count < maxItems && pos < len) {
        while (pos < len && (isspace(static_cast<unsigned char>(body[pos])) || body[pos] == ',')) ++pos;
        if (pos >= len || body[pos] == ']') break;
        if (body[pos] != '{') break; // malformed / not an object array -- stop rather than misparse
        const int objStart = pos;
        int depth = 0;
        bool inString = false;
        for (; pos < len; ++pos) {
            const char c = body[pos];
            if (inString) {
                if (c == '\\') { ++pos; continue; } // loop's own ++pos advances past the escaped char too
                if (c == '"') inString = false;
                continue;
            }
            if (c == '"') { inString = true; continue; }
            if (c == '{') ++depth;
            else if (c == '}') {
                --depth;
                if (depth == 0) { ++pos; break; }
            }
        }
        outItems[count++] = body.substring(objStart, pos);
    }
    return count;
}

// Strips characters the embedded CJK subset font (lv_font_cjk_13, ASCII +
// ~19k CJK/kana/symbols) cannot render -- most importantly non-BMP emoji
// (4-byte UTF-8) which would otherwise show as tofu boxes mixed into
// otherwise-fine Chinese text ("文字乱码"), plus stray control chars.
// Operates in place on a NUL-terminated UTF-8 buffer.
static void cloudTextSanitize(char* s) {
    char* w = s;
    const char* r = s;
    while (*r) {
        const uint8_t c = static_cast<uint8_t>(*r);
        if (c < 0x80) {
            if (c >= 0x20 && c != 0x7F) *w++ = *r;
            ++r;
        } else if (c < 0xE0) {
            *w++ = *r++;
        } else if (c < 0xF0) {
            *w++ = *r++;
            if (*r) *w++ = *r++;
            if (*r) *w++ = *r++;
        } else {
            r += 4; // non-BMP (emoji / rare chars) -- drop the whole sequence
        }
    }
    *w = '\0';
}

static void parseCloudTrackItem(const String& itemJson, CloudTrackItem* out) {
    *out = CloudTrackItem{};
    String s;
    if (jsonStringField(itemJson, "id", s)) strlcpy(out->id, s.c_str(), sizeof(out->id));
    if (jsonStringField(itemJson, "title", s)) strlcpy(out->title, s.c_str(), sizeof(out->title));
    if (jsonStringField(itemJson, "artist", s)) strlcpy(out->artist, s.c_str(), sizeof(out->artist));
    if (jsonStringField(itemJson, "album", s)) strlcpy(out->album, s.c_str(), sizeof(out->album));
    if (jsonStringField(itemJson, "cover_url", s)) strlcpy(out->coverUrl, s.c_str(), sizeof(out->coverUrl));
    double num = 0;
    if (jsonNumber(itemJson, "duration_ms", &num)) out->durationMs = static_cast<uint32_t>(num);
    out->playableHint = itemJson.indexOf("\"playable_hint\":false") < 0;
    out->vip = itemJson.indexOf("\"vip\":true") >= 0;
    out->paid = itemJson.indexOf("\"paid\":true") >= 0;
    cloudTextSanitize(out->title);
    cloudTextSanitize(out->artist);
    cloudTextSanitize(out->album);
}

static void parseCloudPlaylistItem(const String& itemJson, CloudPlaylistItem* out) {
    *out = CloudPlaylistItem{};
    String s;
    if (jsonStringField(itemJson, "id", s)) strlcpy(out->id, s.c_str(), sizeof(out->id));
    if (jsonStringField(itemJson, "name", s)) strlcpy(out->name, s.c_str(), sizeof(out->name));
    if (jsonStringField(itemJson, "creator", s)) strlcpy(out->creator, s.c_str(), sizeof(out->creator));
    if (jsonStringField(itemJson, "cover_url", s)) strlcpy(out->coverUrl, s.c_str(), sizeof(out->coverUrl));
    double num = 0;
    if (jsonNumber(itemJson, "track_count", &num)) out->trackCount = static_cast<uint16_t>(num);
    cloudTextSanitize(out->name);
    cloudTextSanitize(out->creator);
}

