pullead/esp32-hifi/src/main.cpp
static void parseCloudRankingItem(const String& itemJson, CloudRankingItem* out) {
    *out = CloudRankingItem{};
    String s;
    if (jsonStringField(itemJson, "id", s)) strlcpy(out->id, s.c_str(), sizeof(out->id));
    if (jsonStringField(itemJson, "name", s)) strlcpy(out->name, s.c_str(), sizeof(out->name));
    if (jsonStringField(itemJson, "cover_url", s)) strlcpy(out->coverUrl, s.c_str(), sizeof(out->coverUrl));
    if (jsonStringField(itemJson, "update_freq", s)) strlcpy(out->updateFreq, s.c_str(), sizeof(out->updateFreq));
    cloudTextSanitize(out->name);
}

// One GET against the configured gateway, with the device key header and
// this project's existing HTTPS posture (setInsecure(), see
// cloudMusicHealthCheckOnce's comment). On a gateway error response
// ({"ok":false,"error":{...}}), fills s_cloudLastError from the "message"
// field so callers don't need to re-parse the error envelope themselves.
static bool cloudMusicHttpGet(const String& path, String& outBody) {
    const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
    if (!WiFi.isConnected()) {
        strlcpy(s_cloudLastError, "WiFi 未连接", sizeof(s_cloudLastError));
        return false;
    }
    if (!cfg.configured) {
        strlcpy(s_cloudLastError, "未配置在线音乐网关", sizeof(s_cloudLastError));
        return false;
    }
    WiFiClientSecure client;
    client.setInsecure(); // matches this project's HTTPS convention (weather/health)
    HTTPClient http;
    const String url = String(cfg.baseUrl) + path;
    // Explicit TLS client: configs are normalized to https:// (see
    // playerCoreCloudMusicConfig), so a secure client is always correct.
    // setFollowRedirects stays as harmless safety for https->https
    // redirects.
    if (!http.begin(client, url)) {
        strlcpy(s_cloudLastError, "无法连接网关", sizeof(s_cloudLastError));
        return false;
    }
    http.setTimeout(10000);
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.addHeader("X-Device-Key", cfg.deviceKey);
    const int code = http.GET();
    if (code <= 0) {
        http.end();
        strlcpy(s_cloudLastError, "网络请求失败", sizeof(s_cloudLastError));
        return false;
    }
    outBody = http.getString();
    http.end();
    const bool ok = outBody.indexOf("\"ok\":true") >= 0 || outBody.indexOf("\"ok\": true") >= 0;
    if (!ok) {
        String message;
        if (!jsonStringField(outBody, "message", message) || message.isEmpty()) message = "请求失败";
        strlcpy(s_cloudLastError, message.c_str(), sizeof(s_cloudLastError));
        return false;
    }
    return true;
}

// Render's free tier sleeps the upstream api-enhanced service after idle
// and takes up to ~50s to wake it; during that window Render answers with
// HTTP 502. Retry transient failures with a 7s pause (same spirit as
// cloudMusicWakeTask) so the first browse/resolve request after a sleep
// succeeds instead of erroring out instantly. Stops early if a newer
// command superseded us while we were waiting.
static constexpr uint8_t kCloudBrowseRetryMax = 8;
static constexpr uint32_t kCloudBrowseRetryDelayMs = 7000;

static bool cloudMusicHttpGetWithRetry(const String& path, String& outBody, const uint32_t& generation) {
    for (uint8_t attempt = 0; attempt < kCloudBrowseRetryMax; ++attempt) {
        if (generation != s_cloudRequestGeneration) return false; // user moved on
        if (cloudMusicHttpGet(path, outBody)) return true;
        if (attempt + 1 < kCloudBrowseRetryMax) vTaskDelay(pdMS_TO_TICKS(kCloudBrowseRetryDelayMs));
    }
    return false;
}

// ---- Cloud music connectivity diagnostic ---------------------------------
// Served as /cloud_diag_start + /cloud_diag_json on the device web server:
// replicates the exact wake/browse failure path (DNS resolve -> plain TCP
// to :443 -> full TLS health check) on a generously-stacked background
// task and reports which stage fails, so a "唤醒不了/连接不上" report can be
// attributed to DNS vs firewall vs TLS/heap instead of guessing. The
// result is stored in a static buffer that /cloud_diag_json returns once
// s_cloudDiagReady flips.
static char s_cloudDiagResult[512] = "";
static volatile bool s_cloudDiagReady = false;
static volatile bool s_cloudDiagRunning = false;

// Writes a partial result immediately so /cloud_diag_json shows progress
// even if a stage hangs. Heap is reported first -- TLS memory pressure was
// the actual root cause of "唤醒不了" (free internal heap had dropped to
// ~13KB; mbedTLS needs ~40KB on top of the task stack).
static void cloudDiagReport(const char* stage, const char* extraJson) {
    String out = "{\"ready\":false,\"stage\":\"";
    out += stage;
    out += "\",\"heap\":";
    out += String(ESP.getFreeHeap());
    if (extraJson && extraJson[0]) out += extraJson;
    out += "}";
    strlcpy(s_cloudDiagResult, out.c_str(), sizeof(s_cloudDiagResult));
}

static void cloudDiagTask(void*) {
    String out = "{";
    const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
    const bool wifiOk = WiFi.status() == WL_CONNECTED;
    cloudDiagReport("start", wifiOk ? ",\"wifi\":true" : ",\"wifi\":false");
    out += "\"wifi\":";
    out += wifiOk ? "true" : "false";
    out += ",\"ssid\":\"";
    out += wifiOk ? WiFi.SSID().c_str() : "";
    out += "\",\"rssi\":";
    out += String(wifiOk ? static_cast<int>(WiFi.RSSI()) : 0);
    out += ",\"heap\":";
    out += String(ESP.getFreeHeap());
    out += ",\"psram\":";
    out += String(ESP.getFreePsram());

    String host = cfg.baseUrl;
    if (host.startsWith("https://")) host = host.substring(8);
    else if (host.startsWith("http://")) host = host.substring(7);
    const int slash = host.indexOf('/');
    if (slash >= 0) host = host.substring(0, slash);
    cloudDiagReport("dns", "");

    IPAddress resolved;
    const bool dnsOk = WiFi.hostByName(host.c_str(), resolved);
    out += ",\"dns_ok\":";
    out += dnsOk ? "true" : "false";
    if (dnsOk) {
        out += ",\"resolved\":\"";
        out += resolved.toString();
        out += "\"";
    }
    cloudDiagReport("tcp", "");

    WiFiClient tcp;
    const bool tcpOk = dnsOk && tcp.connect(resolved, 443);
    out += ",\"tcp443\":";
    out += tcpOk ? "true" : "false";
    if (tcp) tcp.stop();
    cloudDiagReport("health", "");

    String body;
    const bool healthOk = cloudMusicHttpGet("/esp/v1/health", body);
    out += ",\"health_ok\":";
    out += healthOk ? "true" : "false";
    out += ",\"error\":\"";
    // Gateway error messages are plain Chinese/ASCII text -- no quotes or
    // backslashes in practice; escape defensively anyway.
    const char* err = s_cloudLastError;
    for (const char* p = err; *p; ++p) {
        if (*p == '"' || *p == '\\') out += '\\';
        out += *p;
    }
    out += "\"}";

