pullead/esp32-hifi/src/main.cpp
    strlcpy(s_cloudDiagResult, out.c_str(), sizeof(s_cloudDiagResult));
    s_cloudDiagReady = true;
    s_cloudDiagRunning = false;
    vTaskDelete(nullptr);
}

void playerCoreCloudDiagStart() {
    if (s_cloudDiagRunning) return;
    s_cloudDiagRunning = true;
    s_cloudDiagReady = false;
    s_cloudDiagResult[0] = '\0';
    // 16K covers DNS+TCP+TLS here (TLS heap buffers are separate from this
    // task's stack); the earlier 24K version was one more big heap consumer
    // on an already tight device.
    if (xTaskCreatePinnedToCore(cloudDiagTask, "cloudDiag", 16384, nullptr, 1, nullptr, 0) != pdPASS) {
        s_cloudDiagRunning = false;
        MWR_LOG_ERROR("Failed to create cloud diag task");
    }
}

bool playerCoreCloudDiagReady() { return s_cloudDiagReady; }

const char* playerCoreCloudDiagResult() { return s_cloudDiagResult; }

static void cloudMusicControllerTask(void*) {
    CloudCommand cmd;
    for (;;) {
        if (xQueueReceive(s_cloudCommandQueue, &cmd, portMAX_DELAY) != pdTRUE) continue;

        if (cmd.type == CloudCommandType::Search) {
            if (cloudResultLock()) {
                s_cloudSearchState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            if (!s_cloudSearchResults) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudSearchState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            String query;
            urlEncodeAppend(query, cmd.param);
            char path[192];
            snprintf(path, sizeof(path), "/esp/v1/search?q=%s&limit=%u", query.c_str(), kCloudSearchMaxResults);
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue; // superseded while the request was in flight
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (ok) {
                    String items[kCloudSearchMaxResults];
                    const uint8_t n = jsonArrayItems(body, "items", items, kCloudSearchMaxResults);
                    for (uint8_t i = 0; i < n; ++i) parseCloudTrackItem(items[i], &s_cloudSearchResults[i]);
                    s_cloudSearchResultCount = n;
                    s_cloudSearchHasMore = body.indexOf("\"has_more\":true") >= 0;
                    s_cloudSearchState = CloudMusicRequestState::Loaded;
                } else {
                    s_cloudSearchResultCount = 0;
                    s_cloudSearchState = CloudMusicRequestState::Error;
                }
                cloudResultUnlock();
            }
        } else if (cmd.type == CloudCommandType::LoadHotPlaylists) {
            if (cloudResultLock()) {
                s_cloudHotState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            if (!s_cloudHotPlaylists) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudHotState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            // Optional language-category tag ("华语"/"欧美"/"日语"...) --
            // passed through the command param (see the 语言分类 feature),
            // URL-encoded since the tags are non-ASCII.
            char path[192];
            if (cmd.param[0]) {
                String catEnc;
                urlEncodeAppend(catEnc, cmd.param);
                snprintf(path, sizeof(path), "/esp/v1/playlists/hot?limit=%u&cat=%s", kCloudHotPlaylistMax, catEnc.c_str());
            } else {
                snprintf(path, sizeof(path), "/esp/v1/playlists/hot?limit=%u", kCloudHotPlaylistMax);
            }
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue;
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (ok) {
                    String items[kCloudHotPlaylistMax];
                    const uint8_t n = jsonArrayItems(body, "items", items, kCloudHotPlaylistMax);
                    for (uint8_t i = 0; i < n; ++i) parseCloudPlaylistItem(items[i], &s_cloudHotPlaylists[i]);
                    s_cloudHotPlaylistCount = n;
                    s_cloudHotState = CloudMusicRequestState::Loaded;
                } else {
                    s_cloudHotPlaylistCount = 0;
                    s_cloudHotState = CloudMusicRequestState::Error;
                }
                cloudResultUnlock();
            }
        } else if (cmd.type == CloudCommandType::LoadPlaylist) {
            if (cloudResultLock()) {
                s_cloudPlaylistState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            if (!s_cloudPlaylistTracks) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudPlaylistState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            char path[160];
            snprintf(path, sizeof(path), "/esp/v1/playlists/%s?limit=%u", cmd.param, kCloudPlaylistTrackMax);
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue;
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (ok) {
                    // "playlist" is a single object, not an array -- jsonStringField/
                    // jsonNumber already find the first (only) match directly.
                    parseCloudPlaylistItem(body, &s_cloudPlaylistInfo);
                    String items[kCloudPlaylistTrackMax];
                    const uint8_t n = jsonArrayItems(body, "tracks", items, kCloudPlaylistTrackMax);
                    for (uint8_t i = 0; i < n; ++i) parseCloudTrackItem(items[i], &s_cloudPlaylistTracks[i]);
                    s_cloudPlaylistTrackCount = n;
                    s_cloudPlaylistState = CloudMusicRequestState::Loaded;
                } else {
                    s_cloudPlaylistTrackCount = 0;
                    s_cloudPlaylistState = CloudMusicRequestState::Error;
                }
                cloudResultUnlock();
            }
        } else if (cmd.type == CloudCommandType::LoadRankings) {
            if (cloudResultLock()) {
                s_cloudRankingState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            if (!s_cloudRankings) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudRankingState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            char path[64];
            snprintf(path, sizeof(path), "/esp/v1/rankings?limit=%u", kCloudRankingMax);
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue;
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (ok) {
                    String items[kCloudRankingMax];
                    const uint8_t n = jsonArrayItems(body, "items", items, kCloudRankingMax);
                    for (uint8_t i = 0; i < n; ++i) parseCloudRankingItem(items[i], &s_cloudRankings[i]);
                    s_cloudRankingCount = n;
                    s_cloudRankingState = CloudMusicRequestState::Loaded;
                } else {
                    s_cloudRankingCount = 0;
                    s_cloudRankingState = CloudMusicRequestState::Error;
                }
                cloudResultUnlock();
            }
        } else if (cmd.type == CloudCommandType::LoadNewSongs) {
            if (cloudResultLock()) {
                s_cloudNewSongState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            if (!s_cloudNewSongs) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudNewSongState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            char path[64];
            snprintf(path, sizeof(path), "/esp/v1/new-songs?limit=%u", kCloudNewSongMax);
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue;
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (ok) {
                    String items[kCloudNewSongMax];
                    const uint8_t n = jsonArrayItems(body, "items", items, kCloudNewSongMax);
                    for (uint8_t i = 0; i < n; ++i) parseCloudTrackItem(items[i], &s_cloudNewSongs[i]);
                    s_cloudNewSongCount = n;
                    s_cloudNewSongState = CloudMusicRequestState::Loaded;
                } else {
                    s_cloudNewSongCount = 0;
                    s_cloudNewSongState = CloudMusicRequestState::Error;
                }
                cloudResultUnlock();
            }
        } else { // ResolveAndPlay
            if (cloudResultLock()) {
                s_cloudResolveState = CloudMusicRequestState::Loading;
                cloudResultUnlock();
            }
            char path[64];
            snprintf(path, sizeof(path), "/esp/v1/tracks/%s/resolve?bitrate=128", cmd.param);
            String body;
            const bool ok = cloudMusicHttpGetWithRetry(path, body, cmd.generation);
            if (cmd.generation != s_cloudRequestGeneration) continue; // user moved on to a different track before this resolved
            if (!ok) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudResolveState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            // "track" and "stream" objects have no overlapping key names
            // (id/title/artist/album/duration_ms/cover_url vs
            // url/codec/bitrate_kbps/expires_at/seekable_hint), so these can
            // read straight off the whole response body without slicing out
            // either sub-object first.
            CloudTrackItem track{};
            parseCloudTrackItem(body, &track);
            String streamUrl;
            const bool hasUrl = jsonStringField(body, "url", streamUrl) && streamUrl.length() > 0;
            if (!hasUrl) {
                if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                    s_cloudResolveState = CloudMusicRequestState::Error;
                    cloudResultUnlock();
                }
                continue;
            }
            // Actually start playback right here on this background task --
            // connecttohost() is already called from non-LVGL tasks
            // elsewhere in this codebase (e.g. usbStorageMountTask's
            // stopSong()), so this isn't a new concurrency pattern. Re-check
            // the generation once more right before committing to the
            // switch, in case the user tapped a different track during the
            // parsing above (unlikely given how fast it is, but cheap to
            // guard).
            if (cmd.generation != s_cloudRequestGeneration) continue;
            const bool started = playerCorePlayCloudUrl(streamUrl.c_str());
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                if (started) {
                    s_cloudNowPlaying = track;
                    s_cloudResolveState = CloudMusicRequestState::Loaded;
                    s_cloudPlaybackJustStarted = true;
                } else {
                    s_cloudResolveState = CloudMusicRequestState::Error;
                    strlcpy(s_cloudLastError, "无法连接音乐 CDN", sizeof(s_cloudLastError));
                }
                cloudResultUnlock();
            }
        }
    }
}

static bool cloudMusicEnqueue(CloudCommandType type, const char* param) {
    if (!s_cloudCommandQueue) return false;
    CloudCommand cmd{};
    cmd.type = type;
    cmd.generation = ++s_cloudRequestGeneration;
    if (param) strlcpy(cmd.param, param, sizeof(cmd.param));
    // Queue depth 1 (see its xQueueCreate call in setup()): a command still
    // waiting to be picked up gets overwritten by a newer one of any kind,
    // same as lyricsFetchTask's single-slot queue. A command already being
    // processed can't be aborted mid-HTTP-request, but its result is
    // discarded on completion once cmd.generation no longer matches (see
    // cloudMusicControllerTask).
    return xQueueOverwrite(s_cloudCommandQueue, &cmd) == pdTRUE;
}

