pullead/esp32-hifi/src/main.cpp
bool playerCoreCloudMusicSearchStart(const char* query) {
    if (!query || !query[0]) return false;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudSearchResultCount = 0;
        s_cloudSearchState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    return cloudMusicEnqueue(CloudCommandType::Search, query);
}

uint8_t playerCoreCloudMusicSearchState() { return static_cast<uint8_t>(s_cloudSearchState); }

uint8_t playerCoreCloudMusicSearchResultCount() { return s_cloudSearchResultCount; }

bool playerCoreCloudMusicSearchResult(uint8_t index, CloudTrackItem* item) {
    if (!item || !s_cloudSearchResults || index >= s_cloudSearchResultCount) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *item = s_cloudSearchResults[index];
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

bool playerCoreCloudMusicSearchHasMore() { return s_cloudSearchHasMore; }

const char* playerCoreCloudMusicLastError() { return s_cloudLastError; }

void playerCoreCloudMusicHotPlaylistsStart(const char* cat) {
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudHotState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    cloudMusicEnqueue(CloudCommandType::LoadHotPlaylists, (cat && cat[0]) ? cat : nullptr);
}

uint8_t playerCoreCloudMusicHotPlaylistsState() { return static_cast<uint8_t>(s_cloudHotState); }

uint8_t playerCoreCloudMusicHotPlaylistCount() { return s_cloudHotPlaylistCount; }

bool playerCoreCloudMusicHotPlaylist(uint8_t index, CloudPlaylistItem* item) {
    if (!item || !s_cloudHotPlaylists || index >= s_cloudHotPlaylistCount) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *item = s_cloudHotPlaylists[index];
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

bool playerCoreCloudMusicPlaylistDetailStart(const char* playlistId) {
    if (!playlistId || !playlistId[0]) return false;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudPlaylistTrackCount = 0;
        s_cloudPlaylistState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    return cloudMusicEnqueue(CloudCommandType::LoadPlaylist, playlistId);
}

uint8_t playerCoreCloudMusicPlaylistDetailState() { return static_cast<uint8_t>(s_cloudPlaylistState); }

CloudPlaylistItem playerCoreCloudMusicPlaylistDetailInfo() {
    CloudPlaylistItem out;
    if (cloudResultLock()) {
        out = s_cloudPlaylistInfo;
        cloudResultUnlock();
    }
    return out;
}

uint8_t playerCoreCloudMusicPlaylistTrackCount() { return s_cloudPlaylistTrackCount; }

bool playerCoreCloudMusicPlaylistTrack(uint8_t index, CloudTrackItem* item) {
    if (!item || !s_cloudPlaylistTracks || index >= s_cloudPlaylistTrackCount) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *item = s_cloudPlaylistTracks[index];
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

void playerCoreCloudMusicRankingsStart() {
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudRankingState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    cloudMusicEnqueue(CloudCommandType::LoadRankings, nullptr);
}

uint8_t playerCoreCloudMusicRankingsState() { return static_cast<uint8_t>(s_cloudRankingState); }

uint8_t playerCoreCloudMusicRankingCount() { return s_cloudRankingCount; }

bool playerCoreCloudMusicRanking(uint8_t index, CloudRankingItem* item) {
    if (!item || !s_cloudRankings || index >= s_cloudRankingCount) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *item = s_cloudRankings[index];
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

void playerCoreCloudMusicNewSongsStart() {
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudNewSongState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    cloudMusicEnqueue(CloudCommandType::LoadNewSongs, nullptr);
}

uint8_t playerCoreCloudMusicNewSongsState() { return static_cast<uint8_t>(s_cloudNewSongState); }

uint8_t playerCoreCloudMusicNewSongCount() { return s_cloudNewSongCount; }

bool playerCoreCloudMusicNewSong(uint8_t index, CloudTrackItem* item) {
    if (!item || !s_cloudNewSongs || index >= s_cloudNewSongCount) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *item = s_cloudNewSongs[index];
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

// Phase 4: resolve + play a track by id (from a search result or playlist
// row). Enqueues CloudCommandType::ResolveAndPlay -- see
// cloudMusicControllerTask's own comment for why actual playback is kicked
// off from that background task rather than routed back through the LVGL
// thread.
bool playerCoreCloudMusicPlayTrackStart(const char* trackId) {
    if (!trackId || !trackId[0]) return false;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        s_cloudResolveState = CloudMusicRequestState::Loading;
        cloudResultUnlock();
    }
    return cloudMusicEnqueue(CloudCommandType::ResolveAndPlay, trackId);
}

uint8_t playerCoreCloudMusicResolveState() { return static_cast<uint8_t>(s_cloudResolveState); }

// Non-consuming copy of the last resolved cloud track (s_cloudNowPlaying
// persists after playerCoreCloudMusicConsumeNowPlaying() has reset the
// resolve state to Idle -- the title/artist/cover stay valid while the
// track keeps playing).
bool playerCoreCloudMusicNowPlayingTrack(CloudTrackItem* outTrack) {
    if (!outTrack) return false;
    bool ok = false;
    if (cloudResultLock()) {
        *outTrack = s_cloudNowPlaying;
        ok = true;
        cloudResultUnlock();
    }
    return ok;
}

// ---- Cloud cover thumbnails ----------------------------------------------
// Same SD-cache pattern as radio station logos: a background task downloads
// each cover to /cloudimg/ once; the UI decodes on demand. A zero-byte
// marker means "no cover available" (or the fetch failed) so a dead URL
// isn't retried on every page open -- same graceful-degradation rule as
// the radio icon marker.

