pullead/esp32-hifi/src/main.cpp
static bool s_cloudThumbSyncInProgress = false;

static void cloudThumbPath(uint8_t kind, uint8_t index, char* out, size_t outSize) {
    snprintf(out, outSize, "/cloudimg/%c_%u.jpg", kind == 0 ? 'p' : 'r', index);
}

static void cloudThumbDownloadOne(const String& url, const char* sdPath) {
    if (url.length() == 0 || httpDownloadToFileRetrying(url, sdPath, 128 * 1024)) {
        if (url.length() == 0) {
            // No cover at all -- leave a marker so we never try again.
            File marker = SD_MMC.open(sdPath, "w", true);
            if (marker) marker.close();
        }
        return;
    }
    File marker = SD_MMC.open(sdPath, "w", true);
    if (marker) marker.close();
}

struct CloudThumbJob {
    char url[200];
    uint8_t kind;
    uint8_t index;
};

static void cloudThumbSyncTask(void*) {
    if (!SD_MMC.exists("/cloudimg")) SD_MMC.mkdir("/cloudimg");
    // Snapshot the URLs to fetch under the mutex, then download WITHOUT
    // holding it -- holding it for the whole loop would stall the UI's
    // state polls for seconds at a time.
    CloudThumbJob jobs[kCloudHotPlaylistMax + kCloudRankingMax]{};
    uint8_t jobCount = 0;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        for (uint8_t i = 0; i < s_cloudHotPlaylistCount && jobCount < kCloudHotPlaylistMax; ++i) {
            strlcpy(jobs[jobCount].url, s_cloudHotPlaylists[i].coverUrl, sizeof(jobs[jobCount].url));
            jobs[jobCount].kind = 0;
            jobs[jobCount].index = i;
            ++jobCount;
        }
        for (uint8_t i = 0; i < s_cloudRankingCount && jobCount < kCloudHotPlaylistMax + kCloudRankingMax; ++i) {
            strlcpy(jobs[jobCount].url, s_cloudRankings[i].coverUrl, sizeof(jobs[jobCount].url));
            jobs[jobCount].kind = 1;
            jobs[jobCount].index = i;
            ++jobCount;
        }
        cloudResultUnlock();
    }
    for (uint8_t j = 0; j < jobCount; ++j) {
        char sdPath[48];
        cloudThumbPath(jobs[j].kind, jobs[j].index, sdPath, sizeof(sdPath));
        if (SD_MMC.exists(sdPath)) continue;
        if (!WiFi.isConnected()) break; // no point continuing a sync that can't reach the network
        cloudThumbDownloadOne(jobs[j].url, sdPath);
        vTaskDelay(pdMS_TO_TICKS(50)); // don't hammer the CDN back to back
    }
    s_cloudThumbSyncInProgress = false;
    vTaskDelete(nullptr);
}

void playerCoreCloudThumbSyncStart() {
    if (s_cloudThumbSyncInProgress) return;
    s_cloudThumbSyncInProgress = true;
    if (xTaskCreatePinnedToCore(cloudThumbSyncTask, "cloudThumb", 8192, nullptr, 1, nullptr, 0) != pdPASS) {
        s_cloudThumbSyncInProgress = false;
        MWR_LOG_ERROR("Failed to create cloud thumb sync task");
    }
}

bool playerCoreCloudThumbSyncInProgress() { return s_cloudThumbSyncInProgress; }

bool playerCoreCloudThumbDecode(uint8_t kind, uint8_t index, uint8_t scaleFactor, uint16_t** outPixels,
                                uint16_t* outWidth, uint16_t* outHeight) {
    *outPixels = nullptr;
    *outWidth = 0;
    *outHeight = 0;
    char sdPath[48];
    cloudThumbPath(kind, index, sdPath, sizeof(sdPath));
    File in = SD_MMC.open(sdPath, "r");
    if (!in) return false;
    const size_t len = in.size();
    if (len == 0) { // zero-byte marker -- "no cover", not an error
        in.close();
        return false;
    }
    uint8_t* data = static_cast<uint8_t*>(ps_malloc(len));
    if (!data) {
        in.close();
        return false;
    }
    const size_t readLen = in.read(data, len);
    in.close();
    if (readLen != len) {
        free(data);
        return false;
    }
    const bool ok = getTFT().decodeJpgFromMemory(data, len, scaleFactor, outPixels, outWidth, outHeight);
    free(data);
    return ok;
}

// Now-playing cover: one-shot fetch of the current cloud track's cover,
// cached as /cloudimg/np_<trackId>.jpg (keyed by track id so switching
// tracks never shows a stale cached cover). Missing/dead covers fall back
// to the UI's music-note tile.
static bool s_cloudNowPlayingCoverRequested = false;
// Fallback URL copied at start() time -- used when the track itself has no
// album art (the UI passes the cover of the playlist/ranking the track
// came from).
static char s_cloudNowPlayingCoverFallback[200] = "";

static void cloudNowPlayingCoverTask(void*) {
    if (!SD_MMC.exists("/cloudimg")) SD_MMC.mkdir("/cloudimg");
    CloudTrackItem track{};
    playerCoreCloudMusicNowPlayingTrack(&track);
    if (track.id[0]) {
        char sdPath[48];
        snprintf(sdPath, sizeof(sdPath), "/cloudimg/np_%s.jpg", track.id);
        const char* url = track.coverUrl[0] ? track.coverUrl : s_cloudNowPlayingCoverFallback;
        cloudThumbDownloadOne(url, sdPath);
    }
    s_cloudNowPlayingCoverRequested = false;
    vTaskDelete(nullptr);
}

void playerCoreCloudNowPlayingCoverStart(const char* fallbackUrl) {
    if (s_cloudNowPlayingCoverRequested) return;
    CloudTrackItem track{};
    if (!playerCoreCloudMusicNowPlayingTrack(&track) || !track.id[0]) return;
    strlcpy(s_cloudNowPlayingCoverFallback, fallbackUrl ? fallbackUrl : "", sizeof(s_cloudNowPlayingCoverFallback));
    char sdPath[48];
    snprintf(sdPath, sizeof(sdPath), "/cloudimg/np_%s.jpg", track.id);
    const char* url = track.coverUrl[0] ? track.coverUrl : s_cloudNowPlayingCoverFallback;
    if (SD_MMC.exists(sdPath) || !url[0]) {
        if (!url[0] && !SD_MMC.exists(sdPath)) {
            File marker = SD_MMC.open(sdPath, "w", true);
            if (marker) marker.close();
        }
        return; // already cached (or nothing to fetch) -- no task needed
    }
    s_cloudNowPlayingCoverRequested = true;
    if (xTaskCreatePinnedToCore(cloudNowPlayingCoverTask, "npCover", 8192, nullptr, 1, nullptr, 0) != pdPASS) {
        s_cloudNowPlayingCoverRequested = false;
        MWR_LOG_ERROR("Failed to create now-playing cover task");
    }
}

bool playerCoreCloudNowPlayingCoverDecode(uint8_t scaleFactor, uint16_t** outPixels, uint16_t* outWidth,
                                          uint16_t* outHeight) {
    *outPixels = nullptr;
    *outWidth = 0;
    *outHeight = 0;
    CloudTrackItem track{};
    if (!playerCoreCloudMusicNowPlayingTrack(&track) || !track.id[0]) return false;
    char sdPath[48];
    snprintf(sdPath, sizeof(sdPath), "/cloudimg/np_%s.jpg", track.id);
    File in = SD_MMC.open(sdPath, "r");
    if (!in) return false;
    const size_t len = in.size();
    if (len == 0) {
        in.close();
        return false;
    }
    uint8_t* data = static_cast<uint8_t*>(ps_malloc(len));
    if (!data) {
        in.close();
        return false;
    }
    const size_t readLen = in.read(data, len);
    in.close();
    if (readLen != len) {
        free(data);
        return false;
    }
    const bool ok = getTFT().decodeJpgFromMemory(data, len, scaleFactor, outPixels, outWidth, outHeight);
    free(data);
    return ok;
}

// ---- Cloud lyrics (网易云网络歌词) -----------------------------------------
// Fetched once per track from the gateway's /esp/v1/tracks/<id>/lyrics
// (upstream /lyric -> parsed LRC) and kept in PSRAM -- separate storage and
// state from the LOCAL player's lyrics (ID3 SYLT + lrclib.net), but the UI
// interaction is the same: currentLyricLine(positionMs) drives the detail
// row on the cloud now-playing page.
static constexpr uint16_t kCloudMaxLyricLines = 80;
struct CloudLyricLine {
    uint32_t ms = 0;
    char text[96]{};
};
static CloudLyricLine* s_cloudLyricLines = nullptr; // PSRAM, allocated in setup()
static uint16_t s_cloudLyricCount = 0;
static char s_cloudLyricTrackId[24] = "";
static uint8_t s_cloudLyricsState = 0; // CloudLyricsState
static uint32_t s_cloudLyricGeneration = 0;

static void cloudLyricsFetchTask(void* param) {
    const uint32_t generation = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(param));
    String trackId;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        trackId = s_cloudLyricTrackId;
        s_cloudLyricsState = static_cast<uint8_t>(CloudLyricsState::Loading);
        cloudResultUnlock();
    }
    if (!trackId.length() || !WiFi.isConnected()) {
        if (cloudResultLock(pdMS_TO_TICKS(1000))) {
            if (generation == s_cloudLyricGeneration) s_cloudLyricsState = static_cast<uint8_t>(CloudLyricsState::Error);
            cloudResultUnlock();
        }
        vTaskDelete(nullptr);
        return;
    }

    char path[80];
    snprintf(path, sizeof(path), "/esp/v1/tracks/%s/lyrics", trackId.c_str());
    String body;
    bool ok = false;
    // Small local retry loop -- cloudMusicHttpGetWithRetry is tied to the
    // browse command generation, which must not abort this fetch.
    for (uint8_t attempt = 0; attempt < 3 && !ok; ++attempt) {
        ok = cloudMusicHttpGet(path, body);
        if (!ok && attempt + 1 < 3) vTaskDelay(pdMS_TO_TICKS(3000));
    }

    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        if (generation != s_cloudLyricGeneration) {
            cloudResultUnlock();
            vTaskDelete(nullptr);
            return;
        }
        s_cloudLyricCount = 0;
        if (!ok) {
            s_cloudLyricsState = static_cast<uint8_t>(CloudLyricsState::Error);
        } else {
            String items[kCloudMaxLyricLines];
            const uint8_t n = jsonArrayItems(body, "synced", items, kCloudMaxLyricLines);
            if (s_cloudLyricLines && n) {
                for (uint8_t i = 0; i < n; ++i) {
                    double ms = 0;
                    String text;
                    if (jsonNumber(items[i], "time_ms", &ms) && jsonStringField(items[i], "text", text) && text.length()) {
                        s_cloudLyricLines[s_cloudLyricCount].ms = static_cast<uint32_t>(ms);
                        strlcpy(s_cloudLyricLines[s_cloudLyricCount].text, text.c_str(), sizeof(s_cloudLyricLines[0].text));
                        cloudTextSanitize(s_cloudLyricLines[s_cloudLyricCount].text);
                        ++s_cloudLyricCount;
                    }
                }
            }
            s_cloudLyricsState = static_cast<uint8_t>(s_cloudLyricCount ? CloudLyricsState::Loaded : CloudLyricsState::NotFound);
        }
        cloudResultUnlock();
    }
    vTaskDelete(nullptr);
}

void playerCoreCloudMusicLyricsStart(const char* trackId) {
    if (!trackId || !trackId[0]) return;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        if (strcmp(s_cloudLyricTrackId, trackId) == 0 && s_cloudLyricsState == static_cast<uint8_t>(CloudLyricsState::Loaded)) {
            cloudResultUnlock();
            return; // already have this track's lyrics
        }
        strlcpy(s_cloudLyricTrackId, trackId, sizeof(s_cloudLyricTrackId));
        s_cloudLyricsState = static_cast<uint8_t>(CloudLyricsState::Loading);
        const uint32_t generation = ++s_cloudLyricGeneration;
        cloudResultUnlock();
        if (xTaskCreatePinnedToCore(cloudLyricsFetchTask, "cloudLyr", 8192,
                        reinterpret_cast<void*>(static_cast<uintptr_t>(generation)), 1, nullptr, 0) != pdPASS) {
            if (cloudResultLock(pdMS_TO_TICKS(1000))) {
                s_cloudLyricsState = static_cast<uint8_t>(CloudLyricsState::Error);
                cloudResultUnlock();
            }
            MWR_LOG_ERROR("Failed to create cloud lyrics fetch task");
        }
    }
}

uint8_t playerCoreCloudMusicLyricsState() { return s_cloudLyricsState; }

bool playerCoreCloudMusicLyricsForTrack(const char* trackId) {
    if (!trackId || !trackId[0]) return false;
    bool ok = false;
    if (cloudResultLock()) {
        ok = s_cloudLyricsState == static_cast<uint8_t>(CloudLyricsState::Loaded) && strcmp(s_cloudLyricTrackId, trackId) == 0;
        cloudResultUnlock();
    }
    return ok;
}

const char* playerCoreCloudMusicCurrentLyricLine(uint32_t positionMs) {
    static char lineBuf[96];
    lineBuf[0] = '\0';
    if (cloudResultLock()) {
        if (s_cloudLyricLines && s_cloudLyricCount && s_cloudLyricsState == static_cast<uint8_t>(CloudLyricsState::Loaded)) {
            int32_t idx = -1;
            for (uint16_t i = 0; i < s_cloudLyricCount; ++i) {
                if (s_cloudLyricLines[i].ms <= positionMs) idx = i;
                else break;
            }
            if (idx >= 0) strlcpy(lineBuf, s_cloudLyricLines[idx].text, sizeof(lineBuf));
        }
        cloudResultUnlock();
    }
    return lineBuf;
}

// Consume-once (same idiom as playerCoreLyricsOnlineReady): true exactly
// once per successfully-started cloud track, after which PlayerService::
// tick() has applied *outTrack to the snapshot and this returns false again
// until the next resolve succeeds.
bool playerCoreCloudMusicConsumeNowPlaying(CloudTrackItem* outTrack) {
    if (!outTrack) return false;
    bool ready = false;
    if (cloudResultLock()) {
        if (s_cloudResolveState == CloudMusicRequestState::Loaded) {
            *outTrack = s_cloudNowPlaying;
            s_cloudResolveState = CloudMusicRequestState::Idle; // consumed
            ready = true;
        }
        cloudResultUnlock();
    }
    return ready;
}

bool playerCoreCloudMusicJustStarted() {
    // Read-modify-write under the same mutex the controller task uses when
    // setting the latch -- otherwise a cleared-false race could eat the
    // "jump to Now Playing" navigation for a track that just started.
    bool v = false;
    if (cloudResultLock(pdMS_TO_TICKS(1000))) {
        v = s_cloudPlaybackJustStarted;
        s_cloudPlaybackJustStarted = false;
        cloudResultUnlock();
    }
    return v;
}

// setAudioFilePosition() takes a byte offset, not seconds -- approximates a
// target byte from a linear time/size ratio (exact for CBR MP3, a close
// enough estimate for VBR, same tradeoff any simple player's seek bar
// makes without a full VBR seek table).
bool playerCoreSeekTo(uint32_t positionSeconds) {
    const uint32_t duration = audio.getAudioFileDuration();
    if (!duration) return false;
    const uint32_t dataStart = audio.getAudioDataStartOffset();
    const uint32_t fileSize = audio.getFileSize();
    if (fileSize <= dataStart) return false;
    const uint32_t dataSize = fileSize - dataStart;
    const uint32_t clampedSeconds = std::min(positionSeconds, duration);
    const uint32_t targetByte = dataStart + static_cast<uint32_t>((static_cast<uint64_t>(dataSize) * clampedSeconds) / duration);
    const bool ok = audio.setAudioFilePosition(targetByte);
    printf("[SEEK] to %us -> byte %u (dataStart=%u size=%u) ok=%d\n", positionSeconds, targetByte, dataStart, dataSize, ok);
    return ok;
}

void playerCoreReadSnapshot(PlayerSnapshot* snapshot) {
    if (!snapshot) return;

    snapshot->wifiConnected = WiFi.isConnected();
    snapshot->muted = s_f_mute;
    snapshot->volume = s_volume.cur_volume;
    snapshot->volumeSteps = s_volume.volumeSteps;
    {
        // getVUlevel() packs both channels into one uint16_t (low byte
        // left, high byte right) -- previously stored straight into a
        // uint8_t vuLevel, which silently truncated to the low byte and
        // threw the right channel away. Split explicitly now that the UI
        // wants both (see PlayerSnapshot::vuRight).
        const uint16_t vu = audio.getVUlevel();
        snapshot->vuLevel = static_cast<uint8_t>(vu & 0xFF);
        snapshot->vuRight = static_cast<uint8_t>((vu >> 8) & 0xFF);
    }
    audio.getSpectrumBands(snapshot->spectrumBands);
    snapshot->positionSeconds = audio.getAudioCurrentTime();
    snapshot->durationSeconds = audio.getAudioFileDuration();
    snapshot->source = s_f_isFSConnected
                            ? PlayerSource::Sd
                            : (s_f_isWebConnected ? (s_cloudMusicPlaying ? PlayerSource::CloudMusic : PlayerSource::Radio) : PlayerSource::None);

    if (s_f_webFailed) {
        snapshot->transport = PlayerTransport::Error;
    } else if (s_f_pauseResume) {
        snapshot->transport = PlayerTransport::Paused;
    } else if (audio.isRunning()) {
        snapshot->transport = PlayerTransport::Playing;
    } else if (s_f_isFSConnected || s_f_isWebConnected) {
        snapshot->transport = PlayerTransport::Buffering;
    } else {
        snapshot->transport = PlayerTransport::Stopped;
    }

    // getStationName()/s_streamTitle are radio-only (ICY station name /
    // stream title) but were being written into title/detail on every tick
    // regardless of source -- for local file playback this stomped the
    // real ID3 title/artist that PlayerService::playLocalTrack() had just
    // set, within one refresh cycle (~100ms), so the UI kept showing
    // whatever radio station had played most recently instead of the
    // actual local track. Local title/detail are instead only ever set
    // once, at play time, and left alone here.
    if (snapshot->source == PlayerSource::Radio) {
        ps_ptr<char> station = getStationName();
        strlcpy(snapshot->title, station.c_get(), sizeof(snapshot->title));
        strlcpy(snapshot->detail, s_streamTitle.c_get(), sizeof(snapshot->detail));
        snapshot->radioStationIndex = s_cur_station;
    }
    if (snapshot->source == PlayerSource::CloudMusic) {
        // Cloud track title/artist come from the last resolve response (set
        // once at play time by cloudMusicControllerTask) -- the audio lib
        // reports no ICY-style metadata for a plain CDN file URL, so leave
        // the values alone here instead of overwriting with station data.
        if (cloudResultLock()) {
            strlcpy(snapshot->title, s_cloudNowPlaying.title, sizeof(snapshot->title));
            if (s_cloudNowPlaying.artist[0]) {
                snprintf(snapshot->detail, sizeof(snapshot->detail), "%s", s_cloudNowPlaying.artist);
            } else {
                snapshot->detail[0] = '\0';
            }
            cloudResultUnlock();
        }
    }
    if (s_f_webFailed) strlcpy(snapshot->error, s_streamTitle.c_get(), sizeof(snapshot->error));

