pullead/esp32-hifi/src/main.cpp
    strlcpy(snapshot->codec, audio.getCodecname(), sizeof(snapshot->codec));
    snapshot->sampleRate = audio.getSampleRate();
    snapshot->bitsPerSample = audio.getBitsPerSample();
    snapshot->bitRate = audio.getBitRate();

    const uint32_t bufferSize = audio.getInBufferSize();
    uint32_t fillPercent = bufferSize ? (audio.inBufferFilled() * 100UL / bufferSize) : 0;
    if (fillPercent > 100) fillPercent = 100;
    snapshot->bufferFillPercent = static_cast<uint8_t>(fillPercent);

    // rtc.hasValidTime() reads a `timeinfo.tm_year` field that RTIME only
    // refreshes as a side effect of calling one of its own getters
    // (gettime_xs/gettime_l/...) -- called on its own, before anything else
    // has touched that cache, it reads the constructor's all-zero value
    // forever and the clock never appears. Check the real epoch instead:
    // anything before ~2023 means SNTP hasn't synced yet.
    time_t rawNow = time(nullptr);
    if (rawNow > 1700000000) {
        struct tm ti;
        localtime_r(&rawNow, &ti);
        snprintf(snapshot->timeHM, sizeof(snapshot->timeHM), "%02d:%02d", ti.tm_hour, ti.tm_min);
        static const char* kWeekdayCn[7] = {"周日", "周一", "周二", "周三", "周四", "周五", "周六"};
        static const char* kMonthEn[12] = {"Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};
        snprintf(snapshot->dateStr, sizeof(snapshot->dateStr), "%s %02d %s", kWeekdayCn[ti.tm_wday % 7], ti.tm_mday, kMonthEn[ti.tm_mon % 12]);
    } else {
        snapshot->timeHM[0] = '\0';
        snapshot->dateStr[0] = '\0';
    }
    snapshot->wifiRssi = snapshot->wifiConnected ? static_cast<int8_t>(WiFi.RSSI()) : 0;
    if (snapshot->wifiConnected) {
        strlcpy(snapshot->wifiSsid, WiFi.SSID().c_str(), sizeof(snapshot->wifiSsid));
        strlcpy(snapshot->wifiIp, WiFi.localIP().toString().c_str(), sizeof(snapshot->wifiIp));
    } else {
        snapshot->wifiSsid[0] = '\0';
        snapshot->wifiIp[0] = '\0';
    }
    snapshot->wifiApFallbackActive = s_wifiApFallbackActive;
    if (s_wifiApFallbackActive) {
        strlcpy(snapshot->wifiApSsid, kWifiSetupApSsid, sizeof(snapshot->wifiApSsid));
        strlcpy(snapshot->wifiApIp, WiFi.softAPIP().toString().c_str(), sizeof(snapshot->wifiApIp));
    } else {
        snapshot->wifiApSsid[0] = '\0';
        snapshot->wifiApIp[0] = '\0';
    }
    snapshot->eofCount = s_eofCount;

    if (s_weatherMutex && xSemaphoreTake(s_weatherMutex, pdMS_TO_TICKS(20)) == pdTRUE) {
        if (s_weather.valid) {
            snapshot->weatherTempC = s_weather.tempC;
            strlcpy(snapshot->weatherDesc, s_weather.desc, sizeof(snapshot->weatherDesc));
            snapshot->weatherIcon = s_weather.iconCategory;
        } else {
            snapshot->weatherTempC = -999;
            snapshot->weatherDesc[0] = '\0';
            snapshot->weatherIcon = -1;
        }
        xSemaphoreGive(s_weatherMutex);
    }
}

#if MWR_LVGL_UI
static volatile bool s_lvglNetworkReady = false;

// Everything that depends on having a working connection -- started once,
// whether that connection came from the initial boot-time connectToWiFi()
// or from a network added later via the Settings > WiFi screen (see
// wifiAddTask()). Guarded by s_lvglNetworkReady so a later reconnect never
// re-runs it (double MDNS.begin()/webSrv.begin() etc. would be harmless at
// worst, but there's no reason to repeat it).
static void onWifiNetworkReady() {
    if (s_lvglNetworkReady) return;
    setRTC(s_TZString);
    webSrv.begin(80, 81);
    MDNS.begin("MiniWebRadio");
    MDNS.addService("esp32", "tcp", 80);
    // ArduinoOTA removed along with the ota_0 partition (see
    // boards/miniwebradio16MB_single.csv) -- network OTA was never actually
    // used (every flash this session was a direct USB esptool write), and
    // the second 6MB app slot it needed was worth far more as extra room
    // for the CJK font subset.
    ftpSrv.begin(SD_MMC, FTP_USERNAME, FTP_PASSWORD);
    s_f_dlnaSeekServer = true;
    s_lvglNetworkReady = true;
    if (!s_weatherMutex) s_weatherMutex = xSemaphoreCreateMutex();
    if (xTaskCreatePinnedToCore(weatherTask, "weather", 10240, nullptr, 1, nullptr, 0) != pdPASS) MWR_LOG_ERROR("Failed to create weather task");
}

// startWifiApFallback() (WiFi.mode(WIFI_AP_STA) + softAP + DNSServer) is
// temporarily disabled -- it reliably caused the device to hang before
// app_main even started (no panic, no "Setup:" print, nothing at all) --
// reproduced on 5+ clean flash+boot cycles, survived both disabling
// LV_USE_QRCODE and switching DNSServer off the global-constructor path, so
// the actual cause is still unidentified. Needs real hardware debugging
// (JTAG, or bisecting down to just the bare WiFi.softAP() call) before
// re-enabling. The /wifi_manage admin page (see WEBSRV_onCommand) still
// works once the device is on some known network -- only the zero-network
// SoftAP bootstrap path is unavailable right now.

// ---- WiFi saved-list + reconnect (Settings > WiFi screen) -----------------
// The device itself no longer scans (that used its own background task and
// competed with audio/WiFi/LVGL for the same limited internal RAM at boot
// for no real benefit) -- it only ever lists what's already saved in NVS.
// Discovering and adding brand-new networks moved entirely to the phone-
// only /wifi_manage page below, which does its own on-demand
// WiFi.scanNetworks() when loaded rather than something running at boot.

uint8_t playerCoreWifiSavedCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < kWifiSlotCount; ++i) {
        ps_ptr<char> line = wifiPrefGet(i);
        if (playerCoreWifiLineIsSavedNetwork(line.c_get())) ++count;
    }
    return count;
}

bool playerCoreWifiSavedInfo(uint8_t index, char* outSsid, size_t ssidSize, bool* outIsDefault) {
    uint8_t seen = 0;
    for (uint8_t i = 0; i < kWifiSlotCount; ++i) {
        ps_ptr<char> line = wifiPrefGet(i);
        if (!playerCoreWifiLineIsSavedNetwork(line.c_get())) continue;
        if (seen == index) {
            const int pos = line.index_of("\t", 0);
            if (pos > 0) line[pos] = '\0';
            strlcpy(outSsid, line.get(), ssidSize);
            if (outIsDefault) *outIsDefault = (i == 0);
            return true;
        }
        ++seen;
    }
    return false;
}

// wifiMulti already has every saved AP added (see connectToWiFi() at boot);
// tapping a saved row just asks it to retry right now instead of waiting
// for loopLvglRuntime()'s once-a-second opportunistic run().
static volatile bool s_wifiReconnectInProgress = false;
static uint32_t s_wifiRetryBackoffSec = 1;
static uint32_t s_wifiNextRetryAtSec = 0;

