pullead/esp32-hifi/src/main.cpp
static bool runWifiMultiOnce(const char* reason, TickType_t lockTimeout = pdMS_TO_TICKS(1000)) {
    if (!lockWifiOps(lockTimeout)) {
        MWR_LOG_WARN("WiFi operation busy; skipped {}", reason ? reason : "wifiMulti.run()");
        return false;
    }
    wifiMulti.setStrictMode(false);
    wifiMulti.run();
    unlockWifiOps();
    return true;
}

static void wifiReconnectTask(void*) {
    const bool ran = runWifiMultiOnce("reconnect", pdMS_TO_TICKS(15000));
    if (ran && WiFi.status() == WL_CONNECTED) {
        s_f_isWiFiConnected = true;
        s_wifiRetryBackoffSec = 1;
        s_wifiNextRetryAtSec = s_totalRuntime + 1;
        onWifiNetworkReady();
    }
    s_wifiReconnectInProgress = false;
    vTaskDelete(nullptr);
}

static bool startWifiReconnectTask() {
    if (s_wifiReconnectInProgress) return false;
    s_wifiReconnectInProgress = true;
    const BaseType_t created = xTaskCreatePinnedToCore(wifiReconnectTask, "wifiReconn", 4096, nullptr, 1, nullptr, 0);
    if (created != pdPASS) {
        s_wifiReconnectInProgress = false;
        MWR_LOG_ERROR("Failed to create WiFi reconnect task");
        return false;
    }
    return true;
}

void playerCoreWifiReconnect() { startWifiReconnectTask(); }

struct WifiAddRequest {
    char ssid[33]{};
    char password[64]{};
};
static volatile bool s_wifiAddInProgress = false;

static void wifiAddTask(void* param) {
    auto* request = static_cast<WifiAddRequest*>(param);
    ps_ptr<char> ssidPtr = request->ssid;
    ps_ptr<char> pwPtr = request->password;
    setWiFiCredentials(ssidPtr, pwPtr); // persists to the next free slot (or updates a matching one)
    wifiMulti.addAP(request->ssid, request->password);
    runWifiMultiOnce("wifi add", pdMS_TO_TICKS(15000));
    bool connected = false;
    for (uint8_t i = 0; i < 30; ++i) { // up to 15s, same ballpark as connectToWiFi()'s own retry window
        if (WiFi.status() == WL_CONNECTED) {
            connected = true;
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(500));
    }
    if (connected) {
        s_f_isWiFiConnected = true;
        onWifiNetworkReady();
    }
    free(request);
    s_wifiAddInProgress = false;
    vTaskDelete(nullptr);
}

// Only called from the phone-only /wifi_manage web page now (see
// WEBSRV_onCommand's "wifi_connect") -- the device's own Settings > WiFi
// screen just lists saved networks (see playerCoreWifiSavedCount() above).
void playerCoreWifiAddNetwork(const char* ssid, const char* password) {
    if (s_wifiAddInProgress || !ssid || strlen(ssid) < 1) return;
    auto* request = static_cast<WifiAddRequest*>(malloc(sizeof(WifiAddRequest)));
    if (!request) return;
    *request = WifiAddRequest{};
    strlcpy(request->ssid, ssid, sizeof(request->ssid));
    if (password) strlcpy(request->password, password, sizeof(request->password));
    s_wifiAddInProgress = true;
    const BaseType_t created = xTaskCreatePinnedToCore(wifiAddTask, "wifiAdd", 6144, request, 1, nullptr, 0);
    if (created != pdPASS) {
        s_wifiAddInProgress = false;
        free(request);
        MWR_LOG_ERROR("Failed to create WiFi add task");
    }
}

// On-demand only (see WifiScanItem's comment), and asynchronous: an earlier
// version called WiFi.scanNetworks() directly from the LVGL button-click
// handler, blocking the same task that runs audio.loop()/the UI tick for
// the several seconds a scan takes -- long enough to starve things badly
// enough that tapping "手动添加" reliably froze/rebooted the device. Runs
// on its own task instead; HifiUi polls playerCoreWifiScanInProgress() and
// only calls playerCoreWifiScanResults() once it flips back to false.
static constexpr uint8_t kWifiScanMaxItems = 12;
static WifiScanItem s_wifiScanResults[kWifiScanMaxItems];
static uint8_t s_wifiScanResultCount = 0;
static volatile bool s_wifiScanInProgress = false;

static void wifiScanTask(void*) {
    int16_t n = 0;
    uint8_t count = 0;
    if (lockWifiOps(pdMS_TO_TICKS(15000))) {
        n = WiFi.scanNetworks();
        for (int16_t i = 0; i < n && count < kWifiScanMaxItems; ++i) {
            const String ssid = WiFi.SSID(i);
            if (ssid.length() == 0) continue; // hidden network -- nothing to show/select
            bool dup = false;
            for (uint8_t j = 0; j < count; ++j) {
                if (strcmp(s_wifiScanResults[j].ssid, ssid.c_str()) == 0) {
                    dup = true;
                    if (WiFi.RSSI(i) > s_wifiScanResults[j].rssi) s_wifiScanResults[j].rssi = WiFi.RSSI(i);
                    break;
                }
            }
            if (dup) continue;
            strlcpy(s_wifiScanResults[count].ssid, ssid.c_str(), sizeof(s_wifiScanResults[count].ssid));
            s_wifiScanResults[count].rssi = WiFi.RSSI(i);
            ++count;
        }
        WiFi.scanDelete();
        unlockWifiOps();
    } else {
        MWR_LOG_WARN("WiFi operation busy; skipped async scan");
    }
    // Strongest signal first -- simple insertion sort, count is tiny (<= kWifiScanMaxItems).
    for (uint8_t i = 1; i < count; ++i) {
        WifiScanItem key = s_wifiScanResults[i];
        int j = i - 1;
        while (j >= 0 && s_wifiScanResults[j].rssi < key.rssi) { s_wifiScanResults[j + 1] = s_wifiScanResults[j]; --j; }
        s_wifiScanResults[j + 1] = key;
    }
    s_wifiScanResultCount = count;
    s_wifiScanInProgress = false;
    vTaskDelete(nullptr);
}

void playerCoreWifiScanStart() {
    if (s_wifiScanInProgress) return;
    s_wifiScanInProgress = true;
    const BaseType_t created = xTaskCreatePinnedToCore(wifiScanTask, "wifiScan", 4096, nullptr, 1, nullptr, 0);
    if (created != pdPASS) {
        s_wifiScanInProgress = false;
        s_wifiScanResultCount = 0;
        MWR_LOG_ERROR("Failed to create WiFi scan task");
    }
}

bool playerCoreWifiScanInProgress() { return s_wifiScanInProgress; }

uint8_t playerCoreWifiScanResults(WifiScanItem* items, uint8_t maxItems) {
    const uint8_t n = std::min<uint8_t>(s_wifiScanResultCount, maxItems);
    for (uint8_t i = 0; i < n; ++i) items[i] = s_wifiScanResults[i];
    return n;
}

// This is deliberately separate from the historical setup sequence.  It keeps
// MiniWebRadio's services alive without constructing any legacy screen/widget.
static bool setupLvglRuntime() {
    printfln(s_tag.setup, ANSI_ESC_GREEN "[LVGL] runtime setup begin");
    s_h_resolution = 320;
    s_v_resolution = 170;

    logMemoryState("runtime_start");
    if (!init_SD_card()) return false;
    ensureLocalMusicDir();
#if MWR_USB_DAC_SUPPORTED
    if (usbDacModeFlag()) {
        // USB 声卡模式：不起 WiFi / 音频播放器 / 音乐扫描，只跑 UAC -> I2S。
        // 屏幕照常工作，是这个模式下唯一的仪表盘——USB 口被 TinyUSB 占用后
        // USB-Serial/JTAG 控制台会消失，printf 什么都抓不到。
        s_usbDacModeActive = true;
        if (!usbDacBegin()) {
            MWR_LOG_ERROR("USB DAC mode init failed -- clearing flag and rebooting to normal mode");
            usbDacSetModeFlag(false);
            s_usbDacModeActive = false;
            vTaskDelay(pdMS_TO_TICKS(300));
            ESP.restart();
            return false;
        }
        printfln(s_tag.setup, ANSI_ESC_GREEN "[LVGL] display begin (USB DAC mode)");
        if (!lvglRuntimeBegin()) {
            MWR_LOG_ERROR("LVGL display begin failed in USB DAC mode");
            usbDacSetModeFlag(false);
            s_usbDacModeActive = false;
            vTaskDelay(pdMS_TO_TICKS(300));
            ESP.restart();
            return false;
        }
        lvglRuntimeShowUsbDacPage();
        return true;
    }
#endif
#if MWR_USB_MSC_SUPPORTED
    if (usbMscModeFlag()) {
        // USB storage mode: expose the SD card to the host immediately.
        // TinyUSB must be initialized at boot (runtime USB.begin() is
        // unsafe -- ESP_RST_USB, see DEV_LOG 2026-07-31), so this mode is
        // entered by writing an NVS flag and rebooting. Skip WiFi, audio
        // and the music scan; keep only the minimal USB page.
        s_usbMscModeActive = true;
        if (!usbStoragePrepareMsc(true)) {
            MWR_LOG_ERROR("USB storage mode init failed -- clearing flag and rebooting to normal mode");
            usbMscSetModeFlag(false);
            s_usbMscModeActive = false;
            vTaskDelay(pdMS_TO_TICKS(300));
            ESP.restart();
            return false;
        }
        s_usbStorageState = UsbStorageState::Mounted;
        printfln(s_tag.setup, ANSI_ESC_GREEN "[LVGL] display begin (USB storage mode)");
        if (!lvglRuntimeBegin()) {
            MWR_LOG_ERROR("LVGL display begin failed in USB storage mode");
            usbMscSetModeFlag(false);
            s_usbMscModeActive = false;
            vTaskDelay(pdMS_TO_TICKS(300));
            ESP.restart();
            return false;
        }
        lvglRuntimeShowUsbStoragePage();
        return true;
    }
    // Normal mode: never start TinyUSB at boot (the single USB-C port
    // stays a serial console). Only probe the SD geometry/format so the
    // USB page can display FAT/allocation/capacity before mount.
    if (!usbStorageProbeGeometry()) {
        MWR_LOG_WARN("USB storage geometry probe failed (SD may be absent)");
    }
#endif
    startLocalMusicScan();
    if (!defaultsettings()) return false;
    if (ESP.getFlashChipSize() > 80000000) FFat.begin();
    logMemoryState("after_sd_init");
    updateSettings();

    // WiFi connects HERE, before audio claims its own ~73KB (I2S DMA + the
    // audio task's own buffers) -- real measurements on this board: audio
    // alone drops free heap from ~110KB to ~37KB, and esp_wifi_init() needs
    // more than that remainder ever reliably had (tried shrinking its own
    // buffer counts via sdkconfig first; didn't help, so the two truly
    // don't both fit at once here). Whichever claims memory second starves
    // -- and audio must never fail (no sound is worse than a few seconds of
    // no network), so WiFi goes first. connectToWiFi() is bounded (~11s
    // worst case with nothing in range) so this can't hang boot forever;
    // a later reconnect (new network added via Settings > WiFi, or simply
    // coming back into range) is still handled every second in
    // loopLvglRuntime()'s s_f_1sec block regardless of this initial result.
    logMemoryState("before_wifi_init");
    s_f_isWiFiConnected = connectToWiFi();
    if (s_f_isWiFiConnected) onWifiNetworkReady();
    logMemoryState("after_wifi_connected");

