pullead/esp32-hifi/src/main.cpp
    logMemoryState("before_audio_init");
    audio.setAudioTaskCore(AUDIOTASK_CORE);
    audio.setConnectionTimeout(CONN_TIMEOUT, CONN_TIMEOUT_SSL);
    audio.setVolumeSteps(s_volume.volumeSteps);
    audio.setVolume(0);
    // Was trimmed to 16 (from the library default of 32) back when the
    // internal-RAM budget was so tight that WiFi and audio almost didn't
    // both fit at all -- see the LV_ATTRIBUTE_LARGE_RAM_ARRAY comment in
    // lv_conf.h for how that changed. Restored to the library default now
    // that LVGL's own 96KB pool no longer competes for this same internal
    // RAM: measured ~110KB free after audio+WiFi+LVGL init with 16
    // descriptors, comfortably more than the ~37KB the full 32 costs (was
    // ~2.3KB/descriptor at 16), and the crackling this caused in local
    // playback was a direct, reported consequence of running below default.
    audio.settings.DMA_DESC_NUM = 32;
    audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT, I2S_MCLK);
    audio.setI2SCommFMT_LSB(I2S_COMM_FMT);
    setI2STone();
    playerCoreSetOutputPolicy(s_audioOutputPolicy, false);
    audio.settings.SPECTRUM = true; // real per-band FFT for the LVGL spectrum UI, see getSpectrumBands()
    logMemoryState("after_audio_set_pinout");

    if (AMP_ENABLED >= 0) {
        pinMode(AMP_ENABLED, OUTPUT);
        digitalWrite(AMP_ENABLED, HIGH);
    }

    ticker100ms.attach(0.1, timer100ms);
    playerService.begin();
    printfln(s_tag.setup, ANSI_ESC_GREEN "[LVGL] display begin");
    logMemoryState("before_lvgl_init");
    if (!lvglRuntimeBegin()) {
        printfln(s_tag.setup, ANSI_ESC_RED "[LVGL] display begin failed");
        return false;
    }
    printfln(s_tag.setup, ANSI_ESC_GREEN "[LVGL] runtime ready");
    // lvglRuntimeBegin() above both inits LVGL (lv_init(), claiming
    // work_mem_int) and builds the Home screen, so this one snapshot covers
    // both "after_lvgl_init" and "after_home_screen_created" from the A/B
    // test plan -- there's no separate hook point between the two.
    logMemoryState("after_lvgl_init_and_home_screen");
    return true;
}

static void loopLvglRuntime() {
    processUsbStorage();
#if MWR_USB_DAC_SUPPORTED
    if (s_usbDacModeActive) {
        // 声卡模式：不跑 dlna/audio/web/ftp/播放器。音频搬运由 usb_dac.cpp 里
        // 那个钉在 core 0 的 I2S 任务负责，这里只维持 UI。
        usbDacLoop();
        lvglRuntimeTick();
        return;
    }
#endif
#if MWR_USB_MSC_SUPPORTED
    if (s_usbMscModeActive) {
        // USB storage mode: no audio/WiFi/web/dlna ticks -- just keep the
        // minimal USB page alive and watch for host eject (processUsbStorage
        // above turns that into a reboot back to normal mode).
        lvglRuntimeTick();
        return;
    }
#endif
    dlna.loop();
    audio.loop();
    if (s_lvglNetworkReady && !usbStorageBlocksSdAppAccess()) {
        webSrv.loop();
        ftpSrv.handleFTP();
    }
    bt_emitter.loop();
    playerService.tick();
    lvglRuntimeTick();

    if (s_f_playlistEnabled && !audio.isRunning() && !s_f_pauseResume) processPlaylist();

    if (s_f_100ms) {
        s_f_100ms = false;
        if (!s_f_mute && audio.getVolume() != s_volume.cur_volume) audio.setVolume(s_volume.cur_volume);
        if (s_f_mute && audio.getVolume() != 0) audio.setVolume(0);
    }

    if (s_f_1sec) {
        s_f_1sec = false;
        s_totalRuntime++;
        if (s_memLogRadioAtSec && s_totalRuntime >= s_memLogRadioAtSec) {
            logMemoryState("radio_playing_stable");
            s_memLogRadioAtSec = 0;
        }
        if (s_memLogLocalAtSec && s_totalRuntime >= s_memLogLocalAtSec) {
            logMemoryState("local_music_playing_stable");
            s_memLogLocalAtSec = 0;
        }
        if (!s_f_rtc) s_f_rtc = rtc.hasValidTime();
        if (WiFi.isConnected()) {
            s_f_WiFi_lost = false;
            // Covers the case setupLvglRuntime()'s initial connectToWiFi()
            // attempt failed (nothing in range yet) but a later retry here
            // succeeded -- onWifiNetworkReady() itself is idempotent
            // (guarded by s_lvglNetworkReady) so this is safe to call every
            // tick once connected, not just the first time.
            if (!s_lvglNetworkReady) {
                s_f_isWiFiConnected = true;
                onWifiNetworkReady();
            }
        } else {
            s_f_WiFi_lost = true;
            // Retries regardless of s_lvglNetworkReady -- previously this
            // only fired once already connected once, so a device that
            // never got WiFi up at boot would never retry at all.
            // But only if there's actually something saved to try: with
            // zero saved networks (e.g. right after an NVS wipe),
            // WiFiMulti::run() falls back to a full synchronous
            // WiFi.scanNetworks() every single call -- done here once a
            // second, that blocked the main loop long enough to make touch
            // feel unresponsive (LVGL's touch polling shares this loop).
            //
            // Even with a real saved network, every failed run() still does
            // that same blocking scan -- if the network is simply out of
            // range or briefly missed by a scan, retrying every single
            // second means touch/spectrum stay laggy for as long as it's
            // unreachable. Back off after repeated failures (capped at 16s)
            // and reset to retrying every second as soon as one succeeds,
            // so a normally-reachable network still reconnects quickly.
            if (playerCoreWifiSavedCount() > 0 && s_totalRuntime >= s_wifiNextRetryAtSec) {
                if (startWifiReconnectTask()) {
                    s_wifiNextRetryAtSec = s_totalRuntime + s_wifiRetryBackoffSec;
                    s_wifiRetryBackoffSec = std::min<uint32_t>(s_wifiRetryBackoffSec * 2, 16);
                }
            }
        }
        if (s_f_stationsChanged) {
            s_f_stationsChanged = false;
            staMgnt.updateStationsList();
        }
    }
}
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  S E T U P  📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

void setup() {
    //---- BEGIN ---------
    Serial.begin(MONITOR_SPEED);
    vTaskDelay(1500); // wait for Serial to be ready
    printf("\n\n");
    printf("[BOOT] resetReason=%d\n", static_cast<int>(esp_reset_reason()));
    fflush(stdout);
    trim(Version);
    printfln(s_tag.none, "");
    printfln(s_tag.none, "             " ANSI_ESC_YELLOW " ***************************************************** ");
    printfln(s_tag.none, "             " ANSI_ESC_YELLOW " *     MiniWebRadio {:29}    * " ANSI_ESC_RESET "      ", Version);
    printfln(s_tag.none, "             " ANSI_ESC_YELLOW " ***************************************************** ");
    printfln(s_tag.none, "");

