pullead/esp32-hifi/src/main.cpp
    mutex_rtc = xSemaphoreCreateMutex();
    mutex_display = xSemaphoreCreateMutex();
    s_prefMutex = xSemaphoreCreateMutex();
    s_wifiOpMutex = xSemaphoreCreateMutex();
    s_cloudMusicMutex = xSemaphoreCreateMutex();
    if (!s_prefMutex) MWR_LOG_ERROR("Failed to create Preferences mutex");
    if (!s_wifiOpMutex) MWR_LOG_ERROR("Failed to create WiFi operation mutex");
    if (!s_cloudMusicMutex) MWR_LOG_ERROR("Failed to create cloud music config mutex");
    s_cloudResultMutex = xSemaphoreCreateMutex();
    s_cloudCommandQueue = xQueueCreate(1, sizeof(CloudCommand));
    if (!s_cloudResultMutex) MWR_LOG_ERROR("Failed to create cloud music result mutex");
    // Cloud result arrays live in PSRAM -- internal RAM is the constraint
    // for TLS handshakes (~40KB contiguous heap); keeping ~24KB of list
    // data out of it is what lets WiFiClientSecure actually connect (the
    // "网关一直唤醒不了" bug: free internal heap had collapsed and TLS
    // allocation failed every attempt, while plain-HTTP radio kept working).
    s_cloudSearchResults = static_cast<CloudTrackItem*>(ps_malloc(sizeof(CloudTrackItem) * kCloudSearchMaxResults));
    s_cloudHotPlaylists = static_cast<CloudPlaylistItem*>(ps_malloc(sizeof(CloudPlaylistItem) * kCloudHotPlaylistMax));
    s_cloudPlaylistTracks = static_cast<CloudTrackItem*>(ps_malloc(sizeof(CloudTrackItem) * kCloudPlaylistTrackMax));
    s_cloudRankings = static_cast<CloudRankingItem*>(ps_malloc(sizeof(CloudRankingItem) * kCloudRankingMax));
    s_cloudNewSongs = static_cast<CloudTrackItem*>(ps_malloc(sizeof(CloudTrackItem) * kCloudNewSongMax));
    s_cloudLyricLines = static_cast<CloudLyricLine*>(ps_malloc(sizeof(CloudLyricLine) * kCloudMaxLyricLines));
    if (!s_cloudSearchResults || !s_cloudHotPlaylists || !s_cloudPlaylistTracks || !s_cloudRankings || !s_cloudNewSongs || !s_cloudLyricLines) {
        MWR_LOG_ERROR("Failed to allocate cloud music result arrays (PSRAM)");
    }
    // This task runs the full TLS resolve HTTP request AND
    // audio.connecttohost() synchronously; 10K was the original value and
    // (with the real playback-crash fix being the deferred-navigation
    // change, not this stack) remains sufficient. Keeping it at 12K leaves
    // a little headroom while sparing internal heap for mbedTLS.
    if (xTaskCreatePinnedToCore(cloudMusicControllerTask, "cloudCtrl", 12288, nullptr, 1, nullptr, 0) != pdPASS) {
        MWR_LOG_ERROR("Failed to create cloud music controller task");
    }
    // Keep both Render free-tier services awake (see cloudKeepaliveTask) --
    // cheap (one TLS pair every 9 min), prevents the double-cold-start
    // "加载失败/502" after idle.
    if (xTaskCreatePinnedToCore(cloudKeepaliveTask, "cloudKeep", 8192, nullptr, 1, nullptr, 0) != pdPASS) {
        MWR_LOG_ERROR("Failed to create cloud keepalive task");
    }
    // Lyrics fetch task starts unconditionally (not gated on WiFi connecting
    // like weatherTask) since local playback -- and playerCoreLoadLyrics()'s
    // mutex-guarded cache -- can happen with WiFi never up. fetchLyricsOnline()
    // itself checks WiFi.isConnected() and returns immediately if it's down.
    s_lyricsMutex = xSemaphoreCreateMutex();
    s_lyricsFetchQueue = xQueueCreate(1, sizeof(uint16_t));
    if (xTaskCreatePinnedToCore(lyricsFetchTask, "lyricsFetch", 8192, nullptr, 1, nullptr, 0) != pdPASS) MWR_LOG_ERROR("Failed to create lyrics fetch task");
    Audio::audio_info_callback = my_audio_info; // audio callback
    dlna.dlna_client_callbak(on_dlna_client);   // dlna callback
    bt_emitter.kcx_bt_emitter_callback(on_kcx_bt_emitter);
    webSrv.websrv_callbak(on_websrv);
    esp_log_level_set("*", ESP_LOG_DEBUG);
    esp_log_set_vprintf(log_redirect_handler);

    if (!get_esp_items(&s_resetReason, &s_f_FFatFound)) return;

    btn_RA_bt.set_active(false);
    btn_SE_bright.set_active(false);
#if MWR_LVGL_UI
    if (TFT_BL >= 0) {
        pinMode(TFT_BL, OUTPUT);
        digitalWrite(TFT_BL, HIGH);
        s_f_brightnessIsChangeable = false;
    }
#else
    if (TFT_BL >= 0) {
        s_f_brightnessIsChangeable = true;
        setupBacklight(TFT_BL, 512);
        setTFTbrightness(200, 200);
        btn_SE_bright.set_active(true);
    }
#endif
    if (IR_PIN >= 0) {
        pinMode(IR_PIN, INPUT_PULLUP); // if ir_pin is read only, have a external resistor (~10...40KOhm)
    }

    pref.begin("Pref", false); // instance of preferences from AccessPoint (SSID, PW ...)

    // Cloud-music config + history must load AFTER pref.begin() -- before it
    // the Preferences namespace isn't open and every getString() comes back
    // empty, which is exactly why the saved gateway info "disappeared" after
    // every flash/reboot (it was written to NVS fine, just never reloaded).
    cloudMusicLoadConfig();
    cloudMusicLoadHistory();

    if (!detect_i2_c_devices(&i2cBusOne, I2C_SDA, I2C_SCL, &s_i2c_items)) { printfln(s_tag.setup, "No i2c device found"); }

    if (s_i2c_items.bh1750_found) {
#if MWR_LVGL_UI
        printfln(s_tag.setup, "Ambient Light Sensor BH1750 ignored in LVGL display mode");
#else
        BH1750.begin(&i2cBusOne, s_i2c_items.bh1750_addr); // init the sensor
        printfln(s_tag.setup, "Ambient Light Sensor BH1750 found at " ANSI_ESC_CYAN "0x{:02X}", s_i2c_items.bh1750_addr);
        BH1750.setResolutionMode(BH1750.ONE_TIME_H_RESOLUTION_MODE);
        BH1750.setSensitivity(BH1750.SENSITIVITY_ADJ_MAX);
#endif
    }

    if (s_i2c_items.es8311_found) {
        bool res = es8311.begin(&i2cBusOne, s_i2c_items.es8311_addr); // init the dac
        if (res) printfln(s_tag.setup, "DAC ES8311 found at " ANSI_ESC_CYAN "0x{:02X}", s_i2c_items.es8311_addr);
        es8311.setVolume(90);
    }
    vTaskDelay(3000);

#if MWR_LVGL_UI
    if (!setupLvglRuntime()) {
        printfln(s_tag.setup, ANSI_ESC_RED "LVGL runtime setup failed");
        return;
    }
    return;
#endif

    set_tft_items(); // TFT, Resolotion
    set_tp_items();  // TP, Resolotion
    if (!init_SD_card()) return;

    defaultsettings();

