pullead/esp32-hifi/src/main.cpp
    if (ESP.getFlashChipSize() > 80000000) { FFat.begin(); }

    drawImage("/common/MiniWebRadioV4.jpg", 0, 0); // Welcomescreen
    updateSettings();

    s_f_isWiFiConnected = connectToWiFi();

    placingGraphicObjects();
    sdr_BR_value.setValue(s_brightness);
    sdr_EQ_lowPass.setValue(s_tone.LP);
    sdr_EQ_bandPass.setValue(s_tone.BP);
    sdr_EQ_highPass.setValue(s_tone.HP);
    sdr_EQ_balance.setValue(s_tone.BAL);
    sdr_DL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    sdr_CL_volume.setMinMaxVal(0, s_volume.volumeSteps);
    sdr_CL_volume.setValue(s_volume.cur_volume);
    btn_RA_mute.setValue(s_f_mute);
    btn_CL_mute.setValue(s_f_mute);
    btn_EQ_mute.setValue(s_f_mute);
    btn_PL_mute.setValue(s_f_mute);
    btn_DL_mute.setValue(s_f_mute);
    btn_BT_power.setValue(s_bt_emitter.enabled);
    lst_DLNA.client_and_history(&dlna, &s_dlnaHistory[0], 10);
    lst_RADIO.currentStationNr(&s_cur_station);
    clk_AC_red.alarm_time_and_days(&s_alarmdays, s_alarmtime);

    audio.setAudioTaskCore(AUDIOTASK_CORE);
    audio.setConnectionTimeout(CONN_TIMEOUT, CONN_TIMEOUT_SSL);
    audio.setVolumeSteps(s_volume.volumeSteps);
    audio.setVolume(0);
    audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT, I2S_MCLK);
    audio.setI2SCommFMT_LSB(I2S_COMM_FMT);
    playerService.begin();

    printfln(s_tag.setup, "number of saved stations: " ANSI_ESC_CYAN "{}", staMgnt.getSumStations());
    printfln(s_tag.setup, "number of saved favourites: " ANSI_ESC_CYAN "{}", staMgnt.getSumFavStations());
    printfln(s_tag.setup, "current station number: " ANSI_ESC_CYAN "{}", s_cur_station);
    printfln(s_tag.setup, "current volume: " ANSI_ESC_CYAN "{}", s_volume.cur_volume);
    printfln(s_tag.setup, "volume steps: " ANSI_ESC_CYAN "{}", s_volume.volumeSteps);
    printfln(s_tag.setup, "volume after alarm: " ANSI_ESC_CYAN "{}", s_volume.volumeAfterAlarm);
    printfln(s_tag.setup, "last connected host: " ANSI_ESC_YELLOW "{}", s_settings.lastconnectedhost);
    printfln(s_tag.setup, "connection timeout: " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " ms", CONN_TIMEOUT);
    printfln(s_tag.setup, "connection timeout SSL: " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " ms", CONN_TIMEOUT_SSL);

    if (s_volume.volumeSteps < 21) s_volume.volumeSteps = 21;

    if (IR_PIN >= 0) ir.begin(); // Init InfraredDecoder when fitted

    if (AMP_ENABLED >= 0) { // enable onboard amplifier
        pinMode(AMP_ENABLED, OUTPUT);
        digitalWrite(AMP_ENABLED, HIGH);
        printfln(s_tag.setup, "On Board Amplifier pin is: " ANSI_ESC_CYAN "{}", AMP_ENABLED);
    }

    if (s_f_isWiFiConnected) webSrv.begin(80, 81); // HTTP port, WebSocket port

    if (s_f_mute) { printfln(s_tag.setup, "volume is muted: (from " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET ")", s_volume.cur_volume); }
    setI2STone();
    playerCoreSetOutputPolicy(s_audioOutputPolicy, false);

    ticker100ms.attach(0.1, timer100ms);

    muteChanged(s_f_mute);
    if (s_f_isWiFiConnected) {
        if (s_resetReason == ESP_RST_POWERON ||   // Simply switch on the operating voltage
            s_resetReason == ESP_RST_SW ||        // ESP.restart()
            s_resetReason == ESP_RST_SDIO ||      // The boot button was pressed
            s_resetReason == ESP_RST_DEEPSLEEP) { // Wake up
            s_state = UNDEFINED;
        }
        if (!MDNS.begin("MiniWebRadio")) {
            printfln(s_tag.wifi_info, ANSI_ESC_YELLOW "Error starting mDNS");
        } else {
            printfln(s_tag.wifi_info, "mDNS started");
            MDNS.addService("esp32", "tcp", 80);
            printfln(s_tag.wifi_info, "mDNS name: " ANSI_ESC_YELLOW "MiniWebRadio");
        }
        ArduinoOTA.setHostname("MiniWebRadio");
        ArduinoOTA.begin();
        ftpSrv.begin(SD_MMC, FTP_USERNAME, FTP_PASSWORD); // username, password for fgetTP().
        s_f_dlnaSeekServer = true;
    } else {
        s_state = UNDEFINED;
        setTFTbrightness(200, 200);
        changeState(WIFI_SETTINGS, 0);
        return;
    }

    if (BT_EMITTER_RX >= 0) bt_emitter.begin();

    rec_buffer.alloc_array(REC_BUFFER_SIZE, "rec_buffer");                             // allocate in PSRAM
    writeBuffer.alloc_array(WRITE_CHUNK_SIZE, "writeBuffer");                          // allocate in PSRAM
    if (xTaskCreatePinnedToCore(wavWriterTask, "wavWriter", 4096, nullptr, 1, nullptr, 0) == pdPASS) { // start recorder task
        printfln(s_tag.setup, "Recorder task started, free heap: " ANSI_ESC_CYAN "{}", ESP.getFreeHeap());
    } else {
        MWR_LOG_ERROR("Failed to create recorder task");
    }

    drawImage("/common/Wallpaper.jpg", 0, 0);                                                                     // Wallpaper
    getTFT().copyFramebuffer(FB_VISIBLE, FB_BACKGROUND, 0, 0, displayConfig.dispWidth, displayConfig.dispHeight); // copy wallpaper to background

    dispHeader.updateVolume(s_volume.cur_volume);
    dispHeader.speakerOnOff(!s_f_mute);
    dispHeader.updateTime("00:00:00", true);

    dispFooter.setIpAddr(WiFi.localIP().toString().c_str());
    dispFooter.updateStation(s_cur_station);
    dispFooter.updateOffTime(s_sleeptime);

    setRTC(s_TZString);
    s_stationURL = s_settings.lastconnectedhost;
    setStation(s_cur_station);
    changeState(RADIO, 0);
}

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  C O M M O N  📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

static bool i2c_read_reg(TwoWire* twi, uint8_t addr, uint8_t reg, uint8_t& value) {
    twi->beginTransmission(addr);
    twi->write(reg);
    if (twi->endTransmission(false) != 0) return false;
    if (twi->requestFrom((uint16_t)addr, (uint8_t)1, (uint8_t)true) != 1) return false;
    if (!twi->available()) return false;
    value = twi->read();
    return true;
}

static bool i2c_looks_like_es8311(TwoWire* twi, uint8_t addr) {
    uint8_t r00 = 0, r01 = 0, r02 = 0, r03 = 0;
    if (!i2c_read_reg(twi, addr, 0x00, r00)) return false;
    log_w("r00 %i", r00);
    if (!i2c_read_reg(twi, addr, 0x01, r01)) return false;
    log_w("r01 %i", r01);
    if (!i2c_read_reg(twi, addr, 0x02, r02)) return false;
    log_w("r02 %i", r02);
    if (!i2c_read_reg(twi, addr, 0x03, r03)) return false;
    log_w("r03 %i", r03);
    bool res = (0x1F == r00 && 0x00 == r01 && 0xF0 == r02 && 0x10 == r03);
    log_w("res %i", res);
    return res;
}

bool detect_i2_c_devices(TwoWire* twi, int8_t sda, int8_t scl, i2c_items_s* i2c_items) {
    if (sda < 0) return false;
    if (scl < 0) return false;
    if (sda == scl) return false;
    bool log = 0;
    twi->end();
    twi->flush();
    twi->begin(sda, scl, 100000);

