pullead/esp32-hifi/src/main.cpp
    for (uint8_t addr = 0; addr < 128; addr++) {
        twi->beginTransmission(addr);
        if (twi->endTransmission() == 0) {
            if (addr == 0x18 || addr == 0x19) {
                if (i2c_looks_like_es8311(twi, addr)) {
                    i2c_items->es8311_found = true;
                    i2c_items->es8311_addr = addr;
                    if (log) MWR_LOG_WARN("es8311 found at 0x{:X}", addr);
                } else {
                    MWR_LOG_WARN("unknown i2c device at 0x{:X} found", addr);
                }
            } else if (addr == 0x14 || addr == 0x5D) {
                i2c_items->gt911_found = true;
                i2c_items->gt911_addr = addr;
                if (log) MWR_LOG_WARN("gt911 found at 0x{:X}", addr);
                //-- BH1750 -------------------------------------------------------------------------------------------------------------------------------
            } else if (addr == 0x23 || addr == 0x5C) {
                i2c_items->bh1750_found = true;
                i2c_items->bh1750_addr = addr;
                //-- FT8X36U ------------------------------------------------------------------------------------------------------------------------------
            } else if (addr == 0x38) {
                i2c_items->ft6x36u_found = true;
                i2c_items->ft6x36u_addr = addr;
                if (log) MWR_LOG_WARN("ft6x36u found at 0x{X}", addr);
            } else if (addr == 0x40) {
                i2c_items->es7210_found = true;
                i2c_items->es7210_addr = addr;
                if (log) MWR_LOG_WARN("es7210 found at 0x{X}", addr);
            } else {
                MWR_LOG_WARN("unknown i2c device at 0x{X} found", addr);
            }
        }
    }
    return true;
}
//---------------------------------------------------------------------------------------

void set_tft_items() {
//---- LAYOUT -----------
#ifdef TFT_LAYOUT_WAVESHARE_19
    s_h_resolution = 320;
    s_v_resolution = 170;
#elifdef TFT_LAYOUT_S
    s_h_resolution = 320;
    s_v_resolution = 240;
#elifdef TFT_LAYOUT_M
    s_h_resolution = 480;
    s_v_resolution = 320;
#elifdef TFT_LAYOUT_L
    s_h_resolution = 800;
    s_v_resolution = 480;
#elifdef TFT_LAYOUT_XL
    s_h_resolution = 1024;
    s_v_resolution = 600;
#endif

//---- TFT_MODE ---------
#ifdef TFT_MODE_SPI
#ifndef TFT_LAYOUT_WAVESHARE_19
    spiBus.begin(TFT_SCK, TFT_MISO, TFT_MOSI, -1); // SPI1 for TFT
#endif
    getTFT().setTFTcontroller(TFT_CONTROLLER);
    getTFT().setRotation(TFT_ROTATION);
    getTFT().setDisplayInversion(DISPLAY_INVERSION);
    getTFT().begin(TFT_DC); // Init TFT interface
    getTFT().setFrequency(TFT_FREQUENCY);
    getTFT().setBackGoundColor(TFT_BLACK);
#elifdef TFT_MODE_RGB
    getTFT().begin(RGB_PINS, RGB_TIMING);
    getTFT().setDisplayInversion(false);
    getTFT().setRotation(TFT_ROTATION);
    vTaskDelay(100 / portTICK_PERIOD_MS); // wait for TFT to be ready
    getTFT().reset();
    vTaskDelay(100 / portTICK_PERIOD_MS); // wait for TFT to be ready
    getTFT().clearVsyncCounter();         // clear the vsync counter and start them
#elifdef TFT_MODE_DSI
    getTFT().begin(DSI_TIMING);
    getTFT().setRotation(TFT_ROTATION);
    getTFT().setDisplayInversion(DISPLAY_INVERSION);
    vTaskDelay(100 / portTICK_PERIOD_MS); // wait for TFT to be ready
#endif
}

void set_tp_items() {
//---- TP_MODE ---------
#ifdef TP_MODE_XPT2046 // XPT2046
    getTP().begin(TP_IRQ, s_h_resolution, s_v_resolution);
    getTP().setSize(TP_CONTROLLER); // (0) 2.8 inch, (1) 3.5 inch, (4) 4.0 inch
    getTP().setRotation(TP_ROTATION);
#elifdef TP_MODE_GT911  // GT911
    getTP().begin(&i2cBusOne, s_i2c_items.gt911_addr, s_h_resolution, s_v_resolution);
    getTP().setRotation(TP_ROTATION);
    getTP().setMirror(TP_H_MIRROR, TP_V_MIRROR);
#elifdef TP_MODE_FT6X63 // FT6x36
    getTP().begin(&i2cBusOne, 0x38, s_h_resolution, s_v_resolution);
    getTP().get_FT6x36_items();
    getTP().setRotation(TP_ROTATION);
    getTP().setMirror(TP_H_MIRROR, TP_V_MIRROR);
#elifdef TP_MODE_CST816
    getTP().begin(&i2cBusOne, 0x15, s_h_resolution, s_v_resolution);
    getTP().setRotation(TP_ROTATION);
    getTP().setMirror(TP_H_MIRROR, TP_V_MIRROR);
#endif
}

//---------------------------------------------------------------------------------------
bool init_SD_card() {
    printfln(s_tag.sd_card, "Init SD card");
    pinMode(SD_MMC_D0, INPUT_PULLUP);
    int32_t sdmmc_frequency = SDMMC_FREQUENCY / 1000; // MHz -> KHz, default is 40MHz
#ifdef CONFIG_IDF_TARGET_ESP32S3
    SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
    s_f_sd_card_found = SD_MMC.begin("/sdcard", true, false, sdmmc_frequency);
#elifdef CONFIG_IDF_TARGET_ESP32P4
    if (SD_MMC_D1 == -1) {
        SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
        s_f_sd_card_found = SD_MMC.begin("/sdcard", true, false, sdmmc_frequency); // mode1bit
    } else {
        SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0, SD_MMC_D1, SD_MMC_D2, SD_MMC_D3);
        s_f_sd_card_found = SD_MMC.begin("/sdcard", false, false, sdmmc_frequency); // mode4bit
    }

#endif
    if (!s_f_sd_card_found) {
        clearAll(TFT_BLACK);
        getTFT().setFontSize(displayConfig.fonts[6]);
        getTFT().setTextColor(TFT_YELLOW);
        getTFT().writeText("SD Card Mount Failed", 0, 50, displayConfig.dispWidth, displayConfig.dispHeight, TFT_ALIGN_CENTER, TFT_ALIGN_TOP, false, false);
        printfln(s_tag.sd_card, ANSI_ESC_RED "SD Card Mount Failed");
        return false;
    }
    float cardSize = ((float)SD_MMC.cardSize()) / (1024 * 1024);
    float freeSize = ((float)SD_MMC.cardSize() - SD_MMC.usedBytes()) / (1024 * 1024);
    printfln(s_tag.sd_card, "SD card found, " ANSI_ESC_CYAN "{:.1}" ANSI_ESC_RESET " MB by " ANSI_ESC_CYAN "{:.1} MB free", freeSize, cardSize);
    return true;
}

//---------------------------------------------------------------------------------------

ps_ptr<char> scaleImage(ps_ptr<char> path) {
    if (path.strlen() == 0) return "/common/unknown.png";
    bool ok = false;
    if (path.ends_with("bmp")) ok = true;
    if (path.ends_with("jpg")) ok = true;
    if (path.ends_with("gif")) ok = true;
    if (path.ends_with("png")) ok = true;
    if (path.starts_with("/png")) ok = false; // is web button
    MWR_LOG_DEBUG("path {}", path.c_get());
    if (!ok) return path;

    int idx = path.index_of('/', 1);
    if (idx < 0) return path; // invalid path
    ps_ptr<char> tfts = displayConfig.tftSize;
    tfts += "/";
    path.insert(tfts.c_get(), idx + 1); // "/logo/0N 90s.jpg" --> "/logo/s/0N 90s.jpg"
    MWR_LOG_DEBUG("path {}", path.c_get());
    return path;
}

