pullead/esp32-hifi/src/main.cpp
void setVolume(uint8_t vol) {
    static int16_t oldVol = -1;
    if (vol == oldVol) return;
    MWR_LOG_DEBUG("volume old: {}. new: {}", oldVol, vol);
    s_volume.cur_volume = vol;
    oldVol = vol;
    dispHeader.updateVolume(s_volume.cur_volume);
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    printfln(s_tag.action, "current volume is " ANSI_ESC_CYAN "{}", s_volume.cur_volume);
}

uint8_t downvolume() {
    uint8_t steps = s_volume.volumeSteps / 20;
    if (s_volume.cur_volume == 0)
        return s_volume.cur_volume;
    else if (steps < s_volume.cur_volume)
        s_volume.cur_volume -= steps;
    else
        s_volume.cur_volume--;
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    s_f_mute = false;
    muteChanged(s_f_mute); // set mute off
    return s_volume.cur_volume;
}

uint8_t upvolume() {
    uint8_t steps = s_volume.volumeSteps / 20;
    if (s_volume.cur_volume == s_volume.volumeSteps)
        return s_volume.cur_volume;
    else if (s_volume.volumeSteps > s_volume.cur_volume + steps)
        s_volume.cur_volume += steps;
    else
        s_volume.cur_volume++;
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    s_f_mute = false;
    muteChanged(s_f_mute); // set mute off
    return s_volume.cur_volume;
}

void setStation(ps_ptr<char> url, ps_ptr<char> extension) {
    if (!url.valid()) {
        MWR_LOG_ERROR("url is empty");
        return;
    }
    // e.g.  http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one&bitrate=96000
    // url is http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one, extension is bitrate=96000
    s_stationName_air = url;
    if (extension.strlen()) url.appendf("&{}", extension);
    s_stationURL = url;
    s_cur_station = 0;
    setStation(0);
}

void setStation(uint16_t sta) {
    if (sta == 0) {
        connecttohost(s_stationURL);
        s_stationName_air = s_stationURL;
    } else {
        if (sta > staMgnt.getSumStations()) sta = s_cur_station;
        s_stationURL = staMgnt.getStationUrl(sta);
        connecttohost(s_stationURL);
    }
    printfln(s_tag.action, "switch to station " ANSI_ESC_CYAN "{}", sta);
    printfln(s_tag.country, "Country of origin " ANSI_ESC_YELLOW "{}", staMgnt.getStationCountry(s_cur_station));
    s_homepage = "";
    s_streamTitle = "";
    s_icyDescription = "";
    clearStreamTitle();
    s_f_newStreamTitle = true;
    s_f_newIcyDescription = true;
    showLogoAndStationName();
}

void nextStation() {
    setStation(staMgnt.nextStation());
}
void nextFavStation() {
    setStation(staMgnt.nextFavStation());
}
void prevStation() {
    setStation(staMgnt.prevStation());
}
void prevFavStation() {
    setStation(staMgnt.prevFavStation());
}
void setStationByNumber(uint16_t staNr) {
    setStation(staMgnt.setStationByNumber(staNr));
}

void savefile(ps_ptr<char> fileName, uint32_t contentLength, ps_ptr<char> contentType) { // save the uploadfile on SD_MMC

    if (!fileName.starts_with("/")) { fileName = "/" + fileName; }
    if (webSrv.uploadfile(SD_MMC, fileName, contentLength, contentType)) {
        printfln(s_tag.sd_card, "save file " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " in progress", fileName.c_get());
        webSrv.sendStatus(200);
    } else {
        printfln(s_tag.sd_card, "save file " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " to SD failed", fileName.c_get());
        webSrv.sendStatus(400);
    }
}

void saveImage(const char* fileName, uint32_t contentLength) { // save the jpg image on SD_MMC
    ps_ptr<char> fn;

    if (endsWith(fileName, "jpg")) {
        fn.assign("/logo/");
        fn.append(displayConfig.tftSize);
        if (!startsWith(fileName, "/")) fn.append("/");
        fn.append(fileName);
        if (webSrv.uploadB64image(SD_MMC, fn.c_get(), contentLength)) {
            printfln(s_tag.sd_card, "save image (jpg) " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET " to SD card was successfully", fn.c_get());
            webSrv.sendStatus(200);
        } else
            webSrv.sendStatus(400);
    }
}

void setI2STone() {
    audio.setTone(s_tone.LP, s_tone.BP, s_tone.HP);
    audio.setBalance(s_tone.BAL);
    return;
}

ps_ptr<char> getI2STone() {
    ps_ptr<char> tone;
    tone.assignf("LowPass={}\nBandPass={}\nHighPass={}\nBalance={}\n", s_tone.LP, s_tone.BP, s_tone.HP, s_tone.BAL);
    return tone;
}

void SD_playFile(ps_ptr<char> pathWoFileName, const char* fileName) { // pathWithoutFileName e.g. /audiofiles/playlist/
    pathWoFileName += fileName;
    int32_t idx = pathWoFileName.index_of("\033[", 1);
    if (idx == -1) { // do nothing
        SD_playFile(pathWoFileName, 0, true);
        return;
    }
    SD_playFile(pathWoFileName.substr(0, idx), 0, true); // remove color and filesize
    return;
}

void SD_playFile(ps_ptr<char> path, uint32_t fileStartTime, bool showFN) {
    if (!path.valid()) return; // avoid a possible crash

    if (path.ends_with("m3u")) {
        if (playlist.create_playlist_from_file(path)) s_f_playlistEnabled = true;
        return;
    }

    ps_ptr<char> file_name;

    if (s_subState_player != 1) { changeState(PLAYER, 1); }
    int32_t idx = path.last_index_of('/');
    if (idx < 0) return;
    s_cur_AudioFolder = path.substr(0, idx);
    file_name = path.substr(idx + 1); // without '/'

    if (showFN) {
        clearLogo();
        showPlayerFileName(path.get() + idx + 1);
    }

    printfln(s_tag.file_name, ANSI_ESC_MAGENTA "{}", file_name.c_get());
    connecttoFS("SD_MMC", (const char*)path.c_get(), fileStartTime);
    if (s_f_playlistEnabled) showPlsFileNumber();
    if (s_f_isFSConnected) { s_settings.lastconnectedfile = path; }
}

bool SD_rename(const char* src, const char* dest) {
    bool success = false;
    if (SD_MMC.exists(src)) { success = SD_MMC.rename(src, dest); }
    return success;
}

bool SD_newFolder(const char* folderPathName) {
    bool success = false;
    success = SD_MMC.mkdir(folderPathName);
    return success;
}

bool SD_delete(const char* itemPath) {
    bool success = false;
    if (SD_MMC.exists(itemPath)) {
        File dirTest = SD_MMC.open(itemPath, "r");
        bool isDir = dirTest.isDirectory();
        dirTest.close();
        if (isDir)
            success = SD_MMC.rmdir(itemPath);
        else
            success = SD_MMC.remove(itemPath);
    }
    return success;
}

void fall_asleep() {
    s_f_sleeping = true;
    muteChanged(true);
    s_f_playlistEnabled = false;
    s_f_isFSConnected = false;
    s_f_isWebConnected = false;
    audio.stopSong();
    if (s_sleepMode == 0) {
        changeState(SLEEP, 0);
    } else {
        changeState(SLEEP, 1);
    }
    if (s_bt_emitter.found) bt_emitter.power_off();
    printfln(s_tag.action, "falling asleep");
}

void wake_up(int8_t state, int8_t subState) {
    s_f_sleeping = false;
    if (s_bt_emitter.found && s_bt_emitter.enabled) bt_emitter.power_on(s_bt_emitter.mode);
    muteChanged(false);
    printfln(s_tag.action, "awake");
    clearAll(TFT_TRANSPARENT);
    clk_CL_24.hide();
    setTFTbrightness(s_brightness, s_bh1750Value);
    dispHeader.set_bg_color(TFT_TRANSPARENT);
    dispFooter.set_bg_color(TFT_TRANSPARENT);
    dispHeader.show();
    dispFooter.show();
    changeState(state, subState);
}

void setRTC(ps_ptr<char> TZString) {
    rtc.stop();
    rtc.begin(TZString.c_get());
}

boolean isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime) {
    uint8_t mask = 0b00000001 << weekDay;
    if (alarmDays & mask) {                         // yes, is alarmDay
        if (alarmTime[weekDay] == minuteOfTheDay) { // yes, is alarmTime
            return true;
        }
    }
    return false;
}

boolean copySDtoFFat(const char* path) {
    if (!s_f_FFatFound) return false;
    uint8_t buffer[1024];
    size_t  r = 0, w = 0;
    size_t  len = 0;
    File    file1 = SD_MMC.open(path, "r");
    File    file2 = FFat.open(path, "w");
    while (true) {
        r = file1.read(buffer, 1024);
        w = file2.write(buffer, r);
        if (r != w) {
            file1.close();
            file2.close();
            FFat.remove(path);
            return false;
        }
        len += r;
        if (r == 0) break;
    }
    MWR_LOG_DEBUG("file length {}, written {}", file1.size(), len);
    if (file1.size() == len) return true;
    return false;
}

void muteChanged(bool m) {
    s_f_muteIsPressed = false;
    btn_CL_mute.setValue(m);
    btn_DL_mute.setValue(m);
    btn_EQ_mute.setValue(m);
    btn_PL_mute.setValue(m);
    btn_RA_mute.setValue(m);
    if (m) {
        s_f_mute = true;
        if (AMP_ENABLED != -1) {
            digitalWrite(AMP_ENABLED, LOW);
            printfln(s_tag.action, "mute, On Board Amplifier is off");
        }
        webSrv.send("mute=", "1");
    } else {
        s_f_mute = false;
        if (AMP_ENABLED != -1) {
            digitalWrite(AMP_ENABLED, HIGH);
            printfln(s_tag.action, "unmute, On Board Amplifier is on");
        }
        webSrv.send("mute=", "0");
    }
    dispHeader.speakerOnOff(!s_f_mute);
    dispHeader.updateVolume(s_volume.cur_volume);
    updateSettings();
};

void logAlarmItems() {
    const char wd[7][11] = {"Sunday:   ", "Monday:   ", "Tuesday:  ", "Wednesday:", "Thursday: ", "Friday:   ", "Saturday: "};
    uint8_t    mask = 0b00000001;
    for (uint8_t i = 0; i < 7; i++) {
        if (s_alarmdays & mask) {
            printfln(s_tag.alarm_time, ANSI_ESC_YELLOW "{} " ANSI_ESC_CYAN "{:02}:{:02}", wd[i], s_alarmtime[i] / 60, s_alarmtime[i] % 60);
        } else {
            printfln(s_tag.alarm_time, ANSI_ESC_YELLOW "{} No alarm is set", wd[i]);
        }
        mask <<= 1;
    }
}

void setTimeCounter(uint8_t sec) {
    if (sec) {
        s_timeCounter.timer = 10;
        s_timeCounter.factor = sec;
        s_timeCounter.tmp = sec;
    } else {
        s_timeCounter.timer = 0;
        s_timeCounter.factor = 0;
        dispFooter.updateTC(0);
        s_f_newBitRate = true;
    }
}

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  C H A N G E   S T A T E  📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// clang-format off
/*🟢🟡🔴*/
void changeState(int8_t state, int8_t subState) {

