pullead/esp32-hifi/src/main.cpp
    printfln(s_tag.action, "required state " ANSI_ESC_GREEN "{}({})" ANSI_ESC_RESET ", current state is " ANSI_ESC_GREEN "{}({})", getStatusName(state), subState, getStatusName(s_state), s_subState);
    MWR_LOG_DEBUG("state {}, s_state {}, subState {}, s_subState_radio {}, s_subState_player {}", state, s_state, subState, s_subState_radio, s_subState_player);
    bool newState = false;
    bool newSubState = false;
    s_subState = subState;
   // disableAllObjects();
    setTimeCounter(0);
    if (state == RADIO          && s_state != RADIO)              { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == STATIONSLIST   && s_state != STATIONSLIST)       { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == PLAYER         && s_state != PLAYER)             { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == AUDIOFILESLIST && s_state != AUDIOFILESLIST)     { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == DLNA           && s_state != DLNA)               { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == DLNAITEMSLIST  && s_state != DLNAITEMSLIST)      { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == CLOCK          && s_state != CLOCK)              { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == ALARMCLOCK     && s_state != ALARMCLOCK)         { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == SLEEPTIMER     && s_state != SLEEPTIMER)         { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == SETTINGS       && s_state != SETTINGS)           { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == BRIGHTNESS     && s_state != BRIGHTNESS)         { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == EQUALIZER      && s_state != EQUALIZER)          { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == BLUETOOTH      && s_state != BLUETOOTH)          { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == IR_SETTINGS    && s_state != IR_SETTINGS)        { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == RINGING        && s_state != RINGING)            { dispHeader.set_bg_color(TFT_BLACK);       dispHeader.show(); dispFooter.set_bg_color(TFT_BLACK);       dispFooter.show(); clearWithOutHeaderFooter(TFT_BLACK);       newState = true;}
    if (state == WIFI_SETTINGS  && s_state != WIFI_SETTINGS)      { dispHeader.set_bg_color(TFT_TRANSPARENT); dispHeader.show(); dispFooter.set_bg_color(TFT_TRANSPARENT); dispFooter.show(); clearWithOutHeaderFooter(TFT_TRANSPARENT); newState = true;}
    if (state == SLEEP          && s_state != SLEEP)              { dispHeader.set_bg_color(TFT_BLACK);       dispFooter.set_bg_color(TFT_BLACK);        clearAll(TFT_BLACK);                                                            newState = true;}

    if (state == RADIO          && s_subState_radio  != subState) { newSubState = true;  }
    if (state == PLAYER         && s_subState_player != subState) { newSubState = true;  }
    if (state == CLOCK          && s_subState_clock  != subState) { newSubState = true;  }

    if(newState)disableAllObjects();
    dispHeader.enable();
    dispFooter.enable();
    if(state != s_state) { dispHeader.updateItem(_hl_item[state]); }

    s_subState_radio  = UNDEFINED;
    s_subState_player = UNDEFINED;
    s_subState_clock  = UNDEFINED;

    s_f_volBarVisible = false;
    if (state != RADIO) { dispFooter.updateFlag(""); }

    switch (state) {
        case RADIO: {
            if (newState) {
                txt_RA_staName.setText("");
                txt_RA_staName.show();
                webSrv.send("changeState=", "RADIO");
                if(!s_f_isWebConnected){
                    setStation(s_cur_station);
                }
                if(s_f_isWebConnected) showLogoAndStationName();
            }
            else{
                txt_RA_staName.enable();
            }

            pic_RA_logo.enable();
            if(newSubState) hide_objects_in_area(layout.winArea2.x, layout.winArea2.y, layout.winArea2.w, layout.winArea2.h);
            if (subState == 0) {
                if(newSubState) {
                    VUmeter_RA.show();
                    txt_RA_sTitle.setText("");
                    txt_RA_sTitle.show();
                    s_f_newIcyDescription = true;
                    s_f_newStreamTitle = true;
                }
                else {
                    VUmeter_RA.enable();
                    txt_RA_sTitle.enable();
                    txt_RA_sTitle.enable();
                }
                setTimeCounter(0);
            }
            if (subState == 1) {  // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                if(newSubState) {
                    txt_RA_sTitle.hide();
                    VUmeter_RA.hide();
                    sdr_RA_volume.show();
                    btn_RA_mute.show(); btn_RA_prevSta.show(); btn_RA_nextSta.show(); btn_RA_recorder.show();
                    setTimeCounter(2);
                }
                else{
                    sdr_RA_volume.enable();
                    btn_RA_mute.enable(); btn_RA_prevSta.enable(); btn_RA_nextSta.enable(); btn_RA_recorder.enable();
                }
            }
            if (subState == 2){ // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                if(newSubState) {
                    txt_RA_sTitle.hide();
                    VUmeter_RA.hide();
                    sdr_RA_volume.hide();
                    btn_RA_staList.show();
                    btn_RA_player.show(); btn_RA_dlna.show(); btn_RA_clock.show(); btn_RA_sleep.show(); btn_RA_settings.show();
                    btn_RA_bt.show();
                    btn_RA_off.show();
                    setTimeCounter(2);
                }
                else {
                    btn_RA_staList.enable();
                    btn_RA_player.enable(); btn_RA_dlna.enable(); btn_RA_clock.enable(); btn_RA_sleep.enable(); btn_RA_settings.enable();
                    btn_RA_bt.enable();
                    btn_RA_off.enable();
                }
            }
            s_subState_radio = subState;
            break;
        }

        case STATIONSLIST: {
            lst_RADIO.show();
            setTimeCounter(LIST_TIMER);
            break;
        }
        case PLAYER: {
            if (newState) {
                stopSong();
                webSrv.send("changeState=", "PLAYER");
            }
            pic_PL_logo.enable();
            if (subState == 0){
                s_SD_content.listFilesInDir(s_cur_AudioFolder.c_get(), true, false);
                s_cur_Codec = 0;
                showFileLogo(PLAYER, subState);
                showPlayerFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                txt_PL_fName.show();
                pgb_PL_progress.hide();
                sdr_PL_volume.hide();
                showAudioFileNumber();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show();
                btn_PL_shuffle.show();  btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
            }
            if (subState == 1){
                pgb_PL_progress.setValue(0);
                showPlayerFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                if(newSubState){
                    btn_PL_fileList.hide(); btn_PL_radio.hide(); btn_PL_off.hide();
                    pgb_PL_progress.show();
                    sdr_PL_volume.show();
                    txt_PL_fName.show();
                    btn_PL_mute.show(); btn_PL_pause.setOff(); btn_PL_pause.show(); btn_PL_cancel.show(); btn_PL_playPrev.show(); btn_PL_playNext.show();
                }
                else{
                    pgb_PL_progress.enable();
                    sdr_PL_volume.enable();
                    txt_PL_fName.enable();
                    btn_PL_mute.enable(); btn_PL_pause.enable(); btn_PL_pause.enable(); btn_PL_cancel.enable();  btn_PL_playPrev.enable(); btn_PL_playNext.enable();
                }
            }
            s_subState_player = subState;
            break;
        }
        case AUDIOFILESLIST: {
            lst_PLAYER.show(s_cur_AudioFolder, s_cur_AudioFileNr);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case DLNA: {
            if (newState && s_state != DLNAITEMSLIST) audio.stopSong();
            pic_DL_logo.enable();
            pgb_DL_progress.setValue(0);
            pgb_DL_progress.show();
            txt_DL_fName.show();
            showFileLogo(DLNA, subState);
            webSrv.send("changeState=", "DLNA");
            if (audio.isRunning()) btn_DL_pause.setActive(true);
            else                   btn_DL_pause.setActive(false);
            sdr_DL_volume.show();
            btn_DL_pause.show(); btn_DL_mute.show(); btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            break;
        }
        case DLNAITEMSLIST: {
            lst_DLNA.show(s_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &s_dlnaLevel, s_dlnaMaxItems, s_dlnaMaXServers);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case CLOCK: {
            clk_CL_24.show();
            if (subState == 0) {
                btn_CL_mute.hide(); btn_CL_alarm.hide(); btn_CL_radio.hide(); sdr_CL_volume.hide(); btn_CL_off.hide();
            }
            if (subState == 1) {
                setTimeCounter(2);
                sdr_CL_volume.show();
                btn_CL_mute.show(); btn_CL_alarm.show(); btn_CL_radio.show(); btn_CL_off.show();
            }

            s_subState_clock = subState;
            break;
        }
        case ALARMCLOCK: {
            btn_AC_left.show(); btn_AC_right.show(); btn_AC_up.show(); btn_AC_down.show(); btn_AC_ready.show(); clk_AC_red.show();
            break;
        }
        case SLEEPTIMER: {
            if (newState) {
                otb_SL_stime.show(s_sleeptime);
                pic_SL_logo.setPicturePath("/common/Night_Gown.jpg");
                pic_SL_logo.align(true, true);
                pic_SL_logo.show();
            }
            btn_SL_up.show(); btn_SL_up.show(); btn_SL_down.show(); btn_SL_ready.show(); btn_SL_cancel.show();
            break;
        }
        case SETTINGS: {
            if (newState) {
                showFileLogo(SETTINGS, subState);
            }
            btn_SE_bright.show(); btn_SE_equal.show(); btn_SE_wifi.show(); btn_SE_radio.show();
            break;
        }
        case BRIGHTNESS: {
            if (newState) {
                pic_BR_logo.show();
                sdr_BR_value.setValue(s_brightness);
                sdr_BR_value.show();
                txt_BR_value.setText(int2str(s_brightness));
                txt_BR_value.show();
            } else {
                sdr_BR_value.enable();
                txt_BR_value.enable();
            }
            btn_BR_ready.show();
            break;
        }
        case EQUALIZER:
            sdr_EQ_lowPass.show();
            sdr_EQ_bandPass.show();
            sdr_EQ_highPass.show();
            sdr_EQ_balance.show();
            btn_EQ_lowPass.show();
            btn_EQ_bandPass.show();
            btn_EQ_highPass.show();
            btn_EQ_balance.show();
            btn_EQ_Player.show();
            btn_EQ_mute.show();
            txt_EQ_lowPass.show();
            txt_EQ_bandPass.show();
            txt_EQ_highPass.show();
            txt_EQ_balance.show();
            btn_EQ_Radio.show();
            break;

        case BLUETOOTH: {
            btn_BT_volUp.show(); btn_BT_volDown.show(); btn_BT_pause.show(); btn_BT_mode.show();
            btn_BT_radio.show(); btn_BT_power.show();
            pic_BT_mode.show();
            txt_BT_mode.set_bg_color(TFT_BROWN);
            if (s_bt_emitter.mode.equals("RX")) { txt_BT_mode.setText("RECEIVER"); }
            else                                { txt_BT_mode.setText("EMITTER"); }
            txt_BT_mode.show();
            ps_ptr<char> v;
            v.assignf("Vol: {:02}", bt_emitter.getVolume());
            dispFooter.updateFileNr(v);
            if (s_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            break;
        }
        case IR_SETTINGS:
            btn_IR_radio.show();
            break;
        case RINGING:
            if (s_volume.ringVolume > 0) { // alarm with bell
                pic_RI_logo.enable();
                showFileLogo(RINGING, subState);
                setTFTbrightness(s_brightness, s_bh1750Value);
                printfln(s_tag.action, ANSI_ESC_MAGENTA "Alarm");
                setVolume(s_volume.ringVolume);
                audio.setVolume(s_volume.ringVolume);
                muteChanged(false);
                connecttoFS("SD_MMC", "/ring/alarm_clock.mp3");
                clk_RI_24small.set_bg_color(TFT_BLACK);
                clk_RI_24small.show();
            } else { // alarm without bell
                s_f_eof_alarm = true;
            }
            break;

        case WIFI_SETTINGS:
            cls_wifiSettings.clearText();
            cls_wifiSettings.setFontSize(displayConfig.listFontSize);
            {
                if (lockWifiOps(pdMS_TO_TICKS(15000))) {
                    int16_t n = WiFi.scanNetworks();
                    printfln(s_tag.wifi_info, ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " WiFi networks found", n);
                    if(n <= 0) {
                        unlockWifiOps();
                        break;
                    }
                    for (int i = 0; i < n; i++) {
                        printfln(s_tag.wifi_info, ANSI_ESC_GREEN"{} ({})", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
                        ps_ptr<char> pw = get_WiFi_PW(WiFi.SSID(i).c_str());
                        cls_wifiSettings.add_WiFi_Items(WiFi.SSID(i).c_str(), pw.c_get());
                    }
                    WiFi.scanDelete();
                    unlockWifiOps();
                } else {
                    MWR_LOG_WARN("WiFi operation busy while opening WiFi settings");
                }
            }
            cls_wifiSettings.show();
            break;

        case SLEEP:
            dispHeader.hide();
            dispFooter.hide();
            if (subState == 0) {
                setTFTbrightness(s_brightness, s_bh1750Value);
            }
            if (subState == 1) {
                clk_CL_24.show();
            }
        break;
    }
    s_ir_btn_select = UNDEFINED;
    s_state = state;
}
// clang-format on
/*🟢🟡🔴*/
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

ps_ptr<char> get_WiFi_PW(const char* ssid) {
    ps_ptr<char> line;
    ps_ptr<char> password = "";

    for (int j = 0; j < kWifiSlotCount; j++) {
        line = wifiPrefGet(j);
        if (line.starts_with(ssid) && line[strlen(ssid)] == '\t') {
            int idx = line.index_of("\t", 0);
            password = line.substr(idx + 1);
        }
    }
    return password;
}

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    vTaskDelay(1);
#if MWR_LVGL_UI
    loopLvglRuntime();
    return;
#endif
    processUsbStorage();
    dlna.loop();
    audio.loop();
    if (!usbStorageBlocksSdAppAccess()) {
        webSrv.loop();
        ftpSrv.handleFTP();
    }
    if (IR_PIN >= 0) ir.loop();
    getTP().loop();
    ArduinoOTA.handle();
    bt_emitter.loop();
    getTFT().loop();
    BH1750.loop();
    playerService.tick();

    while (s_logBuffer.size() > 0) {
        size_t i = s_logBuffer.size();
        if (s_logBuffer[i - 1].strlen() > 0 && s_logBuffer[i - 1].strlen() < 1024) {
            webSrv.send("serTerminal=", s_logBuffer[i - 1].c_get());
        } else
            log_w("%s %i: strlen %i", __FILE__, __LINE__, s_logBuffer[i - 1].strlen());
        s_logBuffer.pop_back();
        if (s_logBuffer.size() == 0) s_logBuffer.clear(); // Löscht alle Elemente und gibt den Speicher frei
    }

    if (s_f_dlnaBrowseServer) {
        s_f_dlnaBrowseServer = false;
        dlna.browseServer(s_currDLNAsrvNr, s_dlnaHistory[s_dlnaLevel].objId.c_get(), s_totalNumberReturned);
    }
    if (s_f_clearLogo) {
        s_f_clearLogo = false;
        clearLogo();
    }
    if (s_f_clearStationName) {
        s_f_clearStationName = false;
        clearStationName();
    }

    if (s_f_playlistEnabled) {
        if (!audio.isRunning() && !s_f_pauseResume) { processPlaylist(); }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if (s_f_100ms) { // calls every 0.1 second
        s_f_100ms = false;

        if (s_state == RADIO && s_subState_radio == 0) VUmeter_RA.update(audio.getVUlevel());

        while (s_timeCounter.timer) {
            s_timeCounter.tmp--;
            if (s_timeCounter.tmp) break;
            s_timeCounter.tmp = s_timeCounter.factor;
            s_timeCounter.timer--;
            dispFooter.updateTC(s_timeCounter.timer);
            if (s_timeCounter.timer) break;

            // s_timeCounter.timer is 0
            if (volBox.is_enabled()) volBox.hide();
            if (s_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"
            if (s_state == RADIO) {
                if (!txt_RA_staName.is_enabled()) { txt_RA_staName.show(); } // assume volBox is shown
                if (s_subState_radio == 1) { changeState(RADIO, 0); }        // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                if (s_subState_radio == 2) { changeState(RADIO, 0); }        // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
            } else if (s_state == STATIONSLIST) {
                changeState(RADIO, 0);
            } else if (s_state == PLAYER) {
                if (!txt_PL_fName.is_enabled()) { txt_PL_fName.show(); } // assume volBox is shown
            } else if (s_state == AUDIOFILESLIST) {
                changeState(PLAYER, 0);
            } else if (s_state == DLNA) {
                if (!txt_DL_fName.is_enabled()) { txt_DL_fName.show(); } // assume volBox is shown
            } else if (s_state == DLNAITEMSLIST) {
                changeState(DLNA, 0);
            } else if (s_state == CLOCK) {
                changeState(CLOCK, 0);
            } else {
                ;
            } // all other, do nothing
        }

