pullead/esp32-hifi/src/main.cpp
        if (!s_f_rtc) { s_f_rtc = rtc.hasValidTime(); }
        // ------------------------------------------- volume / mute --------------------------------------------------------------------------------
        if (!s_f_mute) {
            if (audio.getVolume() != s_volume.cur_volume) { audio.setVolume(s_volume.cur_volume); }
        } else {
            if (audio.getVolume() != 0) { audio.setVolume(0); }
        }

        // ------------------------------------------- message box ----------------------------------------------------------------------------------
        if (s_f_msg_box) {                // messagebox is visible?
            if (s_timestamp < millis()) { // time to hide
                s_f_msg_box = false;
                msg_box.hide();
                if (s_f_esp_restart) { // restart after time
                    s_f_esp_restart = false;
                    ESP.restart();
                }
            }
        }
    }
    //----------------------------------------------------- 1 SEC ------------------------------------------------------------------------------------

    if (s_f_1sec) { // calls every second
        s_f_1sec = false;
        s_totalRuntime++;
        // for(int i = 0; i< 3; i++){
        //     uint8_t* sa = audio.getSpectrum();
        //     MWR_LOG_INFO("{}, {}, {}", sa[0], sa[1], sa[2]);
        // }
        uint16_t minuteOfTheDay = rtc.getMinuteOfTheDay();
        uint8_t  weekDay = rtc.getweekday();
        clk_CL_24.updateTime(minuteOfTheDay, weekDay);
        if (s_state == RINGING) clk_RI_24small.updateTime(minuteOfTheDay, weekDay);
        static uint8_t semaphore = 0;
        if (!semaphore) { s_f_alarm = isAlarm(weekDay, s_alarmdays, minuteOfTheDay, s_alarmtime) && s_f_rtc; } // alarm if rtc and CL green
        if (s_f_alarm) { semaphore++; }
        if (semaphore) { semaphore++; }
        if (semaphore >= 65) { semaphore = 0; }

        //------------------------------------------ALARM MANAGEMENT----------------------------------------------------------------------------------
        if (s_f_alarm) {
            s_f_alarm = false;
            if (s_f_sleeping) wake_up(RINGING, 0);
            else changeState(RINGING, 0);
        }
        if (s_f_eof_alarm) { // AFTER RINGING
            s_f_eof_alarm = false;
            if (!s_f_rtc) return;
            s_volume.cur_volume = s_volume.volumeAfterAlarm;
            changeState(RADIO, 0);
        }

        if (s_f_stationsChanged) {
            s_f_stationsChanged = false;
            staMgnt.updateStationsList();
        }
        //------------------------------------------UPDATE DISPLAY------------------------------------------------------------------------------------
        if (!s_f_sleeping || s_state == RINGING) {
            dispHeader.updateTime(s_time_s.c_get(), false);
            if (s_f_newBitRate) {
                s_f_newBitRate = false;
                dispFooter.updateBitRate(s_icyBitRate);
            }
            if (s_f_newStationName) {
                s_f_newStationName = false;
                showStationName();
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        static bool f_resume = false;
        if (s_f_timeSpeech) { // speech the time 7 sec before a new hour is arrived
            s_f_timeSpeech = false;
            ps_ptr<char> hh = s_time_s.substr(0, 2);
            int          hour = hh.to_uint32();
            hour++;
            if (hour == 24) hour = 0; //  extract the hour
            if (s_f_mute) return;
            if (s_f_sleeping) return;
            if (s_state != RADIO) return;
            if (s_f_timeAnnouncement) {
                f_resume = true;
                s_f_eof = false;
                ps_ptr<char> p;
                p.assignf("/voice_time/{}/{}_00.mp3", s_timeSpeechLang.c_get(), hour);
                connecttoFS("SD_MMC", p.c_get());
                return;
            } else {
                printfln(s_tag.action, "Time announcement at " ANSI_ESC_BG_CYAN "{}" ANSI_ESC_RESET " o'clock is silent", hour);
            }
        }
        if (f_resume && s_f_eof) {
            f_resume = false;
            s_f_eof = false;
            setStation(s_cur_station);
            return;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if (audio.isRunning()) {
            s_audioFileDuration = audio.getAudioFileDuration();
            if (s_audioFileDuration > 0) {
                s_audioCurrentTime = audio.getAudioCurrentTime();
                if (s_state == PLAYER && s_audioFileDuration) {
                    pgb_PL_progress.setNewMinMaxVal(0, s_audioFileDuration);
                    pgb_PL_progress.setValue(s_audioCurrentTime);
                }
                if (s_state == DLNA && s_audioFileDuration) {
                    pgb_DL_progress.setNewMinMaxVal(0, s_audioFileDuration);
                    pgb_DL_progress.setValue(s_audioCurrentTime);
                }
                if (s_audioFileDuration) {
                    printfcr(s_tag.action, ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "{}:{:02}s, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "{}:{:02}s      ", (long int)s_audioCurrentTime / 60, (long int)s_audioCurrentTime % 60, (long int)s_audioFileDuration / 60,
                             (long int)s_audioFileDuration % 60);
                }
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if (s_f_newStreamTitle && s_timeCounter.timer == 0) {
            s_f_newStreamTitle = false;
            if (s_state == RADIO) {
                if (s_streamTitle.strlen())
                    showStreamTitle(s_streamTitle);
                else if (s_icyDescription.strlen()) {
                    showStreamTitle(s_icyDescription);
                    s_f_newIcyDescription = false;
                    webSrv.send("icy_description=", s_icyDescription.c_get());
                } else {
                    txt_RA_sTitle.setText("");
                    txt_RA_sTitle.show();
                }
            }
            webSrv.send("streamtitle=", s_streamTitle.c_get());
        }
        if (s_f_newLyrics) {
            s_f_newLyrics = false;
            if (s_state == RADIO) showStreamTitle(s_lyrics);
            if (s_state == PLAYER) showPlayerFileName(s_lyrics.c_get());
            if (s_state == DLNA) show_DLNA_FileName(s_lyrics.c_get());
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if (s_f_newIcyDescription && s_timeCounter.timer == 0) {
            if (s_state == RADIO) {
                if (!s_streamTitle.strlen()) showStreamTitle(s_icyDescription);
            }
            webSrv.send("icy_description=", s_icyDescription.c_get());
            s_f_newIcyDescription = false;
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if (s_cur_Codec == 0) {
            uint8_t c = audio.getCodec();
            if (c != 0 && c < 8) { // unknown or OGG, guard: c {1 ... 7, 9}
                s_cur_Codec = c;
                printfln(s_tag.audio_codec, ANSI_ESC_YELLOW "{}", codecname[c]);
                if (s_state == PLAYER) showFileLogo(PLAYER, s_subState_player);
            }
        }
        //------------------------------------------CONNECT TO LASTHOST-------------------------------------------------------------------------------
        if (s_f_connectToLastStation) { // not used yet
            s_f_connectToLastStation = false;
            setStation(s_cur_station);
        }
        //----------------------------------------------SD RECORDER-----------------------------------------------------------------------------------
        if (s_f_recording) {
            // MWR_LOG_WARN("recording");
            if (audio.isRunning()) {
                if (!recorder.running) {
                    recorder.startRequested = true;
                    recorder.running = true;
                    printfln(s_tag.action, "Start recording");
                }
            }
        } else {
            if (recorder.running) {
                recorder.sampleRate = audio.getSampleRate();
                printfln(s_tag.action, "Stop recording");
                recorder.stopRequested = true;
                recorder.running = false;
            }
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if (s_f_reconnect && !s_f_isWiFiConnected) { // not used yet
            s_f_reconnect = false;
            connecttohost(s_settings.lastconnectedhost.get());
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if (s_f_dlnaSeekServer) {
            s_f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------CREATE DLNA PLAYLIST------------------------------------------------------------------------------
        if (s_f_dlnaMakePlaylistOTF && s_f_dlna_browseReady) {
            s_f_dlnaMakePlaylistOTF = false;
            s_f_dlna_browseReady = false;
            //    if( playlist.create_playlist_from_DLNA_folder()) s_f_playlistEnabled = true;
        }
        //------------------------------------------DLNA ITEMS RECEIVED-------------------------------------------------------------------------------
        if (s_f_dlna_browseReady) { // unused
            s_f_dlna_browseReady = false;
        }
        //-------------------------------------------WIFI DISCONNECTED?-------------------------------------------------------------------------------
        if (WiFi.isConnected() == false) {
            printfln(s_tag.wifi_info, ANSI_ESC_YELLOW "Reconnecting to WiFi...");
            dispHeader.updateRSSI(-86);
            s_f_WiFi_lost = true;
        } else {
            if (s_f_WiFi_lost) {
                s_f_WiFi_lost = false;
                if (s_state == RADIO) audio.connecttohost(s_settings.lastconnectedhost.get());
            }
        }
        s_f_WiFi_lost == false ? dispHeader.updateRSSI(WiFi.RSSI()) : dispHeader.updateRSSI(-86);
        dispFooter.updateAntenna(s_f_WiFi_lost);
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if (s_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    MWR_LOG_DEBUG("Br {}, Dur {}s", br, t);
        }
        //--------------------------------------------- BT EMITTER ----------------------------------------------------------------------------------
        if (s_bt_emitter.found) {
            btn_RA_bt.set_active(true);
            if (s_bt_emitter.enabled) {
                if (!s_f_sleeping) {
                    if (!bt_emitter.get_power_state()) bt_emitter.power_on(s_bt_emitter.mode.c_get());
                } else {
                    if (bt_emitter.get_power_state()) bt_emitter.power_off();
                }
            } else {
                if (bt_emitter.get_power_state()) { bt_emitter.power_off(); }
            }
            if (bt_emitter.getMode().equals("NA")) {
                ; // not ready yet
            } else if (bt_emitter.get_power_state() && !bt_emitter.getMode().equals(s_bt_emitter.mode)) {
                bt_emitter.setMode(s_bt_emitter.mode);
            }
        }
    } //  END s_f_1sec
    //------------------------------------------------------------------------------------------------------------------------------------------------
    if (s_f_10sec == true) { // calls every 10 seconds
        s_f_10sec = false;
        // if(s_state == RADIO && !s_icyBitRate && !s_f_sleeping) {
        //     s_decoderBitRate = audio.getBitRate();
        //     static uint32_t oldBr = 0;
        //     if(s_decoderBitRate != oldBr){
        //         oldBr = s_decoderBitRate;
        //         dispFooter.updateBitRate(s_decoderBitRate);
        //     }
        // }
        updateSettings();
    }

    if (s_f_1min == true) { // calls every minute
        s_f_1min = false;
        if (s_sleeptime) {
            s_sleeptime--;
            if (!s_sleeptime) fall_asleep();
            dispFooter.updateOffTime(s_sleeptime);
        }
        // static uint8_t btEmitterCnt = 0;
        // if (!s_bt_emitter.found && btEmitterCnt < 1) {
        //     btEmitterCnt++;
        //     bt_emitter.begin(); // if the emitter has not yet responded
        // }
    }

