pullead/esp32-hifi/src/main.cpp
    //-------------------------------------------------DEBUG / WIFI_SETTINGS ----------------------------------------------------------------------------------
    if (Serial.available()) { // input: serial terminal

        String r = Serial.readString();
        r.replace("\n", "");
        printfln(s_tag.terminal, ANSI_ESC_YELLOW "{}", r.c_str());
        if (r.startsWith("pr")) {
            if (audioPauseResumeAndUpdateState()) {
                printfln(s_tag.terminal, ANSI_ESC_YELLOW "Pause-Resume");
            } else {
                printfln(s_tag.terminal, ANSI_ESC_YELLOW "Pause-Resume not possible");
            }
        }
        if (r.startsWith("hc")) { // A make_hardcopy_on_sd of the display is created and written to the SD card
            { printfln(s_tag.terminal, ANSI_ESC_YELLOW "create hardcopy"); }
            make_hardcopy_on_sd();
        }
        if (r.startsWith("rts")) { // run time stats
            char* timeStatsBuffer = x_ps_calloc(2000, sizeof(char));
            GetRunTimeStats(timeStatsBuffer);
            { printfln(s_tag.terminal, ANSI_ESC_YELLOW "task statistics\n\n{}", timeStatsBuffer); }
            x_ps_free(&timeStatsBuffer);
        }
        if (r.startsWith("cts")) { // connect to speech
            audio.connecttospeech("Hallo, wie geht es dir? Morgen scheint die Sonne und übermorgen regnet es.Aber wir nehmen den Regenschirm mit. Und auch den Rucksack. Dann lesen wir aus dem Buch "
                                  "Hier gibt es nur gutes Wetter.",
                                  "de");
            //    audio.connecttospeech("Hallo", "de");
        }

        if (r.startsWith("bfi")) { // buffer filled
            printfln(s_tag.terminal, "inBuffer filled {} bytes", (long unsigned)audio.inBufferFilled());
            printfln(s_tag.terminal, "inBuffer free   {} bytes", (long unsigned)audio.inBufferFree());
        }
        if (r.startsWith("st")) { // testtext for streamtitle
            if (r[2] == '0') s_streamTitle = "A Ё Ю";
            if (r[2] == '1') s_streamTitle = "A B C D E F G";
            if (r[2] == '2') s_streamTitle = "A B C D E F G H I";
            if (r[2] == '3') s_streamTitle = "A B C D E F G H I J K L";
            if (r[2] == '4') s_streamTitle = "A B C D E F G H I J K J M Q O";
            if (r[2] == '5') s_streamTitle = "A B C D E F G H I K L J M y O P Q R";
            if (r[2] == '6')
                s_streamTitle = "A B C D E F G H I K L J M g O P Q R S T V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S T "
                                "U V W K J Q p O P Q R S T U V W K J Q V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S T U "
                                "V W K J Q p O P Q R S T U V W K J Q";
            if (r[2] == '7')
                s_streamTitle = "A B C D E F G H I K L J M j O P Q R S T U V A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q A B C D E F G H I K L J M p O P Q R S "
                                "T U V W K J Q p O P Q R S T U V W K J Q";
            if (r[2] == '8') s_streamTitle = "A B C D E F G H I K L J M p O P Q R S T U V W A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q";
            if (r[2] == '9') s_streamTitle = "A B C D E F G H I K L J M p O P Q R S T U V W K J Q p O P Q R S T U V W K J Q";
            printfln(s_tag.terminal, "st: {}", s_streamTitle.c_get());
            s_f_newStreamTitle = true;
        }
        if (r.startsWith("ais")) { // openAIspeech
            printfln(s_tag.terminal, "openAI speech");
            //    audio.openai_speech("openAI-key", "tts-1", "Today is a wonderful day to build something people love!", "", "shimer", "mp3", "1");
        }
        if (r.startsWith("ctfs")) { // connecttoFS
                                    //     MWR_LOG_INFO("SPIFFS");
            connecttoFS("SD", "/Collide.ogg");
        }
        if (r.startsWith("pl")) { // temp debug: play local library track N, e.g. "pl0"
            const uint16_t idx = static_cast<uint16_t>(r.substring(2).toInt());
            LocalTrackItem item{};
            const bool haveItem = playerCoreLocalTrack(idx, &item);
            printfln(s_tag.terminal, "pl{}: haveItem={} path={} title={}", idx, haveItem, haveItem ? item.path : "?", haveItem ? item.title : "?");
            const bool started = playerService.playLocalTrack(idx);
            printfln(s_tag.terminal, "pl{}: playLocalTrack started={}", idx, started);
        }
        if (r.startsWith("stoff")) { // setTimeOffset
            int32_t t = r.substring(3, r.length() - 1).toInt();
            printfln(s_tag.terminal, "setTimeOffset {}", t);
            audio.setTimeOffset(t);
        }

        if (r.startsWith("sapt")) { // setAudioPlayTime
            uint32_t t = r.substring(4, r.length()).toInt();
            printfln(s_tag.terminal, "setAudioPlayTime {}", t);
            audio.setAudioPlayTime(t);
        }

        if (r.startsWith("gafp")) { // getAudioFilePosition
            printfln(s_tag.terminal, "getAudioFilePosition {}", audio.getAudioFilePosition());
        }

        if (r.startsWith("safp")) { // setAudioFilePosition
            uint32_t t = r.substring(4, r.length()).toInt();
            printfln(s_tag.terminal, "setAudioFilePosition {}", t);
            audio.setAudioFilePosition(t);
        }

        if (r.startsWith("grn")) { // list of all self registered objects
            get_registered_names();
        }
        if (r.startsWith("fm")) { // force mono
            static bool f_mono = false;
            f_mono = !f_mono;
            audio.forceMono(f_mono);
            if (f_mono)
                printfln(s_tag.terminal, "mono");
            else
                printfln(s_tag.terminal, "stereo");
        }
        if (r.startsWith("sm")) { // force mono
            static bool f_mute = false;
            f_mute = !f_mute;
            audio.setMute(f_mute);
            if (f_mute)
                printfln(s_tag.terminal, "mute on");
            else
                printfln(s_tag.terminal, "mute off");
        }
        if (r.startsWith("o48")) { // output48KHz
            static bool f_o48 = false;
            f_o48 = !f_o48;
            if (f_o48) {
                audio.setOutputSampleRate(Audio::SR_48000);
                printfln(s_tag.terminal, "output 48KHz");
            } else {
                audio.setOutputSampleRate(Audio::SR_ORIGIN);
                printfln(s_tag.terminal, "normal output {} Hz", audio.getSampleRate());
            }
        }
        if (r.startsWith("o44")) { // output48KHz
            static bool f_o44 = false;
            f_o44 = !f_o44;
            if (f_o44) {
                audio.setOutputSampleRate(Audio::SR_44100);
                printfln(s_tag.terminal, "output 44.1KHz");
            } else {
                audio.setOutputSampleRate(Audio::SR_ORIGIN);
                printfln(s_tag.terminal, "normal output {} Hz", audio.getSampleRate());
            }
        }
        if (r.startsWith("btp")) { // bluetooth RX/TX protocol
            bt_emitter.list_protokol();
        }
        if (r.startsWith("btstr")) { // bluetooth string, send to bt emitter e.g. btstr:AT+
            bt_emitter.userCommand(r.substring(6, r.length() - 1).c_str());
            printfln(s_tag.terminal, "btstr: {}", r.substring(6, r.length() - 1).c_str());
        }
        if (r.startsWith("tsp")) { s_f_timeSpeech = true; }
        if (r.startsWith("pwd")) { // set password for WiFi
            changeState(WIFI_SETTINGS, 0);
        }
        if (r.startsWith("gif")) { // draw gif image
            printfln(s_tag.terminal, "gif");
            drawImage("/common/Tom_Jerry.gif", 100, 100);
        }
        static uint32_t time = 0;
        if (r.startsWith("stops")) { // stop song
            time = audio.stopSong();
            printfln(s_tag.terminal, "file {} stopped at time {}", s_cur_AudioFileName.c_get(), time);
        }
        if (r.startsWith("starts")) { // start song
            ps_ptr<char> path = "/audiofiles/" + s_cur_AudioFileName;
            bool         ret = audio.connecttoFS(SD_MMC, path.c_get(), time);
            printfln(s_tag.terminal, "file {} started at time {}, ret {}", s_cur_AudioFileName.c_get(), time, ret);
        }

        if (r.startsWith("gbr")) { // get bitrate
            uint32_t br = audio.getBitRate();
            printfln(s_tag.terminal, "bitrate: {}", br);
        }
        if (r.startsWith("ibs")) { // inbuff status
            audio.inBufferStatus();
        }
        if (r.startsWith("ir")) { // is running?
            printfln(s_tag.terminal, "is running: {}", audio.isRunning());
        }
        if (r.startsWith("vfs")) { // volume fading speed
            float t = r.substring(3, r.length() - 1).toFloat();
            printfln(s_tag.terminal, "set volume fading speed {}, current: {}", t, audio.settings.VOL_FADING_SPEED);
            audio.settings.VOL_FADING_SPEED = t;
        }
    }
}

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                  E V E N T S                                                                                ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

