pullead/esp32-hifi/src/main.cpp
// Events from audioI2S library
void my_audio_info(Audio::msg_t m) {
    switch (m.e) {
        case Audio::evt_info:
            if (endsWith(m.msg, "failed!")) {
                playerService.onError(m.msg);
                printflnCut(s_tag.audio_info, "", ANSI_ESC_YELLOW, m.msg);

                s_streamTitle.assignf(ANSI_ESC_ORANGE "{}", m.msg);
                s_f_newStreamTitle = true;
                s_f_webFailed = true;
                return;
            }
            if (startsWith(m.msg, "FLAC")) {
                printflnCut(s_tag.audio_info, "", ANSI_ESC_GREEN, m.msg);
                return;
            }
            if (endsWith(m.msg, "Stream lost")) {
                printflnCut(s_tag.audio_info, "", ANSI_ESC_YELLOW, m.msg);
                return;
            }
            if (startsWith(m.msg, "authent")) {
                printflnCut(s_tag.audio_info, "", ANSI_ESC_GREEN, m.msg);
                return;
            }
            if (startsWith(m.msg, "StreamTitle=")) { return; }
            if (startsWith(m.msg, "BitsPerSample")) {
                // es8311.setBitsPerSample(m.arg1);
            }
            if (startsWith(m.msg, "SampleRate (Hz)")) {
                // es8311.setSampleRate(m.arg1);
            }
            if (startsWith(m.msg, "HTTP/") && m.msg[9] > '3') {
                printflnCut(s_tag.audio_info, "", ANSI_ESC_RED, m.msg);
                return;
            }
            if (startsWith(m.msg, "ERROR:")) {
                playerService.onError(m.msg);
                printflnCut(s_tag.audio_info, "", ANSI_ESC_RED, m.msg);
                return;
            }
            if (CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_WARN) {
                printfln(s_tag.audio_info, ANSI_ESC_GREEN "{}", m.msg);
                return;
            } // all other
            break;

        case Audio::evt_name:
            s_stationName_air = m.msg; // set max length
            playerService.onMetadata(m.msg, nullptr);
            printfln(s_tag.audio_info, "StationName: " ANSI_ESC_MAGENTA "{}", m.msg);
            s_f_newStationName = true;
            break;

        case Audio::evt_streamtitle:
            s_streamTitle = m.msg;
            playerService.onMetadata(nullptr, m.msg);
            printfln(s_tag.audio_info, "StreamTitle: " ANSI_ESC_YELLOW "{}", m.msg);
            s_f_newStreamTitle = true;
            break;

        case Audio::evt_eof:
            playerService.onEndOfFile();
            ++s_eofCount; // see PlayerSnapshot::eofCount
            s_f_isWebConnected = false;
            s_f_eof = true;
            s_f_isFSConnected = false;
            printflnCut(s_tag.audio_info, "end of file: ", ANSI_ESC_YELLOW, m.msg);
            if (s_state == PLAYER) {
                webSrv.send("SD_playFile=", "end of audiofile");
                if (!s_f_playlistEnabled) {
                    //    s_f_clearLogo = true;
                    //    s_f_clearStationName = true;
                    changeState(PLAYER, 0);
                }
            }
            if (s_state == RADIO) {}
            if (s_state == DLNA) {
                txt_DL_fName.setText("");
                txt_DL_fName.show();
                btn_DL_pause.setActive(false);
                btn_DL_pause.show();
            }
            if (s_state == RINGING) {
                if (startsWith(m.msg, "alarm")) s_f_eof_alarm = true;
            }
            s_f_eof = true;
            break;

        case Audio::evt_lasthost:
            if (s_f_playlistEnabled) return;
            if (s_state == RADIO) s_settings.lastconnectedhost.assign(m.msg);
            printflnCut(s_tag.audio_info, "lastURL: ", ANSI_ESC_YELLOW, m.msg);
            webSrv.send("stationURL=", m.msg);
            break;

        case Audio::evt_icyurl:
            if (strlen(m.msg) > 5) {
                printflnCut(s_tag.audio_info, "icy-url: ", ANSI_ESC_YELLOW, m.msg);
                s_homepage = m.msg;
                if (!s_homepage.starts_with("http")) s_homepage = "http://" + s_homepage;
            }
            break;

        case Audio::evt_icylogo:
            if (strlen(m.msg) > 5) { printflnCut(s_tag.audio_info, "icy-logo: ", ANSI_ESC_RESET, m.msg); }
            break;

        case Audio::evt_id3data: printfln(s_tag.audio_info, "id3data: " ANSI_ESC_GREEN "{}", m.msg); break;

        case Audio::evt_image:
            for (int i = 0; i < m.vec.size(); i += 2) { printfln(s_tag.audio_info, "CoverImage: " ANSI_ESC_GREEN "segment {:02}, pos {:08}, len {:08}", i / 2, m.vec[i], m.vec[i + 1]); }
            break;

        case Audio::evt_icydescription:
            s_icyDescription = m.msg;
            s_f_newIcyDescription = true;
            if (strlen(m.msg)) printfln(s_tag.audio_info, "icy-descr: " ANSI_ESC_YELLOW "{}", m.msg);
            break;

        case Audio::evt_bitrate:
            if (!strlen(m.msg)) return; // guard
            s_icyBitRate = str2int(m.msg);
            s_f_newBitRate = true;
            printfln(s_tag.audio_info, "bitRate: " ANSI_ESC_CYAN "{}", s_icyBitRate);
            break;

        case Audio::evt_lyrics:
            printfln(s_tag.audio_info, "sync lyrics: " ANSI_ESC_YELLOW "{}", m.msg);
            s_lyrics = m.msg;
            s_f_newLyrics = true;
            break;

        case Audio::evt_genre: printfln(s_tag.audio_info, "genre: " ANSI_ESC_YELLOW "{}", m.msg); break;

        case Audio::evt_log: printfln(m.s, "{}", m.msg); break;

        default: printfln("message", "{}", m.msg); break;
    }
}

// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// void audio_process_i2s(int32_t* outBuff, int16_t validSamples, bool* continueI2S) {

//     int16_t* buff16 = reinterpret_cast<int16_t*>(outBuff);

//     int16_t sineWaveTable[44] = {
//          0,   3743,   7377,  10793,  14082,  17136,  19848,  22113,  23825,  24908,
//       25311,  24908,  23825,  22113,  19848,  17136,  14082,  10793,   7377,   3743,
//          0,  -3743,  -7377, -10793, -14082, -17136, -19848, -22113, -23825, -24908,
//      -25311, -24908, -23825, -22113, -19848, -17136, -14082, -10793,  -7377,  -3743
//     };

//     static uint8_t tabPtr = 0;
//     for(int i= 0; i < validSamples; i++){
//        buff16[i * 4 + 1] += sineWaveTable[tabPtr] /50; // channel left
//        buff16[i * 4 + 3] += sineWaveTable[tabPtr] /50; // channel right
//         tabPtr++;
//         if(tabPtr == 44) tabPtr = 0;
//     }
//     *continueI2S = true;
// }
// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void on_BH1750(int32_t ambVal) { //--AMBIENT LIGHT SENSOR BH1750--
    int16_t bh1750Value = 0;
    s_bh1750Value = map_l(ambVal, 0, 1600, displayConfig.brightnessMin, displayConfig.brightnessMax);
    MWR_LOG_DEBUG("ambVal {}, bh1750Value {}, s_brightness {}", ambVal, bh1750Value, s_brightness);
    setTFTbrightness(s_brightness, s_bh1750Value);
}
// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void ftp_debug(const char* info) {
    if (startsWith(info, "File Name")) return;
    printfln(s_tag.ftp_server, "{}", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from rtime library
void RTIME_info(const char* info) {
    printfln(s_tag.rtime_info, "{}", info);
}
// Events from tft library
void tft_info(const char* info) {
    printfln(s_tag.tft_info, "{}", info);
}
// Events from tp library
void tp_info(const char* info) {
    printfln(s_tag.tp_info, "{}", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from IR Library
void ir_code(uint8_t addr, uint8_t cmd) {
    printfln(s_tag.ir_info, "ir_code: " ANSI_ESC_YELLOW "IR address " ANSI_ESC_BLUE "0x{:02X}, " ANSI_ESC_YELLOW "IR command " ANSI_ESC_BLUE "0x{:02X}", addr, cmd);
    char buf[20];
    sprintf(buf, "0x%02x", addr);
    webSrv.send("IR_address=", buf);
    sprintf(buf, "0x%02x", cmd);
    webSrv.send("IR_command=", buf);
}

void ir_res(uint32_t res) {
    if (s_state != RADIO) return;
    if (s_f_sleeping == true) return;
    printfln(s_tag.ir_info, "ir_result: " ANSI_ESC_YELLOW "Stationnumber " ANSI_ESC_BLUE "{}", (long unsigned)res);
    nbr_RA_staBox.hide();
    setStationByNumber(res);
    return;
}
void ir_number(uint16_t num) {
    if (s_state != RADIO) return;
    if (s_f_sleeping) return;
    nbr_RA_staBox.enable();
    nbr_RA_staBox.setNumbers(num);
    nbr_RA_staBox.show(TFT_ORANGE);
}

void ir_released(int8_t key) {
    printfln(s_tag.ir_info, "ir_code: " ANSI_ESC_YELLOW "released ir key nr: " ANSI_ESC_BLUE "{:02}, <{}>", key, ir_symbols[key]);
    tp_released(0, 0);
    return;
}
// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void ir_long_key(int8_t key) {
    printfln(s_tag.ir_info, "ir_code: " ANSI_ESC_YELLOW "long pressed ir key nr: " ANSI_ESC_BLUE "{:02}, <{}>", key, ir_symbols[key]);
    if (key == 16) {
        if (!s_f_sleeping)
            fall_asleep(); // long OK
        else
            wake_up(RADIO, 0);
    }
}
// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// clang-format off
void ir_short_key(int8_t key) {
    s_f_ok_from_ir = false;
    printfln(s_tag.ir_info, "ir_code: " ANSI_ESC_YELLOW "short pressed ir key nr: " ANSI_ESC_BLUE "{:02}, <{}>", key, ir_symbols[key]);
    if (s_f_sleeping == true && key != 20) return;
    if (s_state == IR_SETTINGS) return; // nothing todo

