pullead/esp32-hifi/src/main.cpp
    switch (key) {
        case 10: // MUTE  ----------------------------------------------------------------------------------------------------------------------------
            muteChanged(!s_f_mute);
            return;
        case 11: // ARROW RIGHT  ---------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                if (s_subState_radio == 0) { nextFavStation(); } // NEXT STATION
                if (s_subState_radio == 2) { set_ir_pos_RA(IR_RIGHT); setTimeCounter(2); } // scroll right
                return;
            }
            if (s_state == STATIONSLIST) { // next page
                lst_RADIO.nextPage(); setTimeCounter(LIST_TIMER);
                break;
            }
            if (s_state == PLAYER) {
                set_ir_pos_PL(IR_RIGHT); // scroll right
                return;
            }
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.nextPage();
                setTimeCounter(LIST_TIMER);
                return; // next page
            }
            if (s_state == DLNA) {
                set_ir_pos_DL(IR_RIGHT); // scroll forward (mute, pause, cancel, prev, next)
                return;
            }
            if (s_state == DLNAITEMSLIST) {
                lst_DLNA.nextPage(); setTimeCounter(LIST_TIMER); return; // nextpage
            }
            if (s_state == CLOCK) {
                if (s_subState_clock == 1) { // scroll backward (alarm, radio, mute, off)
                    set_ir_pos_CL(IR_RIGHT); // scroll right
                    setTimeCounter(2);
                }
                return;
            }
            if (s_state == ALARMCLOCK) {
                set_ir_pos_AC(IR_RIGHT); // scroll forward (left, right, up, down, ready)
                return;
            }
            if (s_state == SLEEPTIMER) {
                set_ir_pos_SL(IR_RIGHT); // scroll forward (up, down, ready, cancel)
                return;
            }
            if (s_state == SETTINGS) {
                set_ir_pos_SE(IR_RIGHT); // scroll forward (bright, equal, wifi, radio)
                return;
            }
            if (s_state == BRIGHTNESS) {
                s_brightness += 5;
                s_brightness = clamp_min_max(s_brightness, displayConfig.brightnessMin, displayConfig.brightnessMax);
                sdr_BR_value.setValue(s_brightness);
            }
            if (s_state == EQUALIZER) { // scroll forward (radio, player, mute)
                if(s_ir_btn_select < 3) set_ir_pos_EQ(IR_RIGHT);
                else {
                    if (s_ir_btn_select == 3) { sdr_EQ_balance.setValue(sdr_EQ_balance.getValue() + 1);   setI2STone();} // balance
                    if (s_ir_btn_select == 4) { sdr_EQ_lowPass.setValue(sdr_EQ_lowPass.getValue() + 1);   setI2STone();} // lowpass
                    if (s_ir_btn_select == 5) { sdr_EQ_bandPass.setValue(sdr_EQ_bandPass.getValue() + 1); setI2STone();} // bandpass
                    if (s_ir_btn_select == 6) { sdr_EQ_highPass.setValue(sdr_EQ_highPass.getValue() + 1); setI2STone();} // highpass
                }
            }
            if (s_state == BLUETOOTH) { // scroll forward (bright, equal, radio)
                set_ir_pos_BT(IR_RIGHT);
            }
            break;
        case 12: // ARROW LEFT  ----------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                if (s_subState_radio == 0) { prevFavStation(); return; } // PREV STATION
                if (s_subState_radio == 2) { set_ir_pos_RA(IR_LEFT);  setTimeCounter(2);  return; } // scroll left
            }
            if (s_state == STATIONSLIST) {
                lst_RADIO.prevPage();
                setTimeCounter(LIST_TIMER);
                return;
            } // prev page
            if (s_state == PLAYER) {
                if(s_subState_player == 0){ // scroll backward (prev file, next file, ready, play all, shuffle, file list, radio, off)
                    set_ir_pos_PL(IR_LEFT); setTimeCounter(2);
                    return;
                }
                if(s_subState_player == 1){ // scroll backward (mute, pause, cancel, prev, next)
                    set_ir_pos_PL(IR_LEFT); setTimeCounter(2);
                    return;
                }
            }
            if (s_state == AUDIOFILESLIST) { // prev page
                lst_PLAYER.prevPage();
                setTimeCounter(LIST_TIMER);
                break;
            }
            if (s_state == DLNA) { // scroll backward (mute, pause, cancel, prev, next)
                set_ir_pos_DL(IR_LEFT);
                return;
            }
            if (s_state == DLNAITEMSLIST) { // prev page
                lst_DLNA.prevPage(); setTimeCounter(LIST_TIMER); return;
            }
            if (s_state == CLOCK) {
                if (s_subState_clock == 1) { // scroll backward (alarm, radio, mute, off)
                    set_ir_pos_CL(IR_LEFT);
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == ALARMCLOCK) { // scroll backward (left, right, up, down, ready)
                    set_ir_pos_AC(IR_LEFT);
                    return;
            }
            if (s_state == SLEEPTIMER) { // scroll backward (up, down, ready, cancel)
                    set_ir_pos_SL(IR_LEFT);
                    return;
            }
            if (s_state == SETTINGS) { // scroll forward (bright, equal, radio)
                    set_ir_pos_SE(IR_LEFT);
                    return;
            }
            if (s_state == BRIGHTNESS) {
                s_brightness -= 5;
                s_brightness = clamp_min_max(s_brightness, displayConfig.brightnessMin, displayConfig.brightnessMax);
                sdr_BR_value.setValue(s_brightness);
                setTimeCounter(2);
                return;
            }
            if (s_state == EQUALIZER) { // scroll backward (radio, player, mute)
                if(s_ir_btn_select < 3) set_ir_pos_EQ(IR_LEFT);
                else {
                    if (s_ir_btn_select == 3) { sdr_EQ_balance.setValue(sdr_EQ_balance.getValue() - 1);   setI2STone();} // balance
                    if (s_ir_btn_select == 4) { sdr_EQ_lowPass.setValue(sdr_EQ_lowPass.getValue() - 1);   setI2STone();} // lowpass
                    if (s_ir_btn_select == 5) { sdr_EQ_bandPass.setValue(sdr_EQ_bandPass.getValue() - 1); setI2STone();} // bandpass
                    if (s_ir_btn_select == 6) { sdr_EQ_highPass.setValue(sdr_EQ_highPass.getValue() - 1); setI2STone();} // highpass
                }
            }
            if (s_state == BLUETOOTH) { // scroll forward (bright, equal, radio)
                set_ir_pos_BT(IR_LEFT);
            }
            break;
        case 13: // ARROW DOWN  ----------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == STATIONSLIST) {
                lst_RADIO.nextStation();
                setTimeCounter(LIST_TIMER);
                break;
            } // station++
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.nextFile();
                setTimeCounter(LIST_TIMER);
                break;
            } // file++
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                downvolume(); // VOLUME--
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            }
                if(s_state == DLNAITEMSLIST){lst_DLNA.nextItem(); setTimeCounter(LIST_TIMER); return;} // item++
            if (s_state == CLOCK) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == SLEEPTIMER) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == EQUALIZER) {
                set_ir_pos_EQ(IR_DOWN);
                break;
            }
            break;
        case 14: // ARROW UP  ------------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == STATIONSLIST) {
                lst_RADIO.prevStation();
                setTimeCounter(LIST_TIMER);
                break;
            } // station--
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.prevFile();
                setTimeCounter(LIST_TIMER);
                break;
            } // file-
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                upvolume(); // VOLUME++
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                break;
            }
            if(s_state == DLNAITEMSLIST) { lst_DLNA.prevItem(); setTimeCounter(LIST_TIMER); return; } // item++
            if (s_state == CLOCK) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == SLEEPTIMER) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == EQUALIZER) {
                set_ir_pos_EQ(IR_UP);
                return;
            }
            break;
        case 15: // MODE  ----------------------------------------------------------------------------------------------------------------------------
            if (s_state == SLEEPTIMER) {
                setStation(s_cur_station);
                changeState(RADIO, 0);
                break;
            }
            if (s_state == RADIO) {
                changeState(STATIONSLIST, 0);
                setTimeCounter(40);
                break;
            }
            if (s_state == STATIONSLIST) {
                changeState(PLAYER, 0);
                break;
            }
            if (s_state == PLAYER) {
                changeState(AUDIOFILESLIST, 0);
                break;
            }
            if (s_state == AUDIOFILESLIST) {
                changeState(DLNA, 0);
                break;
            }
            if (s_state == DLNA) {
                changeState(CLOCK, 0);
                break;
            }
            if (s_state == CLOCK) {
                s_sleepTimerSubMenue = 0;
                changeState(SLEEPTIMER, 0);
                break;
            }
            break;
        case 16: // OK -------------------------------------------------------------------------------------------------------------------------------
            s_f_ok_from_ir = true;
            if (s_state == RADIO) {
                if (s_subState_radio == 2) {
                    if (s_ir_btn_select == 0) { btn_RA_staList.click(); }
                    if (s_ir_btn_select == 1) { btn_RA_player.click(); }
                    if (s_ir_btn_select == 2) { btn_RA_dlna.click(); }
                    if (s_ir_btn_select == 3) { btn_RA_clock.click(); }
                    if (s_ir_btn_select == 4) { btn_RA_sleep.click(); }
                    if (s_ir_btn_select == 5) { btn_RA_settings.click(); }
                    if (s_ir_btn_select == 6) { btn_RA_bt.click(); }
                    if (s_ir_btn_select == 7) { btn_RA_off.click(); }
                } else {
                    changeState(RADIO, 2);
                    s_ir_btn_select = 0;
                    set_ir_pos_RA(0);
                }
                break;
            }
            if (s_state == STATIONSLIST) {
                setStationByNumber(lst_RADIO.getSelectedStation());
                changeState(RADIO, 0);
                break;
            }
            if (s_state == PLAYER) {
                if (s_subState_player == 0) {
                    if (s_ir_btn_select == 0) { btn_PL_prevFile.click(); }
                    if (s_ir_btn_select == 1) { btn_PL_nextFile.click(); }
                    if (s_ir_btn_select == 2) { btn_PL_ready.click(); }
                    if (s_ir_btn_select == 3) { btn_PL_playAll.click(); }
                    if (s_ir_btn_select == 4) { btn_PL_shuffle.click(); }
                    if (s_ir_btn_select == 5) { btn_PL_fileList.click(); }
                    if (s_ir_btn_select == 6) { btn_PL_radio.click(); }
                    if (s_ir_btn_select == 7) { btn_PL_off.click(); }
                }
                else if(s_subState_player == 1) {
                    if (s_ir_btn_select == 0) { btn_PL_mute.click(); }
                    if (s_ir_btn_select == 1) { btn_PL_pause.click(); }
                    if (s_ir_btn_select == 2) { btn_PL_cancel.click(); }
                    if (s_ir_btn_select == 3) { btn_PL_playPrev.click(); }
                    if (s_ir_btn_select == 4) { btn_PL_playNext.click(); }
                }
                if(s_ir_btn_select == -1){ s_ir_btn_select = 0; set_ir_pos_PL(0); }
                break;
            }
            if (s_state == AUDIOFILESLIST) {
                ps_ptr<char> r = lst_PLAYER.getSelectedFile();
                if (r != "") {
                    stopSong();
                    SD_playFile(lst_PLAYER.getSelectedFilePath(), 0, true);
                    s_cur_AudioFileNr = lst_PLAYER.getSelectedFileNr();
                }
                break;
            }
            if (s_state == DLNA) {
                if (s_ir_btn_select == 0) { btn_DL_mute.click(); }
                if (s_ir_btn_select == 1) { btn_DL_pause.click(); }
                if (s_ir_btn_select == 2) { btn_DL_cancel.click(); }
                if (s_ir_btn_select == 3) { btn_DL_fileList.click(); }
                if (s_ir_btn_select == 4) { btn_DL_radio.click(); }
                if (s_ir_btn_select == -1){ s_ir_btn_select = 0; set_ir_pos_DL(0); }
                break;
            }
            if(s_state == DLNAITEMSLIST) {
                ps_ptr<char> r = lst_DLNA.getSelectedURL();
                if(r) { txt_DL_fName.setTextColor(TFT_CYAN); txt_DL_fName.setText(lst_DLNA.getSelectedTitle()); changeState(DLNA, 0); connecttohost(r); }
                else setTimeCounter(2);
                break;
            }
            if (s_state == CLOCK) {
                if (s_subState_clock == 0) {
                    changeState(CLOCK, 1);
                    setTimeCounter(2);
                    if(s_ir_btn_select == -1){ s_ir_btn_select = 0; set_ir_pos_CL(0); }
                    break;
                }
                if (s_subState_clock == 1) {
                    if (s_ir_btn_select == 0) { btn_CL_alarm.click(); }
                    if (s_ir_btn_select == 1) { btn_CL_radio.click(); }
                    if (s_ir_btn_select == 2) { btn_CL_mute.click(); }
                    if (s_ir_btn_select == 3) { btn_CL_off.click(); }
                }
                break;
            }
            if (s_state == ALARMCLOCK) {
                    if (s_ir_btn_select == 0) { btn_AC_left.click(); }
                    if (s_ir_btn_select == 1) { btn_AC_right.click(); }
                    if (s_ir_btn_select == 2) { btn_AC_up.click(); }
                    if (s_ir_btn_select == 3) { btn_AC_down.click(); }
                    if (s_ir_btn_select == 4) { btn_AC_ready.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_AC(0); }
                    break;
            }
            if (s_state == SLEEPTIMER) {
                    if (s_ir_btn_select == 0) { btn_SL_up.click(); }
                    if (s_ir_btn_select == 1) { btn_SL_down.click(); }
                    if (s_ir_btn_select == 2) { btn_SL_ready.click(); }
                    if (s_ir_btn_select == 3) { btn_SL_cancel.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_SL(0); }
                    break;
            }
            if (s_state == SETTINGS) {
                    if (s_ir_btn_select == 0) { btn_SE_bright.click(); }
                    if (s_ir_btn_select == 1) { btn_SE_equal.click(); }
                    if (s_ir_btn_select == 2) { btn_SE_wifi.click(); }
                    if (s_ir_btn_select == 3) { btn_SE_radio.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_SE(0); }
                    break;
            }
            if (s_state == BRIGHTNESS) {
                    if (s_ir_btn_select == 0) { btn_BR_ready.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_BR(0); }
                    break;
            }
            if (s_state == EQUALIZER) {
                    if (s_ir_btn_select == 0) { btn_EQ_Radio.click(); }
                    if (s_ir_btn_select == 1) { btn_EQ_Player.click(); }
                    if (s_ir_btn_select == 2) { btn_EQ_mute.click(); }
                    if (s_ir_btn_select == 3) { btn_EQ_balance.click(); }
                    if (s_ir_btn_select == 4) { btn_EQ_lowPass.click(); }
                    if (s_ir_btn_select == 5) { btn_EQ_bandPass.click(); }
                    if (s_ir_btn_select == 6) { btn_EQ_highPass.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_EQ(0); }
                    break;
            }
            if (s_state == BLUETOOTH) {
                    if (s_ir_btn_select == 0) { btn_BT_volDown.click(); }
                    if (s_ir_btn_select == 1) { btn_BT_volUp.click(); }
                    if (s_ir_btn_select == 2) { btn_BT_pause.click(); }
                    if (s_ir_btn_select == 3) { btn_BT_mode.click(); }
                    if (s_ir_btn_select == 4) { btn_BT_radio.click(); }
                    if (s_ir_btn_select == 5) { btn_BT_power.click(); }
                    if(s_ir_btn_select == -1) { s_ir_btn_select = 0; set_ir_pos_BT(0); }
                    break;
            }
            break;
        case 18: // PAUSE/RESUME  --------------------------------------------------------------------------------------------------------------------
            if (s_state == PLAYER) {
                if (s_f_isFSConnected) audioPauseResumeAndUpdateState();
            }
            break;
        case 19: // STOP  ----------------------------------------------------------------------------------------------------------------------------
            if (s_state == PLAYER) {
                if (s_f_isFSConnected) audio.stopSong();
                changeState(PLAYER, 0);
            }
            break;
        case 20: // ON/OFF  --------------------------------------------------------------------------------------------------------------------------
            if (!s_f_sleeping){
                fall_asleep();
            } else {
                wake_up(RADIO, 0);
            }
            break;
        case 21: // RADIO  ---------------------------------------------------------------------------------------------------------------------------
            if (s_state != RADIO) {
                setStation(s_cur_station);
                changeState(RADIO, 0);
            }
            break;
        case 22: // PLAYER  --------------------------------------------------------------------------------------------------------------------------
            if (s_state != PLAYER) { changeState(PLAYER, 0); }
            break;
        case 23: // DLNA  ----------------------------------------------------------------------------------------------------------------------------
            if (s_state != DLNA) {
                changeState(DLNA, 0);
            }
            break;
        case 24: // CLOCK  ---------------------------------------------------------------------------------------------------------------------------
            if (s_state != CLOCK) {
                changeState(CLOCK, 1);
            }
            break;
        case 25: // OFF TIIMER  ----------------------------------------------------------------------------------------------------------------------
            if (s_state != SLEEPTIMER) {
                s_sleepTimerSubMenue = 0;
                changeState(SLEEPTIMER, 0);
            }
            break;
        case 26: // VOLUME+  -------------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            }
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == CLOCK) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == SLEEPTIMER) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            upvolume();
            break;
        case 27: // VOLUME-  -------------------------------------------------------------------------------------------------------------------------
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                downvolume();
