pullead/esp32-hifi/src/main.cpp
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show(TFT_BLUE);
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == CLOCK) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == SLEEPTIMER) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            downvolume();
            break;
        case 28: // -30sec  --------------------------------------------------------------------------------------------------------------------------
            if (s_state == PLAYER) {
                if (audio.isRunning()) audio.setTimeOffset(-30);
            }
            break;
        case 29: // +30sec  --------------------------------------------------------------------------------------------------------------------------
            if (s_state == PLAYER) {
                if (audio.isRunning()) audio.setTimeOffset(+30);
            }
            break;
        case 30: // NEXT STATION  --------------------------------------------------------------------------------------------------------------------
            nextStation();
            break;
        case 31: // PREV STATION  --------------------------------------------------------------------------------------------------------------------
            prevStation();
            break;
        default: //  ---------------------------------------------------------------------------------------------------------------------------------
            MWR_LOG_WARN("unknown IR code: {}", key);
            break;
    }
}
// clang-format on
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// Events from websrv /*🟢🟡🔴*/
// clang-format off

// Minimal standalone WiFi setup page -- deliberately not part of the big
// index_html SPA (which has no working credential-add flow, see the
// WiFi-settings feature investigation) so it works standing alone when
// broadcasting the AP fallback hotspot, reachable at any known IP (usually
// 192.168.4.1) without needing the rest of the app's JS. Network list is
// built server-side into a plain <select> (a synchronous WiFi.scanNetworks()
// at request time) rather than an async JS fetch, to keep the page trivial.
static void serveWifiSetupPage() {
    ps_ptr<char> options(2048);
    if (lockWifiOps(pdMS_TO_TICKS(15000))) {
        const int16_t n = WiFi.scanNetworks();
        for (int16_t i = 0; i < n && i < 24; ++i) {
            ps_ptr<char> ssidEsc(64);
            const char* raw = WiFi.SSID(i).c_str();
            // Escape '"' and '<' so a crafted SSID can't break out of the
            // attribute/tag it's placed into (WiFi.SSID() is untrusted input).
            size_t o = 0;
            for (const char* p = raw; *p && o < 60; ++p) {
                if (*p == '"') { strlcpy(ssidEsc.get() + o, "&quot;", 64 - o); o += 6; }
                else if (*p == '<') { strlcpy(ssidEsc.get() + o, "&lt;", 64 - o); o += 4; }
                else ssidEsc.get()[o++] = *p;
            }
            ssidEsc.get()[o] = '\0';
            char opt[160];
            snprintf(opt, sizeof(opt), "<option value=\"%s\">%s (%d dBm)</option>", ssidEsc.c_get(), ssidEsc.c_get(), static_cast<int>(WiFi.RSSI(i)));
            options += opt;
        }
        WiFi.scanDelete();
        unlockWifiOps();
    } else {
        MWR_LOG_WARN("WiFi operation busy while serving setup page");
    }

    ps_ptr<char> page(2560 + options.strlen());
    page.assignf(
        "<!DOCTYPE html><html><head><meta charset=\"utf-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>MiniWebRadio WiFi 设置</title><style>"
        "body{{font-family:sans-serif;background:#111;color:#eee;padding:20px;max-width:420px;margin:0 auto}}"
        "h2{{color:#3ddc97}}select,input,button{{width:100%;padding:10px;margin:8px 0;box-sizing:border-box;font-size:16px;border-radius:6px;border:1px solid #444;background:#222;color:#eee}}"
        "button{{background:#3ddc97;color:#111;border:none;font-weight:bold}}"
        "</style></head><body>"
        "<h2>连接到WiFi</h2>"
        "<form onsubmit=\"return doSubmit()\">"
        "<select id=\"ssid\"><option value=\"\">-- 选择扫描到的网络 --</option>{}</select>"
        "<input id=\"ssidManual\" placeholder=\"或手动输入SSID\">"
        "<input id=\"pw\" type=\"password\" placeholder=\"密码\">"
        "<button type=\"submit\">连接</button>"
        "</form><p id=\"msg\"></p><script>"
        "function doSubmit(){{"
        "var s=document.getElementById('ssidManual').value||document.getElementById('ssid').value;"
        "var p=document.getElementById('pw').value;"
        "if(!s){{alert('请输入或选择网络名');return false;}}"
        "document.getElementById('msg').innerText='正在保存并重启设备...';"
        "fetch('wifi_add?'+encodeURIComponent(s)+'&'+encodeURIComponent(p));"
        "return false;}}"
        "</script></body></html>",
        options.c_get());
    webSrv.show(page.c_get(), webSrv.TEXT);
}

namespace {
// Minimal JSON string escaping -- SSIDs/passwords are untrusted input and
// could contain '"' or backslashes; control characters are stripped rather
// than escaped since a WiFi name containing them would be pathological.
void jsonEscapeAppend(ps_ptr<char>& out, const char* raw) {
    for (const char* p = raw; *p; ++p) {
        if (*p == '"' || *p == '\\') out += "\\";
        if (static_cast<unsigned char>(*p) < 0x20) continue;
        char one[2] = {*p, '\0'};
        out += one;
    }
}
} // namespace

// Companion to the always-available minimal /wifi setup page: a fuller,
// phone-Settings-style WiFi admin page for once the device is already on a
// network (reached via the "后台管理" QR in Settings > WiFi on the device
// itself, see HifiUi::onWifiManageOpenAction). Static HTML shell; all data
// (scan results, saved slots, connect status) comes from the JSON endpoints
// below via fetch(), so this function itself needs no per-request state.
static void serveWifiManagePage() {
    static const char page[] =
        "<!DOCTYPE html><html><head><meta charset=\"utf-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>MiniWebRadio WiFi 后台管理</title><style>"
        "body{font-family:-apple-system,sans-serif;background:#0A0B12;color:#F2F3F7;padding:16px;max-width:480px;margin:0 auto}"
        "h2{color:#C77DFF;font-size:20px;margin:18px 0 8px}"
        "h2:first-child{margin-top:0}"
        ".card{background:#161A2B;border-radius:10px;padding:12px 14px;margin-bottom:8px;display:flex;align-items:center;justify-content:space-between;gap:10px}"
        // Scan rows need more than the simple two-child .card row (name+rssi,
        // an optional password field, and a connect button all stacked) --
        // a separate block-layout class rather than forcing that into the
        // flex-row .card, which is what caused everything to overlap.
        ".scanCard{background:#161A2B;border-radius:10px;padding:10px 14px;margin-bottom:8px}"
        ".scanCard .info{display:flex;align-items:center;justify-content:space-between;gap:10px}"
        ".scanCard button{width:100%;margin-top:8px}"
        ".ssid{font-weight:600;overflow:hidden;text-overflow:ellipsis;white-space:nowrap}"
        ".sub{color:#9AA0B4;font-size:12px;flex-shrink:0}"
        ".tag{color:#C77DFF;font-size:12px;flex-shrink:0}"
        "button{background:#6D28D9;color:#F2F3F7;border:none;border-radius:8px;padding:8px 14px;font-size:14px;flex-shrink:0}"
        "button.danger{background:#3A1620;color:#E4574B}"
        "button.link{background:none;color:#9AA0B4;text-decoration:underline;padding:4px}"
        "input{width:100%;box-sizing:border-box;padding:8px 10px;margin-top:8px;border-radius:8px;border:1px solid #565C70;background:#0E1019;color:#F2F3F7;font-size:14px}"
        ".row{flex:1;min-width:0}"
        ".empty{color:#565C70;font-size:13px;padding:6px 2px}"
        "</style></head><body>"
        "<h2>当前连接</h2><div class=\"card\"><div class=\"row\"><div class=\"ssid\" id=\"curSsid\">--</div>"
        "<div class=\"sub\" id=\"curSub\"></div></div></div>"
        "<h2>附近的WiFi <button class=\"link\" onclick=\"loadScan()\">刷新</button></h2>"
        "<div id=\"scanList\" class=\"empty\">扫描中...</div>"
        "<h2>已保存的网络</h2><div id=\"savedList\" class=\"empty\">加载中...</div>"
        "<script>"
        "function esc(s){return s.replace(/[&<>\"]/g,function(c){return {'&':'&amp;','<':'&lt;','>':'&gt;','\"':'&quot;'}[c];});}"
        "function loadStatus(){fetch('wifi_status_json').then(r=>r.json()).then(function(j){"
        "document.getElementById('curSsid').textContent=j.connected?j.ssid:'未连接';"
        "document.getElementById('curSub').textContent=j.connected?(j.rssi+' dBm  ·  '+j.ip):'';"
        "});}"
        "function loadSaved(){fetch('wifi_saved_json').then(r=>r.json()).then(function(list){"
        "var el=document.getElementById('savedList');"
        "if(!list.length){el.innerHTML='<div class=\"empty\">还没有保存的网络</div>';return;}"
        "el.innerHTML=list.map(function(n){"
        "return '<div class=\"card\"><div class=\"row ssid\">'+esc(n.ssid)+'</div>'"
        "+(n.isDefault?'<span class=\"tag\">出厂默认</span>':'<button class=\"danger\" onclick=\"forget(\\''+esc(n.ssid).replace(/'/g,\"\\\\'\")+'\\')\">删除</button>')"
        "+'</div>';"
        "}).join('');"
        "});}"
        "function loadScan(){"
        "document.getElementById('scanList').innerHTML='扫描中...';"
        "fetch('wifi_scan_json').then(r=>r.json()).then(function(list){"
        "var el=document.getElementById('scanList');"
        "if(!list.length){el.innerHTML='<div class=\"empty\">未找到WiFi网络</div>';return;}"
        "el.innerHTML=list.map(function(n,i){"
        "return '<div class=\"scanCard\"><div class=\"info\">'"
        "+'<div class=\"ssid\">'+esc(n.ssid)+(n.encrypted?' 🔒':'')+'</div>'"
        "+'<div class=\"sub\">'+n.rssi+' dBm</div></div>'"
        "+(n.encrypted?'<input type=\"password\" placeholder=\"密码\" id=\"pw'+i+'\">':'')"
        "+'<button onclick=\"connect(\\''+esc(n.ssid).replace(/'/g,\"\\\\'\")+'\\','+i+')\">连接</button>'"
        "+'</div>';"
        "}).join('');"
        "});}"
        "function connect(ssid,i){"
        "var pwEl=document.getElementById('pw'+i);var pw=pwEl?pwEl.value:'';"
        "fetch('wifi_connect?'+encodeURIComponent(ssid)+'&'+encodeURIComponent(pw)).then(function(){"
        "setTimeout(function(){loadStatus();loadSaved();},4000);"
        "});"
        "alert('正在连接 '+ssid+'...');"
        "}"
        "function forget(ssid){"
        "if(!confirm('删除已保存的网络 \"'+ssid+'\"？'))return;"
        "fetch('wifi_forget?'+encodeURIComponent(ssid)).then(loadSaved);"
        "}"
        "loadStatus();loadSaved();loadScan();"
        "</script></body></html>";
    webSrv.show(page, webSrv.TEXT);
}

