pullead/esp32-hifi/src/main.cpp
// Phone page behind the cloud-music settings QR (Settings > 在线音乐 >
// 扫码配置): type the gateway URL + device key on the phone, tap save, and
// the board picks the result up via cloud_config_set. Mirrors the
// /wifi_manage phone page (same dark card style, same encodeURIComponent
// GET convention -> cmd?param&arg).
static void serveCloudConfigPage() {
    static const char page[] =
        "<!DOCTYPE html><html><head><meta charset=\"utf-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>在线音乐网关配置</title><style>"
        "body{font-family:-apple-system,sans-serif;background:#0A0B12;color:#F2F3F7;padding:16px;max-width:480px;margin:0 auto}"
        "h2{color:#C77DFF;font-size:20px;margin:0 0 12px}"
        ".card{background:#161A2B;border-radius:10px;padding:14px}"
        "label{display:block;color:#9AA0B4;font-size:13px;margin:10px 0 4px}"
        "input{width:100%;box-sizing:border-box;padding:8px 10px;border-radius:8px;border:1px solid #565C70;background:#0E1019;color:#F2F3F7;font-size:14px}"
        "button{width:100%;background:#6D28D9;color:#F2F3F7;border:none;border-radius:8px;padding:10px;font-size:15px;margin-top:14px}"
        "#msg{margin-top:10px;font-size:13px;color:#34D399}"
        "</style></head><body>"
        "<h2>在线音乐网关配置</h2><div class=\"card\">"
        "<label>网关地址</label><input id=\"url\" placeholder=\"https://esp32-ncm-gateway...\">"
        "<label>设备密钥</label><input id=\"key\" type=\"password\" placeholder=\"设备密钥\">"
        "<button onclick=\"save()\">保存到开发板</button><div id=\"msg\"></div>"
        "</div><script>"
        "fetch('cloud_config_json').then(r=>r.json()).then(function(j){"
        "if(j.configured){document.getElementById('url').value=j.base_url;document.getElementById('key').value=j.device_key;}"
        "});"
        "function save(){"
        "var u=document.getElementById('url').value;var k=document.getElementById('key').value;"
        "if(!u||!k){document.getElementById('msg').style.color='#E4574B';document.getElementById('msg').textContent='地址和密钥都要填';return;}"
        "document.getElementById('msg').style.color='#34D399';document.getElementById('msg').textContent='保存中…';"
        "fetch('cloud_config_set?'+encodeURIComponent(u)+'&'+encodeURIComponent(k)).then(function(r){return r.json();}).then(function(j){"
        "document.getElementById('msg').textContent=j.ok?('保存成功,请回到开发板查看'):('保存失败:'+j.message);"
        "});"
        "}"
        "</script></body></html>";
    webSrv.show(page, webSrv.TEXT);
}

static void serveCloudConfigJson() {
    const CloudMusicConfig cfg = playerCoreCloudMusicConfig();
    ps_ptr<char> urlEsc;
    ps_ptr<char> keyEsc;
    jsonEscapeAppend(urlEsc, cfg.baseUrl);
    jsonEscapeAppend(keyEsc, cfg.deviceKey);
    ps_ptr<char> json(320);
    json.assignf("{{\"configured\":{},\"base_url\":\"{}\",\"device_key\":\"{}\"}}",
                 cfg.configured ? "true" : "false", urlEsc.c_get(), keyEsc.c_get());
    webSrv.show(json.c_get(), webSrv.JSON);
}

static void serveWifiStatusJson() {
    ps_ptr<char> json(192);
    const bool connected = WiFi.status() == WL_CONNECTED;
    ps_ptr<char> ssidEsc;
    jsonEscapeAppend(ssidEsc, connected ? WiFi.SSID().c_str() : "");
    json.assignf("{{\"connected\":{},\"ssid\":\"{}\",\"rssi\":{},\"ip\":\"{}\"}}", connected ? "true" : "false", ssidEsc.c_get(),
                 connected ? static_cast<int>(WiFi.RSSI()) : 0, connected ? WiFi.localIP().toString().c_str() : "");
    webSrv.show(json.c_get(), webSrv.JSON);
}

// Synchronous scan, same as serveWifiSetupPage() -- simpler than threading
// through the LVGL side's background wifiScanTask, and this page is only
// loaded on demand (or "刷新" tapped), not polled.
static void serveWifiScanJson() {
    ps_ptr<char> json(2048);
    json = "[";
    if (lockWifiOps(pdMS_TO_TICKS(15000))) {
        const int16_t n = WiFi.scanNetworks();
        for (int16_t i = 0; i < n && i < 24; ++i) {
            ps_ptr<char> ssidEsc;
            jsonEscapeAppend(ssidEsc, WiFi.SSID(i).c_str());
            char entry[192];
            snprintf(entry, sizeof(entry), "%s{\"ssid\":\"%s\",\"rssi\":%d,\"encrypted\":%s}", i ? "," : "", ssidEsc.c_get(),
                     static_cast<int>(WiFi.RSSI(i)), WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? "true" : "false");
            json += entry;
        }
        WiFi.scanDelete();
        unlockWifiOps();
    } else {
        MWR_LOG_WARN("WiFi operation busy while serving scan json");
    }
    json += "]";
    webSrv.show(json.c_get(), webSrv.JSON);
}

static void serveWifiSavedJson() {
    ps_ptr<char> json(1024);
    json = "[";
    bool first = true;
    for (uint8_t i = 0; i < kWifiSlotCount; ++i) {
        ps_ptr<char> line = wifiPrefGet(i);
        if (!playerCoreWifiLineIsSavedNetwork(line.c_get())) continue;
        const int pos = line.index_of("\t", 0);
        line[pos] = '\0';
        ps_ptr<char> ssidEsc;
        jsonEscapeAppend(ssidEsc, line.get());
        char entry[160];
        snprintf(entry, sizeof(entry), "%s{\"index\":%u,\"ssid\":\"%s\",\"isDefault\":%s}", first ? "" : ",", i, ssidEsc.c_get(), i == 0 ? "true" : "false");
        json += entry;
        first = false;
    }
    json += "]";
    webSrv.show(json.c_get(), webSrv.JSON);
}

void WEBSRV_onCommand(ps_ptr<char> cmd, ps_ptr<char> param, ps_ptr<char> arg){  // called via html

    if(CORE_DEBUG_LEVEL == ARDUHAL_LOG_LEVEL_DEBUG){
        printfln(s_tag.webserver, "WS_onCmd: " ANSI_ESC_YELLOW "cmd=\"{}\", params=\"{}\", arg=\"{}\"", cmd.c_get(), param.c_get(), arg.c_get());
    }
    #define CMD_EQUALS(x) if(cmd.equals(x) == true)

    CMD_EQUALS("ping"){                 webSrv.send("pong"); return;}                                                                                     // via websocket

    CMD_EQUALS("index.html"){           printfln(s_tag.webserver, "Webpage: " ANSI_ESC_ORANGE "index.html");                                                     // via XMLHttpRequest
                                        // While broadcasting the AP setup hotspot, serve the WiFi setup
                                        // page for the default path too -- most phones request "/" (or a
                                        // captive-portal probe path that falls through to it) right after
                                        // joining, and the normal full SPA is useless with no real network.
                                        if (s_wifiApFallbackActive) { serveWifiSetupPage(); return; }
                                        webSrv.show(index_html, webSrv.TEXT);
                                        return;}

    CMD_EQUALS("wifi"){                 printfln(s_tag.webserver, "Webpage: " ANSI_ESC_ORANGE "wifi setup");
                                        serveWifiSetupPage();
                                        return;}

    CMD_EQUALS("wifi_add"){             // param=SSID, arg=password (see serveWifiSetupPage()'s fetch() call)
                                        setWiFiCredentials(param, arg);
                                        printfln(s_tag.wifi_info, ANSI_ESC_GREEN "WiFi credentials added via setup page for \"{}\", restarting", param.c_get());
                                        webSrv.show("OK, restarting...", webSrv.TEXT);
                                        vTaskDelay(pdMS_TO_TICKS(1500));
                                        ESP.restart();
                                        return;}

    CMD_EQUALS("wifi_manage"){          printfln(s_tag.webserver, "Webpage: " ANSI_ESC_ORANGE "wifi manage");
                                        serveWifiManagePage();
                                        return;}

    CMD_EQUALS("cloud_config"){         printfln(s_tag.webserver, "Webpage: " ANSI_ESC_ORANGE "cloud config (phone)");
                                        serveCloudConfigPage();
                                        return;}
    CMD_EQUALS("cloud_config_json"){    serveCloudConfigJson(); return;}
    CMD_EQUALS("cloud_config_set"){     printfln(s_tag.webserver, "cloud config set via phone page");
                                        const bool ok = playerCoreSetCloudMusicConfig(param.c_get(), arg.c_get());
                                        if (ok) playerCoreCloudMusicWakeStart();
                                        ps_ptr<char> json(192);
                                        json.assignf("{{\"ok\":{},\"message\":\"{}\"}}", ok ? "true" : "false",
                                                     ok ? "saved" : "invalid config (need http(s) URL + key)");
                                        webSrv.show(json.c_get(), webSrv.JSON);
                                        return;}
    CMD_EQUALS("cloud_diag_start"){     // Diagnostics: replicate the wake path (DNS->TCP443->TLS health) on a
                                        // dedicated 24K-stack task and stash the JSON result.
                                        playerCoreCloudDiagStart();
                                        webSrv.show("{\"started\":true}", webSrv.JSON);
                                        return;}
    CMD_EQUALS("cloud_diag_json"){      if (playerCoreCloudDiagReady()) webSrv.show(playerCoreCloudDiagResult(), webSrv.JSON);
                                        else webSrv.show("{\"ready\":false}", webSrv.JSON);
                                        return;}

    CMD_EQUALS("wifi_status_json"){     serveWifiStatusJson(); return;}

