pullead/esp32-hifi/src/main.cpp
    CMD_EQUALS("wifi_scan_json"){       serveWifiScanJson(); return;}

    CMD_EQUALS("wifi_saved_json"){      serveWifiSavedJson(); return;}

    CMD_EQUALS("wifi_connect"){         // param=SSID, arg=password -- like wifi_add but live (no restart),
                                        // same background reconnect path as the on-device Settings > WiFi flow.
                                        printfln(s_tag.wifi_info, ANSI_ESC_GREEN "WiFi connect requested via admin page for \"{}\"", param.c_get());
                                        playerCoreWifiAddNetwork(param.c_get(), arg.c_get());
                                        webSrv.show("{\"started\":true}", webSrv.JSON);
                                        return;}

    CMD_EQUALS("wifi_forget"){          // param=SSID -- clears that saved slot (setWiFiCredentials() with an
                                        // empty password deletes; slot 0's hardcoded default is protected there too).
                                        setWiFiCredentials(param, "");
                                        printfln(s_tag.wifi_info, ANSI_ESC_YELLOW "WiFi credentials forgotten via admin page for \"{}\"", param.c_get());
                                        webSrv.show("{\"ok\":true}", webSrv.JSON);
                                        return;}

    CMD_EQUALS("index.js"){             printfln(s_tag.webserver, "Script: " ANSI_ESC_ORANGE "index.js");                                                       // via XMLHttpRequest
                                        webSrv.show(index_js, webSrv.JS); return;}

    CMD_EQUALS("favicon.ico"){          webSrv.streamfile(SD_MMC, "/favicon.ico"); return;}                                                               // via XMLHttpRequest

    CMD_EQUALS("test"){                 ps_ptr<char>p; p.assignf("free heap: {}, Inbuff filled: {}, Inbuff free: {}, PSRAM filled {}, PSRAM free {},",
                                        ESP.getFreeHeap(), audio.inBufferFilled(), audio.inBufferFree(), (ESP.getPsramSize() - ESP.getFreePsram()), ESP.getFreePsram());
                                        webSrv.send("test=", p.c_get());
                                        printfln(s_tag.webserver, "audiotask .. stackHighWaterMark: {} bytes", (long unsigned)audio.getHighWatermark() * 4);
                                        printfln(s_tag.webserver, "looptask ... stackHighWaterMark: {} bytes", (long unsigned)uxTaskGetStackHighWaterMark(NULL) * 4);
                                        return;}

    CMD_EQUALS("get_mute"){             s_f_mute == true ? webSrv.send("mute=", "1") : webSrv.send("mute=", "0"); return;}
    CMD_EQUALS("set_mute"){             muteChanged(!s_f_mute); return;}
    CMD_EQUALS("upvolume"){             webSrv.send("volume=", int2str(upvolume()));  return;}                                                            // via websocket
    CMD_EQUALS("downvolume"){           webSrv.send("volume=", int2str(downvolume())); return;}                                                           // via websocket
    CMD_EQUALS("get_volumeSteps"){      webSrv.send("volumeSteps=", int2str(s_volume.volumeSteps)); return;}

    CMD_EQUALS("set_volumeSteps"){      s_volume.cur_volume = map_l(s_volume.cur_volume, 0, s_volume.volumeSteps, 0, param.to_uint32());
                                        s_volume.ringVolume = map_l(s_volume.ringVolume, 0, s_volume.volumeSteps, 0, param.to_uint32()); webSrv.send("ringVolume=", int2str(s_volume.ringVolume));
                                        s_volume.volumeAfterAlarm = map_l(s_volume.volumeAfterAlarm, 0, s_volume.volumeSteps, 0, param.to_uint32()); webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm));
                                        s_volume.volumeSteps = param.to_uint32(); webSrv.send("volumeSteps=", param.c_get()); audio.setVolumeSteps(s_volume.volumeSteps);
                                        MWR_LOG_DEBUG("s_volumeSteps  {}", s_volume.volumeSteps);
                                        sdr_CL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_DL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_PL_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        sdr_RA_volume.setMinMaxVal(0, s_volume.volumeSteps);
                                        setVolume(s_volume.cur_volume);
                                        printfln(s_tag.webserver, "new volume steps: " ANSI_ESC_CYAN "{}", s_volume.volumeSteps);
                                        return;}

    CMD_EQUALS("get_ringVolume"){       webSrv.send("ringVolume=", int2str(s_volume.ringVolume)); return;}
    CMD_EQUALS("set_ringVolume"){       s_volume.ringVolume = param.to_int32(); webSrv.send("ringVolume=", int2str(s_volume.ringVolume));
                                        printfln(s_tag.webserver, "new ring volume: " ANSI_ESC_CYAN "{}", s_volume.ringVolume); return;}

    CMD_EQUALS("get_volAfterAlarm"){    webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm)); return;}
    CMD_EQUALS("set_volAfterAlarm"){    s_volume.volumeAfterAlarm = param.to_int32(); webSrv.send("volAfterAlarm=", int2str(s_volume.volumeAfterAlarm));
                                        printfln(s_tag.webserver, "new volume after alarm: " ANSI_ESC_CYAN "{}", s_volume.volumeAfterAlarm); return;}
    CMD_EQUALS("homepage"){             webSrv.send("homepage=", s_homepage.c_get()); return;}

    CMD_EQUALS("to_listen"){            webSrv_send_station_items(); return;}   // via websocket, return the name and number of the current station
    CMD_EQUALS("get_tone"){             webSrv.send("settone=", getI2STone().c_get()); return;}

    CMD_EQUALS("get_streamtitle"){      webSrv.reply(s_streamTitle.c_get(), webSrv.TEXT); return;}

    CMD_EQUALS("LowPass"){              s_tone.LP = param.to_int32(); sdr_EQ_lowPass.setValue(s_tone.LP); // audioI2S tone
                                        ps_ptr<char>lp; lp = "Lowpass set to " + param  + "dB";
                                        setI2STone(); return;}

    CMD_EQUALS("BandPass"){             s_tone.BP = param.to_int32(); sdr_EQ_bandPass.setValue(s_tone.BP); // audioI2S tone
                                        ps_ptr<char>bp; bp = "Bandpass set to " + param + "dB";
                                        setI2STone(); return;}

    CMD_EQUALS("HighPass"){             s_tone.HP = param.to_int32(); sdr_EQ_highPass.setValue(s_tone.HP); // audioI2S tone
                                        ps_ptr<char> hp; hp = "Highpass set to " + param + "dB";
                                        setI2STone(); return;}

    CMD_EQUALS("Balance"){              s_tone.BAL = param.to_int32(); sdr_EQ_balance.setValue(s_tone.BAL); // audioI2S tone
                                        ps_ptr<char> bal = "Balance set to " + param;
                                        setI2STone(); return;}

    CMD_EQUALS("prev_station"){         prevFavStation(); return;}                                                                                           // via websocket

    CMD_EQUALS("next_station"){         nextFavStation(); return;}                                                                                           // via websocket

    CMD_EQUALS("set_station"){          uint16_t staNr = param.to_uint32(); if(staNr != s_cur_station) setStationByNumber(staNr); return;}                                                                      // via websocket

    CMD_EQUALS("stationURL"){           playerCorePlayRadioUrl(param.c_get());                                                                        // via websocket
                                        printfln(s_tag.webserver, "StationURL: " ANSI_ESC_MAGENTA "{}", param.c_get());
                                        return;}

    CMD_EQUALS("webFileURL"){           audio.connecttohost(param.c_get())? changeState(PLAYER, 1) : changeState(PLAYER, 0); return;}                        // via websocket

    CMD_EQUALS("get_networks"){         webSrv.send("networks=", WiFi.SSID().c_str()); return;}                                                              // via websocket

