pullead/esp32-hifi/src/main.cpp
    if(strcmp(cmd, "upload_player2sd") == 0) {savefile(param, contentLength, contentType); return; }
    if(strcmp(cmd, "upload_text_file") == 0) {savefile(param, contentLength, contentType); return; }
    if(strcmp(cmd, "uploadfile") == 0){saveImage(param, contentLength); return;}
    printfln(s_tag.webserver, ANSI_ESC_RED "unknown HTMLcommand {}, param={}", cmd, param);
    webSrv.sendStatus(400);
}

void WEBSRV_onDelete(const char* cmd,  const char* param, const char* arg){  // via XMLHttpRequest
    if(startsWith(cmd, "SD")){      bool res = SD_delete(param);
                                    if(res) webSrv.sendStatus(200); else webSrv.sendStatus(400);
                                    printfln(s_tag.webserver, "Delete " ANSI_ESC_ORANGE "\"{}\"", param);
                                    return;}
    printfln(s_tag.webserver, ANSI_ESC_RED "unknown HTMLcommand {}, param={}", cmd, param);
    webSrv.sendStatus(400);
}
// clang-format on
/*🟢🟡🔴*/
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
//  Events from DLNA
void on_dlna_client(const DLNA_Client::msg_s& msg) {
    if (msg.e == DLNA_Client::evt_content) {
        if (!msg.items) return; // security check
        for (size_t i = 0; i < msg.items->size(); i++) {
            const auto& item = msg.items->at(i);
            if (item.isAudio) {
                if (item.duration.equals("?") != 0) { // no duration given
                    if (item.itemSize) {
                        printfln(s_tag.dlna_server, "title " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET ", itemSize " ANSI_ESC_CYAN "{}", item.title, item.itemSize);
                    } else {
                        printfln(s_tag.dlna_server, "title " ANSI_ESC_YELLOW "{}", item.title.c_get());
                    }
                } else {
                    printfln(s_tag.dlna_server,
                             "title " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET ", duration "
                             "{}",
                             item.title, item.duration);
                }
            }
            if (item.childCount) {
                printfln(s_tag.dlna_server, "title " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET ", childCount " ANSI_ESC_CYAN "{}", item.title, item.childCount);
            } else {
                printfln(s_tag.dlna_server, "title " ANSI_ESC_YELLOW "{}" ANSI_ESC_RESET ", childCount " ANSI_ESC_CYAN "{}", item.title, 0);
            }
        }
        if (msg.totalMatches >= 0) printfln(s_tag.dlna_server, "returned " ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " from " ANSI_ESC_CYAN "{}", msg.numberReturned, msg.totalMatches);
        s_dlnaMaxItems = msg.totalMatches;
        s_totalNumberReturned += msg.numberReturned;
        if (msg.numberReturned == 50 && !s_f_dlnaMakePlaylistOTF) { // next round
            if (s_totalNumberReturned < msg.totalMatches && s_totalNumberReturned < 500) { s_f_dlnaBrowseServer = true; }
        }
        if (s_f_dlnaWaitForResponse) {
            s_f_dlnaWaitForResponse = false;
            lst_DLNA.show(s_dlnaItemNr, dlna.getServer(), dlna.getBrowseResult(), &s_dlnaLevel, s_dlnaMaxItems, s_dlnaMaXServers);
            setTimeCounter(LIST_TIMER);
        } else {
            webSrv.send("dlnaContent=", dlna.stringifyContent());
        }
        if (s_totalNumberReturned == msg.totalMatches || s_totalNumberReturned == 500 || s_f_dlnaMakePlaylistOTF) {
            s_totalNumberReturned = 0;
            s_f_dlna_browseReady = true; // last item received
        }
    }
    if (msg.e == DLNA_Client::evt_server) {
        for (size_t i = 0; i < msg.server->size(); i++) {
            const auto& server = msg.server->at(i);
            printfln(s_tag.dlna_server, "[{}] " ANSI_ESC_ORANGE "{}:{} " ANSI_ESC_YELLOW " {}", i, server.ip, server.port, server.friendlyName);
        }
        s_dlnaMaXServers = msg.server->size();
        printfln(s_tag.dlna_server, ANSI_ESC_CYAN "{}" ANSI_ESC_RESET " media server found", msg.server->size());
    }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void on_kcx_bt_emitter(const KCX_BT_Emitter::msg_s& msg) {
    if (msg.e == KCX_BT_Emitter::evt_info) { printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_GREEN "{}", msg.arg); }
    if (msg.e == KCX_BT_Emitter::evt_found) {
        s_bt_emitter.found = true;
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "KCX_BT_Emitter found");
        bt_emitter.userCommand("AT+GMR?");                 // get version
        bt_emitter.userCommand("AT+PAUSE?");               // pause or play?
        bt_emitter.userCommand("AT+NAME+BT-MiniWebRadio"); // set BT receiver name
        bt_emitter.setVolume(s_bt_emitter.volume);
    }
    if (msg.e == KCX_BT_Emitter::evt_connect) {
        s_bt_emitter.connect = true;
        if (s_bt_emitter.mode.equals("TX")) {
            txt_BT_mode.setText("EMITTER");
            pic_BT_mode.setPicturePath("/common/BT_TX.png");
            if (s_state == BLUETOOTH) {
                pic_BT_mode.show();
                txt_BT_mode.show();
            }
            webSrv.send("KCX_BT_MODE=", "TX");
        } else {
            txt_BT_mode.setText("RECEIVER");
            pic_BT_mode.setPicturePath("/common/BT_RX.png");
            if (s_state == BLUETOOTH) {
                pic_BT_mode.show();
                txt_BT_mode.show();
            }
            webSrv.send("KCX_BT_MODE=", "RX");
        }
        webSrv.send("KCX_BT_connected=", "1");
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "connected");
    }
    if (msg.e == KCX_BT_Emitter::evt_disconnect) {
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "disconnected");
        pic_BT_mode.setPicturePath("/common/BTnc.png"); // not connected
        if (s_state == BLUETOOTH) pic_BT_mode.show();
        webSrv.send("KCX_BT_connected=", "0");
    }
    if (msg.e == KCX_BT_Emitter::evt_reset) {
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "reset");
        s_bt_emitter.connect = false;
    }
    if (msg.e == KCX_BT_Emitter::evt_power_on) {
        webSrv.send("KCX_BT_power=", "1");
        webSrv.send("KCX_BT_connected=", "0");
        btn_BT_power.setValue(true);
        pic_BT_mode.setPicturePath("/common/BTnc.png");
        if (s_state == BLUETOOTH) pic_BT_mode.show();
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "power on");
        bt_emitter.userCommand("AT+BT_MODE?");
    }
    if (msg.e == KCX_BT_Emitter::evt_power_off) {
        webSrv.send("KCX_BT_power=", "0");
        webSrv.send("KCX_BT_connected=", "-1");
        btn_BT_power.setValue(false);
        pic_BT_mode.setPicturePath("/common/BToff.png");
        if (s_state == BLUETOOTH) pic_BT_mode.show();
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "power off");
    }
    if (msg.e == KCX_BT_Emitter::evt_scan) {
        s_bt_emitter.connect = false;
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "scan...");
    }
    if (msg.e == KCX_BT_Emitter::evt_volume) {
        s_bt_emitter.volume = msg.val;
        ps_ptr<char> v;
        v.assignf("Vol: {:02}", s_bt_emitter.volume);
        if (s_state == BLUETOOTH) dispFooter.updateFileNr(v);
        printfln(s_tag.bt_emitter, "Volume: " ANSI_ESC_CYAN "{}", msg.val);
    }
    if (msg.e == KCX_BT_Emitter::evt_version) {
        s_bt_emitter.version = msg.arg;
        printfln(s_tag.bt_emitter, "Version: " ANSI_ESC_CYAN "{}", msg.arg);
    }
    if (msg.e == KCX_BT_Emitter::evt_mode) {
        webSrv.send("KCX_BT_MODE=", msg.arg);
        if (s_state == BLUETOOTH) {
            txt_BT_mode.setText(msg.arg[0] == 'R' ? "RECEIVER" : "EMITTER");
            txt_BT_mode.show();
        }
        s_bt_emitter.mode = msg.arg;
        printfln(s_tag.bt_emitter, "RX_TX_mode: " ANSI_ESC_YELLOW "{}", msg.arg);
    }
    if (msg.e == KCX_BT_Emitter::evt_pause) {
        s_bt_emitter.play = false;
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "pause");
    }
    if (msg.e == KCX_BT_Emitter::evt_play) {
        s_bt_emitter.play = true;
        printfln(s_tag.bt_emitter, "Info: " ANSI_ESC_YELLOW "play");
    }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void on_websrv(const WebSrv::msg_s& msg) {
    if (msg.e == WebSrv::evt_info) {
        if (msg.arg.starts_with("WebSocket")) return;      // suppress WebSocket client available
        if (msg.arg.starts_with("ping")) return;           // suppress ping
        if (msg.arg.starts_with("to_listen")) return;      // suppress to_isten
        if (msg.arg.starts_with("Command client")) return; // suppress Command client available
        if (msg.arg.starts_with("test=")) return;          // suppress stackHighWaterMark
        if (msg.arg.starts_with("get_")) return;           // suppress all getters
        if (msg.arg.starts_with("set_")) return;           // suppress all setters
        if (msg.arg.starts_with("SD")) return;             // suppress all SD commands
        if (msg.arg.starts_with("Length")) return;         // suppress all file length infos
        printfln(s_tag.webserver, ANSI_ESC_GREEN "{} ", msg.arg.c_get());
    }
    if (msg.e == WebSrv::evt_error) { printfln(s_tag.webserver, ANSI_ESC_RED "{}", msg.arg); }
    if (msg.e == WebSrv::evt_warn) { printfln(s_tag.webserver, ANSI_ESC_YELLOW "{}", msg.arg); }
    if (msg.e == WebSrv::evt_command) { WEBSRV_onCommand(msg.cmd, msg.param1, msg.arg1); }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void kcx_bt_memItems(const char* jsonItems) { // Every time an item (name or address) was added, a JSON string is passed here
    // printfln(s_tag.bt_emitter, "bt_memItems {}", jsonItems);
    webSrv.send("KCX_BT_MEM=", jsonItems);
}

void kcx_bt_scanItems(const char* jsonItems) { // Every time an item (name and address) was scanned, a JSON string is passed here
    // printfln(s_tag.bt_emitter, "bt_scanItems {}", jsonItems);
    webSrv.send("KCX_BT_SCANNED=", jsonItems);
}

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
//  📌📌📌         T O U C H            📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// clang-format off
/*🟢🟡🔴*/
void tp_pressed(uint16_t x, uint16_t y) {
    // printfln(s_tag.tp_info, "Touchpoint x={}, y={}", x, y);
    if (s_f_sleeping) return; // awake in tp_released()
    const char* objName = NULL;
    if(y > layout.winHeader.y + layout.winHeader.h && y < layout.winProgbar.y) {
        objName = "backpane";
        if (s_state == RADIO){
            changeState(RADIO, s_subState_radio + 1 == 3 ? 0 : s_subState_radio + 1);
            goto exit;
        }
        if (s_state == CLOCK){
            changeState(CLOCK, s_subState_clock + 1 == 2 ? 0 : s_subState_clock + 1);
            goto exit;
        }
    }
    objName = isObjectClicked(x, y);
exit:
    if (objName) { printfln(s_tag.tp_info, "click on ..  {}", objName); }
    return;
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void tp_long_pressed(uint16_t x, uint16_t y) {

