pullead/esp32-hifi/src/main.cpp
    if (s_state == DLNAITEMSLIST) {
        //    lst_DLNA.longPressed(x, y);
    }
    MWR_LOG_INFO("tp long pressed");
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void tp_moved(uint16_t x, uint16_t y) {
    if (s_state == RADIO)          { if (sdr_RA_volume.positionXY(x, y))     return; }
    if (s_state == STATIONSLIST)   { if (lst_RADIO.positionXY(x, y))         return; }
    if (s_state == PLAYER)         { if (sdr_PL_volume.positionXY(x, y))     return; }
    if (s_state == AUDIOFILESLIST) { if (lst_PLAYER.positionXY(x, y))        return; }
    if (s_state == DLNA)           { if (sdr_DL_volume.positionXY(x, y))     return; }
    if (s_state == CLOCK)          { if (sdr_CL_volume.positionXY(x, y))     return; }
    if (s_state == DLNAITEMSLIST)  { if (lst_DLNA.positionXY(x, y))          return; }
    if (s_state == BRIGHTNESS)     { if (sdr_BR_value.positionXY(x, y))      return; }
    if (s_state == EQUALIZER)      { if (sdr_EQ_lowPass.positionXY(x, y))  { return; }
                                     if (sdr_EQ_bandPass.positionXY(x, y)) { return; }
                                     if (sdr_EQ_highPass.positionXY(x, y)) { return; }
                                     if (sdr_EQ_balance.positionXY(x, y))  { return; }}
    if (s_state == IR_SETTINGS)    { if (btn_IR_radio.positionXY(x, y))      return; }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void tp_released(uint16_t x, uint16_t y){

    if(s_f_sleeping && x > 0 && y > 0){ wake_up(RADIO, 0); return;}   // if sleeping

    // all state
    dispHeader.released();
    dispFooter.released();

    switch(s_state){
        case RADIO:
            VUmeter_RA.released();    sdr_RA_volume.released(); btn_RA_mute.released();  btn_RA_prevSta.released(); btn_RA_nextSta.released();
            btn_RA_player.released(); btn_RA_dlna.released();   btn_RA_clock.released(); btn_RA_sleep.released();   btn_RA_settings.released();
            btn_RA_bt.released();     btn_RA_off.released();    btn_RA_staList.released(); btn_RA_recorder.released();
            break;
        case STATIONSLIST:
            lst_RADIO.released();
            break;
        case PLAYER:
            btn_PL_prevFile.released(); btn_PL_nextFile.released(); btn_PL_ready.released(); btn_PL_playAll.released(); btn_PL_shuffle.released();
            btn_PL_fileList.released(); btn_PL_radio.released();    btn_PL_off.released();
            btn_PL_mute.released();     btn_PL_pause.released();    btn_PL_cancel.released(); sdr_PL_volume.released(); btn_PL_playNext.released();
            btn_PL_playPrev.released(); pgb_PL_progress.released();
            break;
        case AUDIOFILESLIST:
            lst_PLAYER.released(x, y);
            break;
        case DLNA:
            sdr_DL_volume.released(); btn_DL_mute.released(); btn_DL_pause.released(); btn_DL_radio.released(); btn_DL_fileList.released(); btn_DL_cancel.released(); pgb_DL_progress.released();
            break;
        case DLNAITEMSLIST:
            lst_DLNA.released(x, y);
            break;
        case CLOCK:
            btn_CL_mute.released(); btn_CL_alarm.released(); btn_CL_radio.released(); clk_CL_24.released(); sdr_CL_volume.released(); btn_CL_off.released();
            break;
        case ALARMCLOCK:
            clk_AC_red.released(); btn_AC_left.released(); btn_AC_right.released(); btn_AC_up.released(); btn_AC_down.released(); btn_AC_ready.released();
            break;
        case SLEEPTIMER:
            btn_SL_up.released(); btn_SL_down.released(); btn_SL_ready.released(); btn_SL_cancel.released();
            break;
        case SETTINGS:
            btn_SE_bright.released(); btn_SE_equal.released();  btn_SE_wifi.released(); btn_SE_radio.released();
            break;
        case BRIGHTNESS:
            sdr_BR_value.released();  btn_BR_ready.released(); pic_BR_logo.released();
            break;
        case EQUALIZER:
            sdr_EQ_lowPass.released(); sdr_EQ_bandPass.released(); sdr_EQ_highPass.released(); sdr_EQ_balance.released(); btn_EQ_lowPass.released(); btn_EQ_bandPass.released();
            btn_EQ_highPass.released(); btn_EQ_balance.released(); txt_EQ_lowPass.released(); txt_EQ_bandPass.released(); txt_EQ_highPass.released(); txt_EQ_balance.released();
            btn_EQ_Radio.released(); btn_EQ_Player.released(); btn_EQ_mute.released();
            break;
        case BLUETOOTH:
            btn_BT_pause.released(); btn_BT_radio.released(); btn_BT_volDown.released(); btn_BT_volUp.released(); btn_BT_mode.released(); btn_BT_power.released();
            break;
        case IR_SETTINGS:
            btn_IR_radio.released();
            break;
        case WIFI_SETTINGS:
            cls_wifiSettings.released();
            break;
        default:
            break;
    }
    // printfln(s_tag.tp_info, "tp_released, state is: {}", s_state);
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void tp_long_released(uint16_t x, uint16_t y){
    MWR_LOG_INFO("tp long released");
//    if(s_state == DLNAITEMSLIST) {lst_DLNA.longReleased();}
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnChange(ps_ptr<char> name, int32_t val) {
    ps_ptr<char> c;
    if (name.equals("sdr_RA_volume"))   { setTimeCounter(2); setVolume(val); goto exit; }
    if (name.equals("sdr_PL_volume"))   { setVolume(val); goto exit; }
    if (name.equals("sdr_DL_volume"))   { setVolume(val); goto exit; }
    if (name.equals("sdr_CL_volume"))   { setVolume(val); goto exit; }
    if (name.equals("sdr_BR_value"))    { s_brightness = val; setTFTbrightness(s_brightness, s_bh1750Value); txt_BR_value.setText(int2str(val)); txt_BR_value.show(); goto exit; }
    if (name.equals("sdr_EQ_LP"))       { c.assignf("{} dB", val); s_tone.LP  = val; webSrv.send("settone=", getI2STone().c_get()); setI2STone(); txt_EQ_lowPass.setText(c.c_get());  txt_EQ_lowPass.show(); goto exit; }
    if (name.equals("sdr_EQ_BP"))       { c.assignf("{} dB", val); s_tone.BP  = val; webSrv.send("settone=", getI2STone().c_get()); setI2STone(); txt_EQ_bandPass.setText(c.c_get()); txt_EQ_bandPass.show(); goto exit; }
    if (name.equals("sdr_EQ_HP"))       { c.assignf("{} dB", val); s_tone.HP  = val; webSrv.send("settone=", getI2STone().c_get()); setI2STone(); txt_EQ_highPass.setText(c.c_get()); txt_EQ_highPass.show(); goto exit; }
    if (name.equals("sdr_EQ_BAL"))      { if(val < 0)       c.assignf("{}/0 dB", val);  // e.g. -10/0 dB
                                          else if (val > 0) c.assignf("0/-{} dB", val); // e.g. 0/-8 dB
                                          else              c.assignf("0/0 dB", val);   // 0/0 dB
                                          s_tone.BAL = val; webSrv.send("settone=", getI2STone().c_get()); setI2STone(); txt_EQ_balance.setText(c.c_get()); txt_EQ_balance.show(); goto exit; }
    if (name.equals("pgb_PL_progress")) { goto exit; }
    if (name.equals("pgb_DL_progress")) { goto exit; }

    MWR_LOG_WARN("unused event: graphicObject {} was changed, val {}", name.c_get(), val);
exit:
    return;
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnClick(ps_ptr<char> name, uint8_t val) { // val = 0 --> is inactive

    // all state
    if (name.equals("dispHeader"))                 { goto exit; }
    if (name.equals("header_Item"))                { goto exit; }
    if (name.equals("timeString"))                 { goto exit; }
    if (name.equals("dispFooter"))                 { goto exit; }
    if (name.equals("footer_StaNr"))               { goto exit; }
    if (name.equals("footer_Antenna"))             { goto exit; }
    if (name.equals("footer_Flag"))                { goto exit; }
    if (name.equals("footer_OffTimer"))            { goto exit; }
    if (name.equals("footer_Hourglass"))           { goto exit; }
    if (name.equals("footer_BitRate"))             { goto exit; }
    if (name.equals("footer_IPaddr"))              { goto exit; }

    if (s_state == RADIO) {
        if (val && name.equals("btn_RA_mute"))     { setTimeCounter(2); if (!s_f_mute) s_f_muteIsPressed = true; goto exit; }
        if (val && name.equals("btn_RA_recorder")) { goto exit; }
        if (val && name.equals("btn_RA_prevSta"))  { setTimeCounter(2); goto exit; }
        if (val && name.equals("btn_RA_nextSta"))  { setTimeCounter(2); goto exit; }
        if (val && name.equals("btn_RA_staList"))  { goto exit; }
        if (val && name.equals("btn_RA_player"))   { goto exit; }
        if (val && name.equals("btn_RA_dlna"))     { goto exit; }
        if (val && name.equals("btn_RA_clock"))    { goto exit; }
        if (val && name.equals("btn_RA_sleep"))    { goto exit; }
        if (val && name.equals("btn_RA_bright"))   { goto exit; }
        if (!val && name.equals("btn_RA_bright"))  { setTimeCounter(2); goto exit; }
        if (val && name.equals("btn_RA_equal"))    { goto exit; }
        if (val && name.equals("btn_RA_bt"))       { goto exit; }
        if (!val && name.equals("btn_RA_bt"))      { setTimeCounter(2); goto exit; }
        if (val && name.equals("btn_RA_off"))      { goto exit; }
        if (val && name.equals("btn_RA_settings")) { goto exit; }
        if (val && name.equals("VUmeter_RA"))      { goto exit; }
        if (val && name.equals("txt_RA_sTitle"))   { goto exit; }
        if (       name.equals("sdr_RA_volume"))   { goto exit; }
    }
    if (s_state == STATIONSLIST) {
        if (val && name.equals("lst_RADIO"))       { setTimeCounter(LIST_TIMER); goto exit; }
    }
    if (s_state == PLAYER) {
        if (val && name.equals("btn_PL_mute"))     { if (!s_f_mute) s_f_muteIsPressed = true; goto exit; }
        if (val && name.equals("btn_PL_pause"))    { goto exit; }
        if (val && name.equals("btn_PL_cancel"))   { goto exit; }
        if (val && name.equals("btn_PL_prevFile")) {
            if (s_cur_AudioFileNr > 0) {
                s_cur_AudioFileNr--;
                showPlayerFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                showAudioFileNumber();
            }
            goto exit;
        }
        if (val && name.equals("btn_PL_nextFile")) {
            if (s_cur_AudioFileNr + 1 < s_SD_content.getSize()) {
                s_cur_AudioFileNr++;
                showPlayerFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                showAudioFileNumber();
            }
            goto exit;
        }
        if (val && name.equals("btn_PL_ready"))    { goto exit; }
        if (val && name.equals("btn_PL_playAll"))  { goto exit; }
        if (val && name.equals("btn_PL_shuffle"))  { goto exit; }
        if (val && name.equals("btn_PL_fileList")) { goto exit; }
        if (val && name.equals("btn_PL_radio"))    { goto exit; }
        if (val && name.equals("btn_PL_off"))      { goto exit; }
        if (val && name.equals("btn_PL_playPrev")) { s_cur_AudioFileNr = s_SD_content.getPrevAudioFile(s_cur_AudioFileNr); goto exit; }
        if (val && name.equals("btn_PL_playNext")) { s_cur_AudioFileNr = s_SD_content.getNextAudioFile(s_cur_AudioFileNr); goto exit; }
        if (val && name.equals("pgb_PL_progress")) { goto exit; }
        if (val && name.equals("txt_PL_fName"))    { goto exit; }
        if (val && name.equals("sdr_PL_volume"))   { goto exit; }
    }
    if (s_state == AUDIOFILESLIST) {
        if (val && name.equals("lst_PLAYER")) { setTimeCounter(LIST_TIMER); goto exit; }
    }
    if (s_state == DLNA) {
        if (val && name.equals("btn_DL_mute"))     { if (!s_f_mute) s_f_muteIsPressed = true; goto exit; }
        if (val && name.equals("btn_DL_pause"))    { goto exit; }
        if (val && name.equals("btn_DL_radio"))    { goto exit; }
        if (val && name.equals("btn_DL_fileList")) { goto exit; }
        if (val && name.equals("btn_DL_cancel"))   { clearStationName(); btn_DL_pause.setActive(false); goto exit; }
        if (val && name.equals("pgb_DL_progress")) { goto exit; }
    }
    if (s_state == DLNAITEMSLIST) {
        if (val && name.equals("lst_DLNA")) {
            setTimeCounter(LIST_TIMER * 3);
            s_f_dlnaWaitForResponse = true;
            goto exit;
        }
    }
    if (s_state == CLOCK) {
        if (val && name.equals("btn_CL_mute"))         { if (!s_f_mute) { s_f_muteIsPressed = true; } goto exit; }
        if (val && name.equals("btn_CL_alarm"))        { goto exit; }
        if (val && name.equals("btn_CL_radio"))        { goto exit; }
        if (val && name.equals("clk_CL_24"))           { goto exit; }
        if (val && name.equals("btn_CL_off"))          { goto exit; }
    }
    if (s_state == ALARMCLOCK) {
        if (val && name.equals("clk_AC_red"))          { goto exit; }
        if (val && name.equals("btn_AC_left"))         { goto exit; }
        if (val && name.equals("btn_AC_right"))        { goto exit; }
        if (val && name.equals("btn_AC_up"))           { goto exit; }
        if (val && name.equals("btn_AC_down"))         { goto exit; }
        if (val && name.equals("btn_AC_ready"))        { goto exit; }
        if (val && name.starts_with("txt_alarm_days")) { goto exit; }
        if (val && name.starts_with("txt_alarm_time")) { goto exit; }
    }
    if (s_state == SLEEPTIMER) {
        if (val && name.equals("btn_SL_up"))      { goto exit; }
        if (val && name.equals("btn_SL_down"))    { goto exit; }
        if (val && name.equals("btn_SL_ready"))   { goto exit; }
        if (val && name.equals("btn_SL_cancel"))  { goto exit; }
    }
    if (s_state == SETTINGS) {
        if (val && name.equals("btn_SE_bright"))  { goto exit; }
        if (val && name.equals("btn_SE_equal"))   { goto exit; }
        if (val && name.equals("btn_SE_wifi"))    { goto exit; }
        if (val && name.equals("btn_SE_radio"))   { goto exit; }
    }
    if (s_state == BRIGHTNESS) {
        if (val && name.equals("btn_BR_ready"))   { goto exit; }
        if (val && name.equals("pic_BR_logo"))    { goto exit; }
    }
    if (s_state == EQUALIZER) {
        if (val && name.equals("btn_EQ_LP"))      { sdr_EQ_lowPass.setValue(0);  goto exit; }
        if (val && name.equals("btn_EQ_BP"))      { sdr_EQ_bandPass.setValue(0); goto exit; }
        if (val && name.equals("btn_EQ_HP"))      { sdr_EQ_highPass.setValue(0); goto exit; }
        if (val && name.equals("btn_EQ_BAL"))     { sdr_EQ_balance.setValue(0);  goto exit; }
        if (val && name.equals("btn_EQ_Radio"))   { goto exit; }
        if (val && name.equals("btn_EQ_Player"))  { goto exit; }
        if (val && name.equals("btn_EQ_mute"))    { if (!s_f_mute) s_f_muteIsPressed = true; goto exit; }
    }
    if (s_state == BLUETOOTH) {
        if (val && name.equals("btn_BT_pause"))   { bt_emitter.pauseResume(); goto exit; }
        if (val && name.equals("btn_BT_radio"))   { goto exit; }
        if (val && name.equals("btn_BT_volDown")) { bt_emitter.downvolume(); goto exit; }
        if (val && name.equals("btn_BT_volUp"))   { bt_emitter.upvolume();   goto exit; }
        if (val && name.equals("btn_BT_mode"))    { if(s_bt_emitter.mode.equals("RX")) s_bt_emitter.mode = "TX"; else s_bt_emitter.mode = "RX"; goto exit; }
        if (val && name.equals("btn_BT_power"))   { goto exit; }
        if (val && name.equals("txt_BT_mode"))    { goto exit; }
    }
    if (s_state == IR_SETTINGS) {
        if (val && name.equals("btn_IR_radio"))   { goto exit; }
    }
    if (s_state == WIFI_SETTINGS) {
        s_timestamp = millis() + 4000; //  every click
        if (val && name.equals("key_WI_input")) {
            MWR_LOG_DEBUG("val {}", val);
            if (val == 13) {
                changeState(RADIO, 0);
                goto exit;
            }
        }
        if (name.starts_with("txt_btn"))                       { goto exit; }
        if (val && name.equals("wifiSettings"))                { goto exit; }
        if (       name.equals("wifiSettings_keyBoard"))       { goto exit; }
        if (val && name.equals("btn_SE_wifi"))                 { goto exit; }
        if (val && name.equals("select_txtbtn_down"))          { goto exit; }
        if (val && name.equals("wifiSettings_selectbox_ssid")) { goto exit; }
        if (val && name.equals("wifiSettings_txtbox_pwd"))     { goto exit; }
        if (val && name.equals("wifiSettings_keyBoard"))       { goto exit; }
        if (val && name.equals("select_txtbox_ssid"))          { goto exit; }
        if (val && name.equals("select_txtbtn_up"))            { goto exit; }
        if (val && name.equals("select_txtbtn_down"))          { goto exit; }
    }
    MWR_LOG_WARN("unused event: graphicObject {} was clicked", name.c_get());
exit:
    return;
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnRelease(ps_ptr<char> name, releasedArg ra) {

    // all state
    if (name.equals("dispHeader")) { goto exit; }
    if (name.equals("dispFooter")) { goto exit; }

