pullead/esp32-hifi/src/main.cpp
    if (s_state == RADIO) {
        if (name.equals("btn_RA_mute"))     { muteChanged(btn_RA_mute.getValue()); goto exit; }
        if (name.equals("btn_RA_recorder")) { s_f_recording = btn_RA_recorder.getValue(); goto exit; }
        if (name.equals("btn_RA_prevSta"))  { prevFavStation(); dispFooter.updateStation(s_cur_station); goto exit; }
        if (name.equals("btn_RA_nextSta"))  { nextFavStation(); dispFooter.updateStation(s_cur_station); goto exit; }
        if (name.equals("btn_RA_staList"))  { changeState(STATIONSLIST, 0); goto exit; }
        if (name.equals("btn_RA_player"))   { changeState(PLAYER, 0);     if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_PL(0); } goto exit; }
        if (name.equals("btn_RA_dlna"))     { changeState(DLNA, 0);       if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_DL(0); } goto exit; }
        if (name.equals("btn_RA_clock"))    { changeState(CLOCK, 0);                                                                    goto exit; }
        if (name.equals("btn_RA_sleep"))    { changeState(SLEEPTIMER, 0); if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_SL(0); } goto exit; }
        if (name.equals("btn_RA_settings")) { changeState(SETTINGS, 0);   if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_SE(0); } goto exit; }
        if (name.equals("btn_RA_equal"))    { changeState(EQUALIZER, 0);  if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_EQ(0); } goto exit; }
        if (name.equals("btn_RA_bt"))       { changeState(BLUETOOTH, 0);  if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_BT(0); } goto exit; }
        if (name.equals("btn_RA_off"))      { fall_asleep(); goto exit; }
        if (name.equals("VUmeter_RA"))      { goto exit; }
        if (name.equals("sdr_RA_volume"))   { goto exit; }
    }
    if (s_state == STATIONSLIST) {
        if (name.equals("lst_RADIO"))       { if (ra.val1) { setStationByNumber(ra.val1); changeState(RADIO, 0); } goto exit; }
    }
    if (s_state == PLAYER) {
        if (name.equals("btn_PL_mute"))     { muteChanged(btn_PL_mute.getValue()); goto exit; }
        if (name.equals("btn_PL_pause"))    { if (s_f_isFSConnected) { audioPauseResumeAndUpdateState(); } goto exit; }
        if (name.equals("btn_PL_cancel"))   { stopSong(); changeState(PLAYER, 0); if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_PL(0); } goto exit; }
        if (name.equals("btn_PL_prevFile")) { if(s_ir_btn_select == 0) set_ir_pos_PL(0); goto exit; }
        if (name.equals("btn_PL_nextFile")) { if(s_ir_btn_select == 1) set_ir_pos_PL(0); goto exit; }
        if (name.equals("btn_PL_ready"))    { SD_playFile(s_cur_AudioFolder.c_get(), s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                                              changeState(PLAYER, 1); if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_PL(0); } showAudioFileNumber(); goto exit; }
        if (name.equals("btn_PL_playAll"))  { if(playlist.create_playlist_from_SD_folder(s_cur_AudioFolder)){
                                                  playlist.sort_alphabetical(); s_subState_player = 1; s_f_playlistEnabled = true; }
                                              goto exit; }
        if (name.equals("btn_PL_shuffle"))  { if(playlist.create_playlist_from_SD_folder(s_cur_AudioFolder)){
                                                  playlist.sort_random(); s_subState_player = 1; s_f_playlistEnabled = true; }
                                              goto exit; }
        if (name.equals("btn_PL_fileList")) { s_SD_content.listFilesInDir(s_cur_AudioFolder.c_get(), true, false); changeState(AUDIOFILESLIST, 0); goto exit; }
        if (name.equals("btn_PL_radio"))    { stopSong(); changeState(RADIO, 0); goto exit; }
        if (name.equals("btn_PL_off"))      { fall_asleep(); goto exit; }
        if (name.equals("sdr_PL_volume"))   { goto exit; }
        if (name.equals("btn_PL_playNext")) { SD_playFile(s_cur_AudioFolder.c_get(), s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr)); showAudioFileNumber(); goto exit; }
        if (name.equals("btn_PL_playPrev")) { SD_playFile(s_cur_AudioFolder.c_get(), s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr)); showAudioFileNumber(); goto exit; }
        if (name.equals("pgb_PL_progress")) { audio.setTimeOffset(ra.val2); goto exit; }
    }
    if (s_state == AUDIOFILESLIST) {
        if (name.equals("lst_PLAYER"))      { if (ra.val1 == 1) { ; } // wipe up/down
                                              if (ra.val1 == 2) {     // next prev folder
                                                  s_cur_AudioFolder = ra.arg1;
                                                  s_cur_AudioFileNr = ra.val2;
                                                  lst_PLAYER.show(s_cur_AudioFolder, s_cur_AudioFileNr);
                                              }
                                              if (ra.val1 == 3) {     // audio file
                                                  s_cur_AudioFolder = ra.arg1;
                                                  s_cur_AudioFileNr = ra.val2;
                                                  stopSong();
                                                  SD_playFile(ra.arg3.c_get());
                                              }
                                              goto exit; }
    }
    if (s_state == DLNA) {
        if (name.equals("btn_DL_mute"))     { muteChanged(btn_DL_mute.getValue());   if(s_ir_btn_select == 0) set_ir_pos_DL(0); goto exit; }
        if (name.equals("btn_DL_pause"))    { audioPauseResumeAndUpdateState(); if(s_ir_btn_select == 1) set_ir_pos_DL(0); goto exit; }
        if (name.equals("btn_DL_cancel"))   { stopSong();
                                              txt_DL_fName.setText("");
                                              txt_DL_fName.show();
                                              pgb_DL_progress.reset();
                                              btn_DL_pause.setActive(false);
                                              btn_DL_pause.show();
                                              if(s_ir_btn_select == 3) set_ir_pos_DL(0);
                                              goto exit; }
        if (name.equals("btn_DL_fileList")) { changeState(DLNAITEMSLIST, 0); txt_DL_fName.setText(""); goto exit; }
        if (name.equals("btn_DL_radio"))    { stopSong(); changeState(RADIO, 0); goto exit; }
        if (name.equals("sdr_DL_volume"))   { goto exit; }
        if (name.equals("pgb_DL_progress")) { audio.setTimeOffset(ra.val2); goto exit; }
    }
    if (s_state == DLNAITEMSLIST) {
        if (name.equals("lst_DLNA"))        {   if (ra.val1 == 0) { // wipe up/down
                                                    goto exit;
                                                }
                                                if (ra.val1 == 1) { // play a file
                                                    txt_DL_fName.setTextColor(TFT_CYAN);
                                                    txt_DL_fName.setText(ra.arg2.c_get());
                                                    connecttohost(ra.arg1);
                                                    changeState(DLNA, 0);
                                                    goto exit;
                                                }
                                                if (ra.val1 == 2) {// browse dlna object, waiting for content and create a playlist
                                                    dlna.browseServer(ra.val2, ra.arg1.c_get(), 0, 50);
                                                    s_f_dlnaMakePlaylistOTF = true;
                                                    goto exit;
                                                }
                                                else {
                                                    MWR_LOG_WARN("unknown val: {}", ra.val1);
                                                }
                                            }
    }
    if (s_state == CLOCK) {
        if (name.equals("btn_CL_mute"))     { muteChanged(btn_CL_mute.getValue()); if(s_ir_btn_select == 2) set_ir_pos_CL(2); goto exit; }
        if (name.equals("btn_CL_alarm"))    { changeState(ALARMCLOCK, 0); if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_AC(0); } goto exit; }
        if (name.equals("btn_CL_radio"))    { changeState(RADIO, 0); goto exit; }
        if (name.equals("clk_CL_24"))       { changeState(CLOCK, 0); goto exit; }
        if (name.equals("btn_CL_off"))      { fall_asleep(); goto exit; }
        if (name.equals("sdr_CL_volume"))   { goto exit; }
    }
    if (s_state == ALARMCLOCK) {
        if (name.equals("clk_AC_red"))      { goto exit; }
        if (name.equals("btn_AC_left"))     { clk_AC_red.shiftLeft();  if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_AC(0); } goto exit; }
        if (name.equals("btn_AC_right"))    { clk_AC_red.shiftRight(); if(s_f_ok_from_ir) { s_ir_btn_select = 1; set_ir_pos_AC(1); } goto exit; }
        if (name.equals("btn_AC_up"))       { clk_AC_red.digitUp();    if(s_f_ok_from_ir) { s_ir_btn_select = 2; set_ir_pos_AC(2); } goto exit; }
        if (name.equals("btn_AC_down"))     { clk_AC_red.digitDown();  if(s_f_ok_from_ir) { s_ir_btn_select = 3; set_ir_pos_AC(3); } goto exit; }
        if (name.equals("btn_AC_ready"))    { updateSettings(); changeState(CLOCK, 0); logAlarmItems(); goto exit; }
    }
    if (s_state == SLEEPTIMER) {
        if (name.equals("btn_SL_up"))       { display_sleeptime(1);  if(s_ir_btn_select == 0) set_ir_pos_SL(0); goto exit; }
        if (name.equals("btn_SL_down"))     { display_sleeptime(-1); if(s_ir_btn_select == 1) set_ir_pos_SL(1); goto exit; }
        if (name.equals("btn_SL_ready"))    { dispFooter.updateOffTime(s_sleeptime); changeState(RADIO, 0); goto exit; }
        if (name.equals("btn_SL_cancel"))   { changeState(RADIO, 0); goto exit; }
    }
    if (s_state == BRIGHTNESS) {
        if (name.equals("btn_BR_ready"))    { changeState(RADIO, 0); goto exit;}
        if (name.equals("pic_BR_logo"))     { goto exit; }
        if (name.equals("sdr_BR_value"))    { goto exit; }
    }
    if (s_state == EQUALIZER) {
        if (name.equals("btn_EQ_Radio"))    { changeState(RADIO, 0); goto exit; }
        if (name.equals("btn_EQ_Player"))   { changeState(PLAYER, 0); goto exit; }
        if (name.equals("btn_EQ_mute"))     { muteChanged(btn_EQ_mute.getValue()); if(s_ir_btn_select == 2) set_ir_pos_EQ(2); goto exit; }
        if (name.equals("btn_EQ_BAL"))      {                                      if(s_ir_btn_select == 3) set_ir_pos_EQ(3); goto exit; }
        if (name.equals("btn_EQ_LP"))       {                                      if(s_ir_btn_select == 4) set_ir_pos_EQ(4); goto exit; }
        if (name.equals("btn_EQ_BP"))       {                                      if(s_ir_btn_select == 5) set_ir_pos_EQ(5); goto exit; }
        if (name.equals("btn_EQ_HP"))       {                                      if(s_ir_btn_select == 6) set_ir_pos_EQ(6); goto exit; }
        if (name.equals("sdr_EQ_HP"))       { goto exit; }
        if (name.equals("sdr_EQ_BP"))       { goto exit; }
        if (name.equals("sdr_EQ_LP"))       { goto exit; }
        if (name.equals("sdr_EQ_BAL"))      { goto exit; }
    }
    if (s_state == SETTINGS) {
        if (name.equals("btn_SE_bright"))   { changeState(BRIGHTNESS, 0);    if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_BR(0); } goto exit; }
        if (name.equals("btn_SE_equal"))    { changeState(EQUALIZER, 0);     if(s_f_ok_from_ir) { s_ir_btn_select = 0; set_ir_pos_EQ(0); } goto exit; }
        if (name.equals("btn_SE_wifi"))     { changeState(WIFI_SETTINGS, 0); goto exit; }
        if (name.equals("btn_SE_radio"))    { changeState(RADIO, 0); goto exit; }
    }
    if (s_state == BLUETOOTH) {
        if (name.equals("btn_BT_volDown"))  { if(s_ir_btn_select == 0) set_ir_pos_BT(0); goto exit; }
        if (name.equals("btn_BT_volUp"))    { if(s_ir_btn_select == 1) set_ir_pos_BT(1); goto exit; }
        if (name.equals("btn_BT_pause"))    { if(s_ir_btn_select == 2) set_ir_pos_BT(2); goto exit; }
        if (name.equals("btn_BT_mode"))     { if(s_ir_btn_select == 3) set_ir_pos_BT(3); goto exit; }
        if (name.equals("btn_BT_radio"))    { changeState(RADIO, 0); goto exit; }
        if (name.equals("btn_BT_power"))    { if(s_ir_btn_select == 5 && s_bt_emitter.found) set_ir_pos_BT(5); s_bt_emitter.enabled = !s_bt_emitter.enabled; goto exit; }
    }
    if (s_state == IR_SETTINGS) {
        if (name.equals("btn_IR_radio"))    { changeState(RADIO, 0); goto exit; }
    }
    if (s_state == WIFI_SETTINGS) {
        if (name.equals("wifiSettings"))    { setWiFiCredentials(ra.arg1.c_get(), ra.arg2.c_get());
                                              msg_box.setText("ESP restart", false, false);
                                              msg_box.show();
                                              vTaskDelay(2000);
                                              s_f_msg_box = true;
                                              s_f_esp_restart = true;
                                              goto exit; }
        if (name.starts_with("txt_btn"))                { goto exit; }
        if (name.equals("wifiSettings_selectbox_ssid")) { goto exit; }
        if (name.equals("wifiSettings_txtbox_pwd"))     { goto exit; }
        if (name.equals("select_txtbtn_up"))            { goto exit; }
        if (name.equals("select_txtbtn_down"))          { goto exit; }
        if (name.equals("select_txtbox_ssid"))          { goto exit; }
    }
    MWR_LOG_WARN("unused event: graphicObject {} was released", name);
exit:
    s_f_ok_from_ir = false;
    return;
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// clang-format on
/*🟢🟡🔴*/
